zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
/**
 * \file
 *
 * Copyright (c) 2012 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef SAM0+D_H
#define SAM0+D_H

/** \addtogroup SAM0+D_definitions SAM0+D definitions
  This file defines all structures and symbols for SAM0+D:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#ifndef __ASSEMBLY__
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_cmsis CMSIS Definitions */
/*@{*/


/**< Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M0+ Processor Exceptions Numbers ****************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                 */
  HardFault_IRQn        = -13, /**<  3 Cortex-M0+ Hard Fault Interrupt        */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M0+ SV Call Interrupt           */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M0+ Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M0+ System Tick Interrupt       */
  /******  SAM0+D-specific Interrupt Numbers ***********************/
  PM_CFD_IRQn           =  0, /**<  0 SAM0+D Power Manager (PM) */
  PM_CKRDY_IRQn         =  0, /**<  0 SAM0+D Power Manager (PM) */
  SYSCTRL_BOD12DET_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_BOD12RDY_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_BOD12SYNRDY_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_BOD33DET_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_BOD33RDY_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_BOD33SYNRDY_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_DFLLLOCKC_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_DFLLLOCKF_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_DFLLOOB_IRQn  =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_DFLLRCS_IRQn  =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_DFLLRDY_IRQn  =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_OSC32KRDY_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_XOSCRDY_IRQn  =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  SYSCTRL_XOSC32RDY_IRQn =  1, /**<  1 SAM0+D System Control (SYSCTRL) */
  WDT_EW_IRQn           =  2, /**<  2 SAM0+D Watchdog Timer (WDT) */
  RTC_CMP_0_IRQn        =  3, /**<  3 SAM0+D Real-Time Counter (RTC) */
  RTC_CMP_1_IRQn        =  3, /**<  3 SAM0+D Real-Time Counter (RTC) */
  RTC_OVF_IRQn          =  3, /**<  3 SAM0+D Real-Time Counter (RTC) */
  RTC_READY_IRQn        =  3, /**<  3 SAM0+D Real-Time Counter (RTC) */
  EIC_EXTINT_0_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_1_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_2_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_3_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_4_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_5_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_6_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_7_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_8_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_9_IRQn     =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_10_IRQn    =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_11_IRQn    =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_12_IRQn    =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_13_IRQn    =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_14_IRQn    =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  EIC_EXTINT_15_IRQn    =  4, /**<  4 SAM0+D External Interrupt Controller (EIC) */
  NVMCTRL_0_IRQn        =  5, /**<  5 SAM0+D Non-Volatile Memory Controller (NVMCTRL) */
  NVMCTRL_1_IRQn        =  5, /**<  5 SAM0+D Non-Volatile Memory Controller (NVMCTRL) */
  EVSYS_EVD_0_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_1_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_2_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_3_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_4_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_5_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_6_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_EVD_7_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_0_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_1_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_2_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_3_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_4_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_5_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_6_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  EVSYS_OVR_7_IRQn      =  6, /**<  6 SAM0+D Event System Interface (EVSYS) */
  SERCOM0_0_IRQn        =  7, /**<  7 SAM0+D Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_1_IRQn        =  7, /**<  7 SAM0+D Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_2_IRQn        =  7, /**<  7 SAM0+D Serial Communication Interface 0 (SERCOM0) */
  SERCOM0_3_IRQn        =  7, /**<  7 SAM0+D Serial Communication Interface 0 (SERCOM0) */
  SERCOM1_0_IRQn        =  8, /**<  8 SAM0+D Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_1_IRQn        =  8, /**<  8 SAM0+D Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_2_IRQn        =  8, /**<  8 SAM0+D Serial Communication Interface 1 (SERCOM1) */
  SERCOM1_3_IRQn        =  8, /**<  8 SAM0+D Serial Communication Interface 1 (SERCOM1) */
  SERCOM2_0_IRQn        =  9, /**<  9 SAM0+D Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_1_IRQn        =  9, /**<  9 SAM0+D Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_2_IRQn        =  9, /**<  9 SAM0+D Serial Communication Interface 2 (SERCOM2) */
  SERCOM2_3_IRQn        =  9, /**<  9 SAM0+D Serial Communication Interface 2 (SERCOM2) */
  SERCOM3_0_IRQn        = 10, /**< 10 SAM0+D Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_1_IRQn        = 10, /**< 10 SAM0+D Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_2_IRQn        = 10, /**< 10 SAM0+D Serial Communication Interface 3 (SERCOM3) */
  SERCOM3_3_IRQn        = 10, /**< 10 SAM0+D Serial Communication Interface 3 (SERCOM3) */
  SERCOM4_0_IRQn        = 11, /**< 11 SAM0+D Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_1_IRQn        = 11, /**< 11 SAM0+D Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_2_IRQn        = 11, /**< 11 SAM0+D Serial Communication Interface 4 (SERCOM4) */
  SERCOM4_3_IRQn        = 11, /**< 11 SAM0+D Serial Communication Interface 4 (SERCOM4) */
  SERCOM5_0_IRQn        = 12, /**< 12 SAM0+D Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_1_IRQn        = 12, /**< 12 SAM0+D Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_2_IRQn        = 12, /**< 12 SAM0+D Serial Communication Interface 5 (SERCOM5) */
  SERCOM5_3_IRQn        = 12, /**< 12 SAM0+D Serial Communication Interface 5 (SERCOM5) */
  TC0_ERR_IRQn          = 13, /**< 13 SAM0+D Basic Timer Counter 0 (TC0) */
  TC0_MC_0_IRQn         = 13, /**< 13 SAM0+D Basic Timer Counter 0 (TC0) */
  TC0_MC_1_IRQn         = 13, /**< 13 SAM0+D Basic Timer Counter 0 (TC0) */
  TC0_OVF_IRQn          = 13, /**< 13 SAM0+D Basic Timer Counter 0 (TC0) */
  TC0_READY_IRQn        = 13, /**< 13 SAM0+D Basic Timer Counter 0 (TC0) */
  TC1_ERR_IRQn          = 14, /**< 14 SAM0+D Basic Timer Counter 1 (TC1) */
  TC1_MC_0_IRQn         = 14, /**< 14 SAM0+D Basic Timer Counter 1 (TC1) */
  TC1_MC_1_IRQn         = 14, /**< 14 SAM0+D Basic Timer Counter 1 (TC1) */
  TC1_OVF_IRQn          = 14, /**< 14 SAM0+D Basic Timer Counter 1 (TC1) */
  TC1_READY_IRQn        = 14, /**< 14 SAM0+D Basic Timer Counter 1 (TC1) */
  TC2_ERR_IRQn          = 15, /**< 15 SAM0+D Basic Timer Counter 2 (TC2) */
  TC2_MC_0_IRQn         = 15, /**< 15 SAM0+D Basic Timer Counter 2 (TC2) */
  TC2_MC_1_IRQn         = 15, /**< 15 SAM0+D Basic Timer Counter 2 (TC2) */
  TC2_OVF_IRQn          = 15, /**< 15 SAM0+D Basic Timer Counter 2 (TC2) */
  TC2_READY_IRQn        = 15, /**< 15 SAM0+D Basic Timer Counter 2 (TC2) */
  TC3_ERR_IRQn          = 16, /**< 16 SAM0+D Basic Timer Counter 3 (TC3) */
  TC3_MC_0_IRQn         = 16, /**< 16 SAM0+D Basic Timer Counter 3 (TC3) */
  TC3_MC_1_IRQn         = 16, /**< 16 SAM0+D Basic Timer Counter 3 (TC3) */
  TC3_OVF_IRQn          = 16, /**< 16 SAM0+D Basic Timer Counter 3 (TC3) */
  TC3_READY_IRQn        = 16, /**< 16 SAM0+D Basic Timer Counter 3 (TC3) */
  TC4_ERR_IRQn          = 17, /**< 17 SAM0+D Basic Timer Counter 4 (TC4) */
  TC4_MC_0_IRQn         = 17, /**< 17 SAM0+D Basic Timer Counter 4 (TC4) */
  TC4_MC_1_IRQn         = 17, /**< 17 SAM0+D Basic Timer Counter 4 (TC4) */
  TC4_OVF_IRQn          = 17, /**< 17 SAM0+D Basic Timer Counter 4 (TC4) */
  TC4_READY_IRQn        = 17, /**< 17 SAM0+D Basic Timer Counter 4 (TC4) */
  TC5_ERR_IRQn          = 18, /**< 18 SAM0+D Basic Timer Counter 5 (TC5) */
  TC5_MC_0_IRQn         = 18, /**< 18 SAM0+D Basic Timer Counter 5 (TC5) */
  TC5_MC_1_IRQn         = 18, /**< 18 SAM0+D Basic Timer Counter 5 (TC5) */
  TC5_OVF_IRQn          = 18, /**< 18 SAM0+D Basic Timer Counter 5 (TC5) */
  TC5_READY_IRQn        = 18, /**< 18 SAM0+D Basic Timer Counter 5 (TC5) */
  TC6_ERR_IRQn          = 19, /**< 19 SAM0+D Basic Timer Counter 6 (TC6) */
  TC6_MC_0_IRQn         = 19, /**< 19 SAM0+D Basic Timer Counter 6 (TC6) */
  TC6_MC_1_IRQn         = 19, /**< 19 SAM0+D Basic Timer Counter 6 (TC6) */
  TC6_OVF_IRQn          = 19, /**< 19 SAM0+D Basic Timer Counter 6 (TC6) */
  TC6_READY_IRQn        = 19, /**< 19 SAM0+D Basic Timer Counter 6 (TC6) */
  TC7_ERR_IRQn          = 20, /**< 20 SAM0+D Basic Timer Counter 7 (TC7) */
  TC7_MC_0_IRQn         = 20, /**< 20 SAM0+D Basic Timer Counter 7 (TC7) */
  TC7_MC_1_IRQn         = 20, /**< 20 SAM0+D Basic Timer Counter 7 (TC7) */
  TC7_OVF_IRQn          = 20, /**< 20 SAM0+D Basic Timer Counter 7 (TC7) */
  TC7_READY_IRQn        = 20, /**< 20 SAM0+D Basic Timer Counter 7 (TC7) */
  ADC_OVERRUN_IRQn      = 21, /**< 21 SAM0+D Analog Digital Converter (ADC) */
  ADC_READY_IRQn        = 21, /**< 21 SAM0+D Analog Digital Converter (ADC) */
  ADC_RESRDY_IRQn       = 21, /**< 21 SAM0+D Analog Digital Converter (ADC) */
  ADC_WINMON_IRQn       = 21, /**< 21 SAM0+D Analog Digital Converter (ADC) */
  AC_COMP_0_IRQn        = 22, /**< 22 SAM0+D Analog Comparators (AC) */
  AC_COMP_1_IRQn        = 22, /**< 22 SAM0+D Analog Comparators (AC) */
  AC_WIN_0_IRQn         = 22, /**< 22 SAM0+D Analog Comparators (AC) */
  DAC_EMPTY_IRQn        = 23, /**< 23 SAM0+D Digital Analog Converter (DAC) */
  DAC_READY_IRQn        = 23, /**< 23 SAM0+D Digital Analog Converter (DAC) */
  DAC_UNDERRUN_IRQn     = 23, /**< 23 SAM0+D Digital Analog Converter (DAC) */
  PTC_EOC_IRQn          = 24, /**< 24 SAM0+D Peripheral Touch Controller (PTC) */
  PTC_READY_IRQn        = 24, /**< 24 SAM0+D Peripheral Touch Controller (PTC) */
  PTC_WCOMP_IRQn        = 24  /**< 24 SAM0+D Peripheral Touch Controller (PTC) */
} IRQn_Type;

/* Cortex-M0+ processor handlers */
void Reset_Handler            ( void );
void NMI_Handler              ( void );
void HardFault_Handler        ( void );
void SVCall_Handler           ( void );
void PendSV_Handler           ( void );
void SysTick_Handler          ( void );

/* Peripherals handlers */
void PM_CFD_Handler     ( void );
void PM_CKRDY_Handler   ( void );
void SYSCTRL_BOD12DET_Handler ( void );
void SYSCTRL_BOD12RDY_Handler ( void );
void SYSCTRL_BOD12SYNRDY_Handler ( void );
void SYSCTRL_BOD33DET_Handler ( void );
void SYSCTRL_BOD33RDY_Handler ( void );
void SYSCTRL_BOD33SYNRDY_Handler ( void );
void SYSCTRL_DFLLLOCKC_Handler ( void );
void SYSCTRL_DFLLLOCKF_Handler ( void );
void SYSCTRL_DFLLOOB_Handler ( void );
void SYSCTRL_DFLLRCS_Handler ( void );
void SYSCTRL_DFLLRDY_Handler ( void );
void SYSCTRL_OSC32KRDY_Handler ( void );
void SYSCTRL_XOSCRDY_Handler ( void );
void SYSCTRL_XOSC32RDY_Handler ( void );
void WDT_EW_Handler     ( void );
void RTC_CMP_0_Handler  ( void );
void RTC_CMP_1_Handler  ( void );
void RTC_OVF_Handler    ( void );
void RTC_READY_Handler  ( void );
void EIC_EXTINT_0_Handler ( void );
void EIC_EXTINT_1_Handler ( void );
void EIC_EXTINT_2_Handler ( void );
void EIC_EXTINT_3_Handler ( void );
void EIC_EXTINT_4_Handler ( void );
void EIC_EXTINT_5_Handler ( void );
void EIC_EXTINT_6_Handler ( void );
void EIC_EXTINT_7_Handler ( void );
void EIC_EXTINT_8_Handler ( void );
void EIC_EXTINT_9_Handler ( void );
void EIC_EXTINT_10_Handler ( void );
void EIC_EXTINT_11_Handler ( void );
void EIC_EXTINT_12_Handler ( void );
void EIC_EXTINT_13_Handler ( void );
void EIC_EXTINT_14_Handler ( void );
void EIC_EXTINT_15_Handler ( void );
void NVMCTRL_0_Handler  ( void );
void NVMCTRL_1_Handler  ( void );
void EVSYS_EVD_0_Handler ( void );
void EVSYS_EVD_1_Handler ( void );
void EVSYS_EVD_2_Handler ( void );
void EVSYS_EVD_3_Handler ( void );
void EVSYS_EVD_4_Handler ( void );
void EVSYS_EVD_5_Handler ( void );
void EVSYS_EVD_6_Handler ( void );
void EVSYS_EVD_7_Handler ( void );
void EVSYS_OVR_0_Handler ( void );
void EVSYS_OVR_1_Handler ( void );
void EVSYS_OVR_2_Handler ( void );
void EVSYS_OVR_3_Handler ( void );
void EVSYS_OVR_4_Handler ( void );
void EVSYS_OVR_5_Handler ( void );
void EVSYS_OVR_6_Handler ( void );
void EVSYS_OVR_7_Handler ( void );
void SERCOM0_0_Handler  ( void );
void SERCOM0_1_Handler  ( void );
void SERCOM0_2_Handler  ( void );
void SERCOM0_3_Handler  ( void );
void SERCOM1_0_Handler  ( void );
void SERCOM1_1_Handler  ( void );
void SERCOM1_2_Handler  ( void );
void SERCOM1_3_Handler  ( void );
void SERCOM2_0_Handler  ( void );
void SERCOM2_1_Handler  ( void );
void SERCOM2_2_Handler  ( void );
void SERCOM2_3_Handler  ( void );
void SERCOM3_0_Handler  ( void );
void SERCOM3_1_Handler  ( void );
void SERCOM3_2_Handler  ( void );
void SERCOM3_3_Handler  ( void );
void SERCOM4_0_Handler  ( void );
void SERCOM4_1_Handler  ( void );
void SERCOM4_2_Handler  ( void );
void SERCOM4_3_Handler  ( void );
void SERCOM5_0_Handler  ( void );
void SERCOM5_1_Handler  ( void );
void SERCOM5_2_Handler  ( void );
void SERCOM5_3_Handler  ( void );
void TC0_ERR_Handler    ( void );
void TC0_MC_0_Handler   ( void );
void TC0_MC_1_Handler   ( void );
void TC0_OVF_Handler    ( void );
void TC0_READY_Handler  ( void );
void TC1_ERR_Handler    ( void );
void TC1_MC_0_Handler   ( void );
void TC1_MC_1_Handler   ( void );
void TC1_OVF_Handler    ( void );
void TC1_READY_Handler  ( void );
void TC2_ERR_Handler    ( void );
void TC2_MC_0_Handler   ( void );
void TC2_MC_1_Handler   ( void );
void TC2_OVF_Handler    ( void );
void TC2_READY_Handler  ( void );
void TC3_ERR_Handler    ( void );
void TC3_MC_0_Handler   ( void );
void TC3_MC_1_Handler   ( void );
void TC3_OVF_Handler    ( void );
void TC3_READY_Handler  ( void );
void TC4_ERR_Handler    ( void );
void TC4_MC_0_Handler   ( void );
void TC4_MC_1_Handler   ( void );
void TC4_OVF_Handler    ( void );
void TC4_READY_Handler  ( void );
void TC5_ERR_Handler    ( void );
void TC5_MC_0_Handler   ( void );
void TC5_MC_1_Handler   ( void );
void TC5_OVF_Handler    ( void );
void TC5_READY_Handler  ( void );
void TC6_ERR_Handler    ( void );
void TC6_MC_0_Handler   ( void );
void TC6_MC_1_Handler   ( void );
void TC6_OVF_Handler    ( void );
void TC6_READY_Handler  ( void );
void TC7_ERR_Handler    ( void );
void TC7_MC_0_Handler   ( void );
void TC7_MC_1_Handler   ( void );
void TC7_OVF_Handler    ( void );
void TC7_READY_Handler  ( void );
void ADC_OVERRUN_Handler ( void );
void ADC_READY_Handler  ( void );
void ADC_RESRDY_Handler ( void );
void ADC_WINMON_Handler ( void );
void AC_COMP_0_Handler  ( void );
void AC_COMP_1_Handler  ( void );
void AC_WIN_0_Handler   ( void );
void DAC_EMPTY_Handler  ( void );
void DAC_READY_Handler  ( void );
void DAC_UNDERRUN_Handler ( void );
void PTC_EOC_Handler    ( void );
void PTC_READY_Handler  ( void );
void PTC_WCOMP_Handler  ( void );

