zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
/*
 * \brief Configuration of the Cortex-M0+ CPU and Core Peripherals
 */

#define LITTLE_ENDIAN          1        
#define __CM0P_REV             0x0000    /*!< Core revision r0p0 */
#define __MPU_PRESENT          0         /*!< MPU present or not */
#define __NVIC_PRIO_BITS       2         /*!< Number of bits used for Priority Levels */
#define __VTOR_PRESENT         1         /*!< VTOR present or not */
#define __Vendor_SysTickConfig 0         /*!< Set to 1 if different SysTick Config is used */

/**
 * \brief CMSIS includes
 */

#include <core_cm0p.h>

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_api Peripheral Software API */
/*@{*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AC */
/* ========================================================================== */
/** \addtogroup SAM0+D_AC Analog Comparators */
/*@{*/

#define REV_AC         0x100

#ifndef __ASSEMBLY__

#ifndef __EXCLUDE_AC_FROM_CMSIS__

/* -------- AC_CTRLA : (AC Offset: 0x00) (R/W  8) Control A Register -------- */
typedef union {
  struct {
    uint8_t  SWRST:1;          /*!< bit:      0  Software Reset                     */
    uint8_t  ENABLE:1;         /*!< bit:      1  Enable                             */
    uint8_t  RUNSTDBY:1;       /*!< bit:      2  Run during Standby                 */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} AC_CTRLA_Type;

#define AC_CTRLA_OFFSET             0x00         /**< \brief (AC_CTRLA offset) Control A Register */
#define AC_CTRLA_RESETVALUE         0x00         /**< \brief (AC_CTRLA reset_value) Control A Register */

#define AC_CTRLA_SWRST              (0x1u <<  0) /**< \brief (AC_CTRLA) Software Reset */
#define AC_CTRLA_ENABLE             (0x1u <<  1) /**< \brief (AC_CTRLA) Enable */
#define AC_CTRLA_RUNSTDBY           (0x1u <<  2) /**< \brief (AC_CTRLA) Run during Standby */
#define AC_CTRLA_MASK               0x7u /**< \brief (AC_CTRLA) MASK Register */

/* -------- AC_CTRLB : (AC Offset: 0x01) ( /W  8) Control B Register -------- */
typedef union {
  struct {
    uint8_t  START0:1;         /*!< bit:      0  Comparator 0 Start Comparison      */
    uint8_t  START1:1;         /*!< bit:      1  Comparator 1 Start Comparison      */
    uint8_t  START2:1;         /*!< bit:      2  Comparator 2 Start Comparison      */
    uint8_t  START3:1;         /*!< bit:      3  Comparator 3 Start Comparison      */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} AC_CTRLB_Type;

#define AC_CTRLB_OFFSET             0x01         /**< \brief (AC_CTRLB offset) Control B Register */
#define AC_CTRLB_RESETVALUE         0x00         /**< \brief (AC_CTRLB reset_value) Control B Register */

#define AC_CTRLB_START0             (0x1u <<  0) /**< \brief (AC_CTRLB) Comparator 0 Start Comparison */
#define AC_CTRLB_START1             (0x1u <<  1) /**< \brief (AC_CTRLB) Comparator 1 Start Comparison */
#define AC_CTRLB_START2             (0x1u <<  2) /**< \brief (AC_CTRLB) Comparator 2 Start Comparison */
#define AC_CTRLB_START3             (0x1u <<  3) /**< \brief (AC_CTRLB) Comparator 3 Start Comparison */
#define AC_CTRLB_MASK               0xFu /**< \brief (AC_CTRLB) MASK Register */

/* -------- AC_EVCTRL : (AC Offset: 0x02) (R/W 16) Event Control Register -------- */
typedef union {
  struct {
    uint16_t COMPEO0:1;        /*!< bit:      0  Comparator 0 Event Output Enable   */
    uint16_t COMPEO1:1;        /*!< bit:      1  Comparator 1 Event Output Enable   */
    uint16_t COMPEO2:1;        /*!< bit:      2  Comparator 2 Event Output Enable   */
    uint16_t COMPEO3:1;        /*!< bit:      3  Comparator 3 Event Output Enable   */
    uint16_t WINEO0:1;         /*!< bit:      4  Window 0 Event Output Enable       */
    uint16_t WINEO1:1;         /*!< bit:      5  Window 1 Event Output Enable       */
    uint16_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint16_t COMPEI0:1;        /*!< bit:      8  Comparator 0 Event Input Enable    */
    uint16_t COMPEI1:1;        /*!< bit:      9  Comparator 1 Event Input Enable    */
    uint16_t COMPEI2:1;        /*!< bit:     10  Comparator 2 Event Input Enable    */
    uint16_t COMPEI3:1;        /*!< bit:     11  Comparator 3 Event Input Enable    */
    uint16_t :4;               /*!< bit: 12..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} AC_EVCTRL_Type;

#define AC_EVCTRL_OFFSET            0x02         /**< \brief (AC_EVCTRL offset) Event Control Register */
#define AC_EVCTRL_RESETVALUE        0x0000       /**< \brief (AC_EVCTRL reset_value) Event Control Register */

#define AC_EVCTRL_COMPEO0           (0x1u <<  0) /**< \brief (AC_EVCTRL) Comparator 0 Event Output Enable */
#define AC_EVCTRL_COMPEO1           (0x1u <<  1) /**< \brief (AC_EVCTRL) Comparator 1 Event Output Enable */
#define AC_EVCTRL_COMPEO2           (0x1u <<  2) /**< \brief (AC_EVCTRL) Comparator 2 Event Output Enable */
#define AC_EVCTRL_COMPEO3           (0x1u <<  3) /**< \brief (AC_EVCTRL) Comparator 3 Event Output Enable */
#define AC_EVCTRL_WINEO0            (0x1u <<  4) /**< \brief (AC_EVCTRL) Window 0 Event Output Enable */
#define AC_EVCTRL_WINEO1            (0x1u <<  5) /**< \brief (AC_EVCTRL) Window 1 Event Output Enable */
#define AC_EVCTRL_COMPEI0           (0x1u <<  8) /**< \brief (AC_EVCTRL) Comparator 0 Event Input Enable */
#define AC_EVCTRL_COMPEI1           (0x1u <<  9) /**< \brief (AC_EVCTRL) Comparator 1 Event Input Enable */
#define AC_EVCTRL_COMPEI2           (0x1u << 10) /**< \brief (AC_EVCTRL) Comparator 2 Event Input Enable */
#define AC_EVCTRL_COMPEI3           (0x1u << 11) /**< \brief (AC_EVCTRL) Comparator 3 Event Input Enable */
#define AC_EVCTRL_MASK              0xF3Fu /**< \brief (AC_EVCTRL) MASK Register */

