zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
/* -------- PTC_STATUS : (PTC Offset: 0x01) (R/   8) Status Register -------- */
typedef union {
  struct {
    uint8_t  SWRST:1;          /*!< bit:      0  Software Reset Status              */
    uint8_t  ENABLE:1;         /*!< bit:      1  Enable Status                      */
    uint8_t  :1;               /*!< bit:      2  Reserved                           */
    uint8_t  CTSBUSY:1;        /*!< bit:      3  CTS Busy                           */
    uint8_t  :3;               /*!< bit:  4.. 6  Reserved                           */
    uint8_t  SYNCBUSY:1;       /*!< bit:      7  Synchronization Busy               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_STATUS_Type;

#define PTC_STATUS_OFFSET           0x01         /**< \brief (PTC_STATUS offset) Status Register */
#define PTC_STATUS_RESETVALUE       0x00         /**< \brief (PTC_STATUS reset_value) Status Register */

#define PTC_STATUS_SWRST            (0x1u <<  0) /**< \brief (PTC_STATUS) Software Reset Status */
#define PTC_STATUS_ENABLE           (0x1u <<  1) /**< \brief (PTC_STATUS) Enable Status */
#define PTC_STATUS_CTSBUSY          (0x1u <<  3) /**< \brief (PTC_STATUS) CTS Busy */
#define PTC_STATUS_SYNCBUSY         (0x1u <<  7) /**< \brief (PTC_STATUS) Synchronization Busy */
#define PTC_STATUS_MASK             0x8Bu /**< \brief (PTC_STATUS) MASK Register */

/* -------- PTC_CTRLB : (PTC Offset: 0x04) (R/W  8) Control Register B -------- */
typedef union {
  struct {
    uint8_t  PRSC:2;           /*!< bit:  0.. 1  Clock Prescaler                    */
    uint8_t  FREERUN:1;        /*!< bit:      2  Freerunning PTC                    */
    uint8_t  ADRS:1;           /*!< bit:      3  ADC Resolution Select              */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTRLB_Type;

#define PTC_CTRLB_OFFSET            0x04         /**< \brief (PTC_CTRLB offset) Control Register B */
#define PTC_CTRLB_RESETVALUE        0x00         /**< \brief (PTC_CTRLB reset_value) Control Register B */

#define PTC_CTRLB_PRSC_Pos          0
#define PTC_CTRLB_PRSC_Msk          (0x3u << PTC_CTRLB_PRSC_Pos) /**< \brief (PTC_CTRLB) Clock Prescaler */
#define PTC_CTRLB_PRSC(value)       ((PTC_CTRLB_PRSC_Msk & ((value) << PTC_CTRLB_PRSC_Pos)))
#define PTC_CTRLB_FREERUN           (0x1u <<  2) /**< \brief (PTC_CTRLB) Freerunning PTC */
#define PTC_CTRLB_ADRS              (0x1u <<  3) /**< \brief (PTC_CTRLB) ADC Resolution Select */
#define PTC_CTRLB_MASK              0xFu /**< \brief (PTC_CTRLB) MASK Register */

/* -------- PTC_EVCTRL : (PTC Offset: 0x05) (R/W  8) Event Control Register -------- */
typedef union {
  struct {
    uint8_t  STCONVEI:1;       /*!< bit:      0  Start Conversion Event Input       */
    uint8_t  EOCEO:1;          /*!< bit:      1  End of Conversion Event Output     */
    uint8_t  WCOMPEO:1;        /*!< bit:      2  Window Comparator Event Output     */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_EVCTRL_Type;

#define PTC_EVCTRL_OFFSET           0x05         /**< \brief (PTC_EVCTRL offset) Event Control Register */
#define PTC_EVCTRL_RESETVALUE       0x00         /**< \brief (PTC_EVCTRL reset_value) Event Control Register */

#define PTC_EVCTRL_STCONVEI         (0x1u <<  0) /**< \brief (PTC_EVCTRL) Start Conversion Event Input */
#define PTC_EVCTRL_EOCEO            (0x1u <<  1) /**< \brief (PTC_EVCTRL) End of Conversion Event Output */
#define PTC_EVCTRL_WCOMPEO          (0x1u <<  2) /**< \brief (PTC_EVCTRL) Window Comparator Event Output */
#define PTC_EVCTRL_MASK             0x7u /**< \brief (PTC_EVCTRL) MASK Register */

/* -------- PTC_INTENCLR : (PTC Offset: 0x08) (R/W  8) Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  EOC:1;            /*!< bit:      0  End of Conversion Interrupt Disable */
    uint8_t  WCOMP:1;          /*!< bit:      1  Window Compare Interrupt Disable   */
    uint8_t  READY:1;          /*!< bit:      2  Ready Interrupt Disable            */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTENCLR_Type;

#define PTC_INTENCLR_OFFSET         0x08         /**< \brief (PTC_INTENCLR offset) Interrupt Enable Clear Register */
#define PTC_INTENCLR_RESETVALUE     0x00         /**< \brief (PTC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define PTC_INTENCLR_EOC            (0x1u <<  0) /**< \brief (PTC_INTENCLR) End of Conversion Interrupt Disable */
#define PTC_INTENCLR_WCOMP          (0x1u <<  1) /**< \brief (PTC_INTENCLR) Window Compare Interrupt Disable */
#define PTC_INTENCLR_READY          (0x1u <<  2) /**< \brief (PTC_INTENCLR) Ready Interrupt Disable */
#define PTC_INTENCLR_MASK           0x7u /**< \brief (PTC_INTENCLR) MASK Register */

/* -------- PTC_INTENSET : (PTC Offset: 0x09) (R/W  8) Interrupt Enable Set Register -------- */
typedef union {
  struct {
    uint8_t  EOC:1;            /*!< bit:      0  End of Conversion Interrupt Enable */
    uint8_t  WCOMP:1;          /*!< bit:      1  Window Compare Interrupt Enable    */
    uint8_t  READY:1;          /*!< bit:      2  Ready Interrupt Enable             */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTENSET_Type;

#define PTC_INTENSET_OFFSET         0x09         /**< \brief (PTC_INTENSET offset) Interrupt Enable Set Register */
#define PTC_INTENSET_RESETVALUE     0x00         /**< \brief (PTC_INTENSET reset_value) Interrupt Enable Set Register */

