zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define PTC_INTENSET_EOC            (0x1u <<  0) /**< \brief (PTC_INTENSET) End of Conversion Interrupt Enable */
#define PTC_INTENSET_WCOMP          (0x1u <<  1) /**< \brief (PTC_INTENSET) Window Compare Interrupt Enable */
#define PTC_INTENSET_READY          (0x1u <<  2) /**< \brief (PTC_INTENSET) Ready Interrupt Enable */
#define PTC_INTENSET_MASK           0x7u /**< \brief (PTC_INTENSET) MASK Register */

/* -------- PTC_INTFLAG : (PTC Offset: 0x0A) (R/W  8) Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  EOC:1;            /*!< bit:      0  End of Conversion Interrupt Flag   */
    uint8_t  WCOMP:1;          /*!< bit:      1  Window Compare Interrupt Flag      */
    uint8_t  READY:1;          /*!< bit:      2  Ready Interrupt Flag               */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_INTFLAG_Type;

#define PTC_INTFLAG_OFFSET          0x0A         /**< \brief (PTC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define PTC_INTFLAG_RESETVALUE      0x00         /**< \brief (PTC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define PTC_INTFLAG_EOC             (0x1u <<  0) /**< \brief (PTC_INTFLAG) End of Conversion Interrupt Flag */
#define PTC_INTFLAG_WCOMP           (0x1u <<  1) /**< \brief (PTC_INTFLAG) Window Compare Interrupt Flag */
#define PTC_INTFLAG_READY           (0x1u <<  2) /**< \brief (PTC_INTFLAG) Ready Interrupt Flag */
#define PTC_INTFLAG_MASK            0x7u /**< \brief (PTC_INTFLAG) MASK Register */

/* -------- PTC_CTSCTRLA : (PTC Offset: 0x0C) (R/W  8) CTS Control Register A -------- */
typedef union {
  struct {
    uint8_t  SDS:4;            /*!< bit:  0.. 3  Sampling Delay Selection           */
    uint8_t  ASDV:1;           /*!< bit:      4  Automatic Sampling Delay Variation */
    uint8_t  CCDS:2;           /*!< bit:  5.. 6  Channel Change Delay Selection     */
    uint8_t  :1;               /*!< bit:      7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLA_Type;

#define PTC_CTSCTRLA_OFFSET         0x0C         /**< \brief (PTC_CTSCTRLA offset) CTS Control Register A */
#define PTC_CTSCTRLA_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLA reset_value) CTS Control Register A */

#define PTC_CTSCTRLA_SDS_Pos        0
#define PTC_CTSCTRLA_SDS_Msk        (0xFu << PTC_CTSCTRLA_SDS_Pos) /**< \brief (PTC_CTSCTRLA) Sampling Delay Selection */
#define PTC_CTSCTRLA_SDS(value)     ((PTC_CTSCTRLA_SDS_Msk & ((value) << PTC_CTSCTRLA_SDS_Pos)))
#define PTC_CTSCTRLA_ASDV           (0x1u <<  4) /**< \brief (PTC_CTSCTRLA) Automatic Sampling Delay Variation */
#define PTC_CTSCTRLA_CCDS_Pos       5
#define PTC_CTSCTRLA_CCDS_Msk       (0x3u << PTC_CTSCTRLA_CCDS_Pos) /**< \brief (PTC_CTSCTRLA) Channel Change Delay Selection */
#define PTC_CTSCTRLA_CCDS(value)    ((PTC_CTSCTRLA_CCDS_Msk & ((value) << PTC_CTSCTRLA_CCDS_Pos)))
#define PTC_CTSCTRLA_MASK           0x7Fu /**< \brief (PTC_CTSCTRLA) MASK Register */

/* -------- PTC_CTSCTRLC : (PTC Offset: 0x0D) (R/W  8) CTS Control Register C -------- */
typedef union {
  struct {
    uint8_t  ADAS:3;           /*!< bit:  0.. 2  ADC Accumulation Number Select     */
    uint8_t  :4;               /*!< bit:  3.. 6  Reserved                           */
    uint8_t  STCONV:1;         /*!< bit:      7  Start Conversion                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLC_Type;

#define PTC_CTSCTRLC_OFFSET         0x0D         /**< \brief (PTC_CTSCTRLC offset) CTS Control Register C */
#define PTC_CTSCTRLC_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLC reset_value) CTS Control Register C */

#define PTC_CTSCTRLC_ADAS_Pos       0
#define PTC_CTSCTRLC_ADAS_Msk       (0x7u << PTC_CTSCTRLC_ADAS_Pos) /**< \brief (PTC_CTSCTRLC) ADC Accumulation Number Select */
#define PTC_CTSCTRLC_ADAS(value)    ((PTC_CTSCTRLC_ADAS_Msk & ((value) << PTC_CTSCTRLC_ADAS_Pos)))
#define PTC_CTSCTRLC_STCONV         (0x1u <<  7) /**< \brief (PTC_CTSCTRLC) Start Conversion */
#define PTC_CTSCTRLC_MASK           0x87u /**< \brief (PTC_CTSCTRLC) MASK Register */

/* -------- PTC_YSEL : (PTC Offset: 0x10) (R/W 16) Y Line Select Register -------- */
typedef union {
  struct {
    uint16_t YSEL:16;          /*!< bit:  0..15  Y Line Selection                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_YSEL_Type;

#define PTC_YSEL_OFFSET             0x10         /**< \brief (PTC_YSEL offset) Y Line Select Register */
#define PTC_YSEL_RESETVALUE         0x0000       /**< \brief (PTC_YSEL reset_value) Y Line Select Register */

#define PTC_YSEL_YSEL_Pos           0
#define PTC_YSEL_YSEL_Msk           (0xFFFFu << PTC_YSEL_YSEL_Pos) /**< \brief (PTC_YSEL) Y Line Selection */
#define PTC_YSEL_YSEL(value)        ((PTC_YSEL_YSEL_Msk & ((value) << PTC_YSEL_YSEL_Pos)))
#define PTC_YSEL_MASK               0xFFFFu /**< \brief (PTC_YSEL) MASK Register */

/* -------- PTC_XSEL : (PTC Offset: 0x12) (R/W 16) X Line Select Register -------- */
typedef union {
  struct {
    uint16_t XSEL:16;          /*!< bit:  0..15  X Line Selection                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_XSEL_Type;

#define PTC_XSEL_OFFSET             0x12         /**< \brief (PTC_XSEL offset) X Line Select Register */
#define PTC_XSEL_RESETVALUE         0x0000       /**< \brief (PTC_XSEL reset_value) X Line Select Register */

