zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
/* -------- RTC_READREQ : (RTC Offset: 0x02) (R/W 16) Read Request Register -------- */
typedef union {
  struct {
    uint16_t ADDR:6;           /*!< bit:  0.. 5  Read Address                       */
    uint16_t :8;               /*!< bit:  6..13  Reserved                           */
    uint16_t RCONT:1;          /*!< bit:     14  Read Continuously                  */
    uint16_t RREQ:1;           /*!< bit:     15  Read Request                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} RTC_READREQ_Type;

#define RTC_READREQ_OFFSET          0x02         /**< \brief (RTC_READREQ offset) Read Request Register */
#define RTC_READREQ_RESETVALUE      0x0010       /**< \brief (RTC_READREQ reset_value) Read Request Register */

#define RTC_READREQ_ADDR_Pos        0
#define RTC_READREQ_ADDR_Msk        (0x3Fu << RTC_READREQ_ADDR_Pos) /**< \brief (RTC_READREQ) Read Address */
#define RTC_READREQ_ADDR(value)     ((RTC_READREQ_ADDR_Msk & ((value) << RTC_READREQ_ADDR_Pos)))
#define RTC_READREQ_RCONT           (0x1u << 14) /**< \brief (RTC_READREQ) Read Continuously */
#define RTC_READREQ_RREQ            (0x1u << 15) /**< \brief (RTC_READREQ) Read Request */
#define RTC_READREQ_MASK            0xC03Fu /**< \brief (RTC_READREQ) MASK Register */

/* -------- RTC_MODE0_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE0 Event Control Register -------- */
typedef union {
  struct {
    uint16_t PEREO:8;          /*!< bit:  0.. 7  Periodic Interval Event Output Enables */
    uint16_t CMPEO:4;          /*!< bit:  8..11  Compare Event Output Enables       */
    uint16_t :3;               /*!< bit: 12..14  Reserved                           */
    uint16_t OVFEO:1;          /*!< bit:     15  Overflow Event Output Enable       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} RTC_MODE0_EVCTRL_Type;

#define RTC_MODE0_EVCTRL_OFFSET     0x04         /**< \brief (RTC_MODE0_EVCTRL offset) Event Control Register */
#define RTC_MODE0_EVCTRL_RESETVALUE 0x0000       /**< \brief (RTC_MODE0_EVCTRL reset_value) Event Control Register */

#define RTC_MODE0_EVCTRL_PEREO_Pos    0
#define RTC_MODE0_EVCTRL_PEREO_Msk    (0xFFu << RTC_MODE0_EVCTRL_PEREO_Pos) /**< \brief (RTC_MODE0_EVCTRL) Periodic Interval Event Output Enables */
#define RTC_MODE0_EVCTRL_PEREO(value) ((RTC_MODE0_EVCTRL_PEREO_Msk & ((value) << RTC_MODE0_EVCTRL_PEREO_Pos)))
#define RTC_MODE0_EVCTRL_CMPEO_Pos    8
#define RTC_MODE0_EVCTRL_CMPEO_Msk    (0xFu << RTC_MODE0_EVCTRL_CMPEO_Pos) /**< \brief (RTC_MODE0_EVCTRL) Compare Event Output Enables */
#define RTC_MODE0_EVCTRL_CMPEO(value) ((RTC_MODE0_EVCTRL_CMPEO_Msk & ((value) << RTC_MODE0_EVCTRL_CMPEO_Pos)))
#define RTC_MODE0_EVCTRL_OVFEO      (0x1u << 15) /**< \brief (RTC_MODE0_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE0_EVCTRL_MASK       0x8FFFu /**< \brief (RTC_MODE0_EVCTRL) MASK Register */

/* -------- RTC_MODE1_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE1 Event Control Register -------- */
typedef union {
  struct {
    uint16_t PEREO:8;          /*!< bit:  0.. 7  Periodic Interval Event Output Enables */
    uint16_t CMP0EO:6;         /*!< bit:  8..13  Compare Event Output Enables       */
    uint16_t :1;               /*!< bit:     14  Reserved                           */
    uint16_t OVFEO:1;          /*!< bit:     15  Overflow Event Output Enable       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} RTC_MODE1_EVCTRL_Type;

#define RTC_MODE1_EVCTRL_OFFSET     0x04         /**< \brief (RTC_MODE1_EVCTRL offset) Event Control Register */
#define RTC_MODE1_EVCTRL_RESETVALUE 0x0000       /**< \brief (RTC_MODE1_EVCTRL reset_value) Event Control Register */

#define RTC_MODE1_EVCTRL_PEREO_Pos    0
#define RTC_MODE1_EVCTRL_PEREO_Msk    (0xFFu << RTC_MODE1_EVCTRL_PEREO_Pos) /**< \brief (RTC_MODE1_EVCTRL) Periodic Interval Event Output Enables */
#define RTC_MODE1_EVCTRL_PEREO(value) ((RTC_MODE1_EVCTRL_PEREO_Msk & ((value) << RTC_MODE1_EVCTRL_PEREO_Pos)))
#define RTC_MODE1_EVCTRL_CMP0EO_Pos    8
#define RTC_MODE1_EVCTRL_CMP0EO_Msk    (0x3Fu << RTC_MODE1_EVCTRL_CMP0EO_Pos) /**< \brief (RTC_MODE1_EVCTRL) Compare Event Output Enables */
#define RTC_MODE1_EVCTRL_CMP0EO(value) ((RTC_MODE1_EVCTRL_CMP0EO_Msk & ((value) << RTC_MODE1_EVCTRL_CMP0EO_Pos)))
#define RTC_MODE1_EVCTRL_OVFEO      (0x1u << 15) /**< \brief (RTC_MODE1_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE1_EVCTRL_MASK       0xBFFFu /**< \brief (RTC_MODE1_EVCTRL) MASK Register */

/* -------- RTC_MODE2_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE2 Event Control Register -------- */
typedef union {
  struct {
    uint16_t PEREO:8;          /*!< bit:  0.. 7  Periodic Interval Event Output Enables */
    uint16_t ALARMEO:4;        /*!< bit:  8..11  Alarm 0Event Output Enables        */
    uint16_t :3;               /*!< bit: 12..14  Reserved                           */
    uint16_t OVFEO:1;          /*!< bit:     15  Overflow Event Output Enable       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} RTC_MODE2_EVCTRL_Type;

#define RTC_MODE2_EVCTRL_OFFSET     0x04         /**< \brief (RTC_MODE2_EVCTRL offset) Event Control Register */
#define RTC_MODE2_EVCTRL_RESETVALUE 0x0000       /**< \brief (RTC_MODE2_EVCTRL reset_value) Event Control Register */

#define RTC_MODE2_EVCTRL_PEREO_Pos    0
#define RTC_MODE2_EVCTRL_PEREO_Msk    (0xFFu << RTC_MODE2_EVCTRL_PEREO_Pos) /**< \brief (RTC_MODE2_EVCTRL) Periodic Interval Event Output Enables */
#define RTC_MODE2_EVCTRL_PEREO(value) ((RTC_MODE2_EVCTRL_PEREO_Msk & ((value) << RTC_MODE2_EVCTRL_PEREO_Pos)))
#define RTC_MODE2_EVCTRL_ALARMEO_Pos    8
#define RTC_MODE2_EVCTRL_ALARMEO_Msk    (0xFu << RTC_MODE2_EVCTRL_ALARMEO_Pos) /**< \brief (RTC_MODE2_EVCTRL) Alarm 0Event Output Enables */
#define RTC_MODE2_EVCTRL_ALARMEO(value) ((RTC_MODE2_EVCTRL_ALARMEO_Msk & ((value) << RTC_MODE2_EVCTRL_ALARMEO_Pos)))
#define RTC_MODE2_EVCTRL_OVFEO      (0x1u << 15) /**< \brief (RTC_MODE2_EVCTRL) Overflow Event Output Enable */
#define RTC_MODE2_EVCTRL_MASK       0x8FFFu /**< \brief (RTC_MODE2_EVCTRL) MASK Register */

/* -------- RTC_MODE0_INTENCLR : (RTC Offset: 0x06) (R/W  8) MODE0 Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  CMP:4;            /*!< bit:  0.. 3  Comparator Interrupt Disables      */
    uint8_t  :2;               /*!< bit:  4.. 5  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Disable            */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Disable         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE0_INTENCLR_Type;

