zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define RTC_MODE0_INTENCLR_OFFSET   0x06         /**< \brief (RTC_MODE0_INTENCLR offset) Interrupt Enable Clear Register */
#define RTC_MODE0_INTENCLR_RESETVALUE 0x00         /**< \brief (RTC_MODE0_INTENCLR reset_value) Interrupt Enable Clear Register */

#define RTC_MODE0_INTENCLR_CMP_Pos    0
#define RTC_MODE0_INTENCLR_CMP_Msk    (0xFu << RTC_MODE0_INTENCLR_CMP_Pos) /**< \brief (RTC_MODE0_INTENCLR) Comparator Interrupt Disables */
#define RTC_MODE0_INTENCLR_CMP(value) ((RTC_MODE0_INTENCLR_CMP_Msk & ((value) << RTC_MODE0_INTENCLR_CMP_Pos)))
#define RTC_MODE0_INTENCLR_READY    (0x1u <<  6) /**< \brief (RTC_MODE0_INTENCLR) Ready Interrupt Disable */
#define RTC_MODE0_INTENCLR_OVF      (0x1u <<  7) /**< \brief (RTC_MODE0_INTENCLR) Overflow Interrupt Disable */
#define RTC_MODE0_INTENCLR_MASK     0xCFu /**< \brief (RTC_MODE0_INTENCLR) MASK Register */

/* -------- RTC_MODE1_INTENCLR : (RTC Offset: 0x06) (R/W  8) MODE1 Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  CMP:6;            /*!< bit:  0.. 5  Comparator Interrupt Disables      */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Disable            */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Disable         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE1_INTENCLR_Type;

#define RTC_MODE1_INTENCLR_OFFSET   0x06         /**< \brief (RTC_MODE1_INTENCLR offset) Interrupt Enable Clear Register */
#define RTC_MODE1_INTENCLR_RESETVALUE 0x00         /**< \brief (RTC_MODE1_INTENCLR reset_value) Interrupt Enable Clear Register */

#define RTC_MODE1_INTENCLR_CMP_Pos    0
#define RTC_MODE1_INTENCLR_CMP_Msk    (0x3Fu << RTC_MODE1_INTENCLR_CMP_Pos) /**< \brief (RTC_MODE1_INTENCLR) Comparator Interrupt Disables */
#define RTC_MODE1_INTENCLR_CMP(value) ((RTC_MODE1_INTENCLR_CMP_Msk & ((value) << RTC_MODE1_INTENCLR_CMP_Pos)))
#define RTC_MODE1_INTENCLR_READY    (0x1u <<  6) /**< \brief (RTC_MODE1_INTENCLR) Ready Interrupt Disable */
#define RTC_MODE1_INTENCLR_OVF      (0x1u <<  7) /**< \brief (RTC_MODE1_INTENCLR) Overflow Interrupt Disable */
#define RTC_MODE1_INTENCLR_MASK     0xFFu /**< \brief (RTC_MODE1_INTENCLR) MASK Register */

/* -------- RTC_MODE2_INTENCLR : (RTC Offset: 0x06) (R/W  8) MODE2 Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  ALARM:4;          /*!< bit:  0.. 3  Alarm Interrupt Disables           */
    uint8_t  :2;               /*!< bit:  4.. 5  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Disable            */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Disable         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE2_INTENCLR_Type;

#define RTC_MODE2_INTENCLR_OFFSET   0x06         /**< \brief (RTC_MODE2_INTENCLR offset) Interrupt Enable Clear Register */
#define RTC_MODE2_INTENCLR_RESETVALUE 0x00         /**< \brief (RTC_MODE2_INTENCLR reset_value) Interrupt Enable Clear Register */

#define RTC_MODE2_INTENCLR_ALARM_Pos    0
#define RTC_MODE2_INTENCLR_ALARM_Msk    (0xFu << RTC_MODE2_INTENCLR_ALARM_Pos) /**< \brief (RTC_MODE2_INTENCLR) Alarm Interrupt Disables */
#define RTC_MODE2_INTENCLR_ALARM(value) ((RTC_MODE2_INTENCLR_ALARM_Msk & ((value) << RTC_MODE2_INTENCLR_ALARM_Pos)))
#define RTC_MODE2_INTENCLR_READY    (0x1u <<  6) /**< \brief (RTC_MODE2_INTENCLR) Ready Interrupt Disable */
#define RTC_MODE2_INTENCLR_OVF      (0x1u <<  7) /**< \brief (RTC_MODE2_INTENCLR) Overflow Interrupt Disable */
#define RTC_MODE2_INTENCLR_MASK     0xCFu /**< \brief (RTC_MODE2_INTENCLR) MASK Register */

/* -------- RTC_MODE0_INTENSET : (RTC Offset: 0x07) (R/W  8) MODE0 Interrupt Enable Set Register -------- */
typedef union {
  struct {
    uint8_t  CMP:4;            /*!< bit:  0.. 3  Comparator Interrupt Enables       */
    uint8_t  :2;               /*!< bit:  4.. 5  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Enable             */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Enable          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE0_INTENSET_Type;

#define RTC_MODE0_INTENSET_OFFSET   0x07         /**< \brief (RTC_MODE0_INTENSET offset) Interrupt Enable Set Register */
#define RTC_MODE0_INTENSET_RESETVALUE 0x00         /**< \brief (RTC_MODE0_INTENSET reset_value) Interrupt Enable Set Register */

#define RTC_MODE0_INTENSET_CMP_Pos    0
#define RTC_MODE0_INTENSET_CMP_Msk    (0xFu << RTC_MODE0_INTENSET_CMP_Pos) /**< \brief (RTC_MODE0_INTENSET) Comparator Interrupt Enables */
#define RTC_MODE0_INTENSET_CMP(value) ((RTC_MODE0_INTENSET_CMP_Msk & ((value) << RTC_MODE0_INTENSET_CMP_Pos)))
#define RTC_MODE0_INTENSET_READY    (0x1u <<  6) /**< \brief (RTC_MODE0_INTENSET) Ready Interrupt Enable */
#define RTC_MODE0_INTENSET_OVF      (0x1u <<  7) /**< \brief (RTC_MODE0_INTENSET) Overflow Interrupt Enable */
#define RTC_MODE0_INTENSET_MASK     0xCFu /**< \brief (RTC_MODE0_INTENSET) MASK Register */

/* -------- RTC_MODE1_INTENSET : (RTC Offset: 0x07) (R/W  8) MODE1 Interrupt Enable Set Register -------- */
typedef union {
  struct {
    uint8_t  CMP:6;            /*!< bit:  0.. 5  Comparator Interrupt Enables       */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Enable             */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Enable          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE1_INTENSET_Type;

