zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define RTC_MODE1_INTENSET_OFFSET   0x07         /**< \brief (RTC_MODE1_INTENSET offset) Interrupt Enable Set Register */
#define RTC_MODE1_INTENSET_RESETVALUE 0x00         /**< \brief (RTC_MODE1_INTENSET reset_value) Interrupt Enable Set Register */

#define RTC_MODE1_INTENSET_CMP_Pos    0
#define RTC_MODE1_INTENSET_CMP_Msk    (0x3Fu << RTC_MODE1_INTENSET_CMP_Pos) /**< \brief (RTC_MODE1_INTENSET) Comparator Interrupt Enables */
#define RTC_MODE1_INTENSET_CMP(value) ((RTC_MODE1_INTENSET_CMP_Msk & ((value) << RTC_MODE1_INTENSET_CMP_Pos)))
#define RTC_MODE1_INTENSET_READY    (0x1u <<  6) /**< \brief (RTC_MODE1_INTENSET) Ready Interrupt Enable */
#define RTC_MODE1_INTENSET_OVF      (0x1u <<  7) /**< \brief (RTC_MODE1_INTENSET) Overflow Interrupt Enable */
#define RTC_MODE1_INTENSET_MASK     0xFFu /**< \brief (RTC_MODE1_INTENSET) MASK Register */

/* -------- RTC_MODE2_INTENSET : (RTC Offset: 0x07) (R/W  8) MODE2 Interrupt Enable Set Register -------- */
typedef union {
  struct {
    uint8_t  ALARM:4;          /*!< bit:  0.. 3  Alarm Interrupt Enables            */
    uint8_t  :2;               /*!< bit:  4.. 5  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Enable             */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Enable          */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE2_INTENSET_Type;

#define RTC_MODE2_INTENSET_OFFSET   0x07         /**< \brief (RTC_MODE2_INTENSET offset) Interrupt Enable Set Register */
#define RTC_MODE2_INTENSET_RESETVALUE 0x00         /**< \brief (RTC_MODE2_INTENSET reset_value) Interrupt Enable Set Register */

#define RTC_MODE2_INTENSET_ALARM_Pos    0
#define RTC_MODE2_INTENSET_ALARM_Msk    (0xFu << RTC_MODE2_INTENSET_ALARM_Pos) /**< \brief (RTC_MODE2_INTENSET) Alarm Interrupt Enables */
#define RTC_MODE2_INTENSET_ALARM(value) ((RTC_MODE2_INTENSET_ALARM_Msk & ((value) << RTC_MODE2_INTENSET_ALARM_Pos)))
#define RTC_MODE2_INTENSET_READY    (0x1u <<  6) /**< \brief (RTC_MODE2_INTENSET) Ready Interrupt Enable */
#define RTC_MODE2_INTENSET_OVF      (0x1u <<  7) /**< \brief (RTC_MODE2_INTENSET) Overflow Interrupt Enable */
#define RTC_MODE2_INTENSET_MASK     0xCFu /**< \brief (RTC_MODE2_INTENSET) MASK Register */

/* -------- RTC_MODE0_INTFLAG : (RTC Offset: 0x08) (R/W  8) MODE0 Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  CMP:4;            /*!< bit:  0.. 3  Comparator Interrupt Flags         */
    uint8_t  :2;               /*!< bit:  4.. 5  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Flag               */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Flag            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE0_INTFLAG_Type;

#define RTC_MODE0_INTFLAG_OFFSET    0x08         /**< \brief (RTC_MODE0_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define RTC_MODE0_INTFLAG_RESETVALUE 0x00         /**< \brief (RTC_MODE0_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define RTC_MODE0_INTFLAG_CMP_Pos    0
#define RTC_MODE0_INTFLAG_CMP_Msk    (0xFu << RTC_MODE0_INTFLAG_CMP_Pos) /**< \brief (RTC_MODE0_INTFLAG) Comparator Interrupt Flags */
#define RTC_MODE0_INTFLAG_CMP(value) ((RTC_MODE0_INTFLAG_CMP_Msk & ((value) << RTC_MODE0_INTFLAG_CMP_Pos)))
#define RTC_MODE0_INTFLAG_READY     (0x1u <<  6) /**< \brief (RTC_MODE0_INTFLAG) Ready Interrupt Flag */
#define RTC_MODE0_INTFLAG_OVF       (0x1u <<  7) /**< \brief (RTC_MODE0_INTFLAG) Overflow Interrupt Flag */
#define RTC_MODE0_INTFLAG_MASK      0xCFu /**< \brief (RTC_MODE0_INTFLAG) MASK Register */

/* -------- RTC_MODE1_INTFLAG : (RTC Offset: 0x08) (R/W  8) MODE1 Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  CMP:6;            /*!< bit:  0.. 5  Comparator Interrupt Flags         */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Flag               */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Flag            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE1_INTFLAG_Type;

#define RTC_MODE1_INTFLAG_OFFSET    0x08         /**< \brief (RTC_MODE1_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define RTC_MODE1_INTFLAG_RESETVALUE 0x00         /**< \brief (RTC_MODE1_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define RTC_MODE1_INTFLAG_CMP_Pos    0
#define RTC_MODE1_INTFLAG_CMP_Msk    (0x3Fu << RTC_MODE1_INTFLAG_CMP_Pos) /**< \brief (RTC_MODE1_INTFLAG) Comparator Interrupt Flags */
#define RTC_MODE1_INTFLAG_CMP(value) ((RTC_MODE1_INTFLAG_CMP_Msk & ((value) << RTC_MODE1_INTFLAG_CMP_Pos)))
#define RTC_MODE1_INTFLAG_READY     (0x1u <<  6) /**< \brief (RTC_MODE1_INTFLAG) Ready Interrupt Flag */
#define RTC_MODE1_INTFLAG_OVF       (0x1u <<  7) /**< \brief (RTC_MODE1_INTFLAG) Overflow Interrupt Flag */
#define RTC_MODE1_INTFLAG_MASK      0xFFu /**< \brief (RTC_MODE1_INTFLAG) MASK Register */

/* -------- RTC_MODE2_INTFLAG : (RTC Offset: 0x08) (R/W  8) MODE2 Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  ALARM:4;          /*!< bit:  0.. 3  Alarm Interrupt Flags              */
    uint8_t  :2;               /*!< bit:  4.. 5  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      6  Ready Interrupt Flag               */
    uint8_t  OVF:1;            /*!< bit:      7  Overflow Interrupt Flag            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} RTC_MODE2_INTFLAG_Type;

