zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
typedef union {
       RtcMode0                  MODE0;       /**< \brief Offset: 0x00 32-bit Counter with Single 32-bit Compare */
       RtcMode1                  MODE1;       /**< \brief Offset: 0x00 16-bit Counter with Two 16-bit Compares */
       RtcMode2                  MODE2;       /**< \brief Offset: 0x00 Clock/Calendar with Alarm */
} Rtc;

#endif /*  __EXCLUDE_RTC_FROM_CMSIS__ */
#endif /* __ASSEMBLY__ */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SERCOM */
/* ========================================================================== */
/** \addtogroup SAM0+D_SERCOM Serial Communication Interface */
/*@{*/

#define REV_SERCOM     0x100

#ifndef __ASSEMBLY__

#ifndef __EXCLUDE_SERCOM_FROM_CMSIS__

/* -------- SERCOM_I2CM_CTRLA : (SERCOM Offset: 0x00) (R/W 32) I2CM Control Register A -------- */
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  Software Reset                     */
    uint32_t ENABLE:1;         /*!< bit:      1  SERCOM Enable                      */
    uint32_t MODE:2;           /*!< bit:  2.. 3  SERCOM Mode Register               */
    uint32_t :3;               /*!< bit:  4.. 6  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      7  Run during Standby                 */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t PINOUT:1;         /*!< bit:     16  Pin Usage                          */
    uint32_t :3;               /*!< bit: 17..19  Reserved                           */
    uint32_t SDAHOLD:2;        /*!< bit: 20..21  SDA Hold Time                      */
    uint32_t :6;               /*!< bit: 22..27  Reserved                           */
    uint32_t INACTOUT:2;       /*!< bit: 28..29  Inactive Bus Timeout               */
    uint32_t LOWTOUTEN:1;      /*!< bit:     30  SCL Low Timeout Enable             */
    uint32_t MASTER:1;         /*!< bit:     31  Master Mode                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CM_CTRLA_Type;

#define SERCOM_I2CM_CTRLA_OFFSET    0x00         /**< \brief (SERCOM_I2CM_CTRLA offset) Control Register A */
#define SERCOM_I2CM_CTRLA_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CM_CTRLA reset_value) Control Register A */

#define SERCOM_I2CM_CTRLA_SWRST     (0x1u <<  0) /**< \brief (SERCOM_I2CM_CTRLA) Software Reset */
#define SERCOM_I2CM_CTRLA_ENABLE    (0x1u <<  1) /**< \brief (SERCOM_I2CM_CTRLA) SERCOM Enable */
#define SERCOM_I2CM_CTRLA_MODE_Pos    2
#define SERCOM_I2CM_CTRLA_MODE_Msk    (0x3u << SERCOM_I2CM_CTRLA_MODE_Pos) /**< \brief (SERCOM_I2CM_CTRLA) SERCOM Mode Register */
#define SERCOM_I2CM_CTRLA_MODE(value) ((SERCOM_I2CM_CTRLA_MODE_Msk & ((value) << SERCOM_I2CM_CTRLA_MODE_Pos)))
#define SERCOM_I2CM_CTRLA_RUNSTDBY  (0x1u <<  7) /**< \brief (SERCOM_I2CM_CTRLA) Run during Standby */
#define SERCOM_I2CM_CTRLA_PINOUT    (0x1u << 16) /**< \brief (SERCOM_I2CM_CTRLA) Pin Usage */
#define SERCOM_I2CM_CTRLA_SDAHOLD_Pos    20
#define SERCOM_I2CM_CTRLA_SDAHOLD_Msk    (0x3u << SERCOM_I2CM_CTRLA_SDAHOLD_Pos) /**< \brief (SERCOM_I2CM_CTRLA) SDA Hold Time */
#define SERCOM_I2CM_CTRLA_SDAHOLD(value) ((SERCOM_I2CM_CTRLA_SDAHOLD_Msk & ((value) << SERCOM_I2CM_CTRLA_SDAHOLD_Pos)))
#define SERCOM_I2CM_CTRLA_INACTOUT_Pos    28
#define SERCOM_I2CM_CTRLA_INACTOUT_Msk    (0x3u << SERCOM_I2CM_CTRLA_INACTOUT_Pos) /**< \brief (SERCOM_I2CM_CTRLA) Inactive Bus Timeout */
#define SERCOM_I2CM_CTRLA_INACTOUT(value) ((SERCOM_I2CM_CTRLA_INACTOUT_Msk & ((value) << SERCOM_I2CM_CTRLA_INACTOUT_Pos)))
#define SERCOM_I2CM_CTRLA_LOWTOUTEN (0x1u << 30) /**< \brief (SERCOM_I2CM_CTRLA) SCL Low Timeout Enable */
#define SERCOM_I2CM_CTRLA_MASTER    (0x1u << 31) /**< \brief (SERCOM_I2CM_CTRLA) Master Mode */
#define SERCOM_I2CM_CTRLA_MASK      0xF031008Fu /**< \brief (SERCOM_I2CM_CTRLA) MASK Register */

/* -------- SERCOM_I2CS_CTRLA : (SERCOM Offset: 0x00) (R/W 32) I2CS Control Register A -------- */
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  SERCOM Reset                       */
    uint32_t ENABLE:1;         /*!< bit:      1  SERCOM Enable                      */
    uint32_t MODE:2;           /*!< bit:  2.. 3  SERCOM Mode Register               */
    uint32_t :3;               /*!< bit:  4.. 6  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      7  Run during Standby                 */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t PINOUT:1;         /*!< bit:     16  Pin Usage                          */
    uint32_t :3;               /*!< bit: 17..19  Reserved                           */
    uint32_t SDAHOLD:2;        /*!< bit: 20..21  SDA Hold Time                      */
    uint32_t :8;               /*!< bit: 22..29  Reserved                           */
    uint32_t LOWTOUT:1;        /*!< bit:     30  SCL Low Timeout                    */
    uint32_t MASTER:1;         /*!< bit:     31  Master Mode                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CS_CTRLA_Type;

#define SERCOM_I2CS_CTRLA_OFFSET    0x00         /**< \brief (SERCOM_I2CS_CTRLA offset) Control Register A */
#define SERCOM_I2CS_CTRLA_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CS_CTRLA reset_value) Control Register A */

#define SERCOM_I2CS_CTRLA_SWRST     (0x1u <<  0) /**< \brief (SERCOM_I2CS_CTRLA) SERCOM Reset */
#define SERCOM_I2CS_CTRLA_ENABLE    (0x1u <<  1) /**< \brief (SERCOM_I2CS_CTRLA) SERCOM Enable */
#define SERCOM_I2CS_CTRLA_MODE_Pos    2
#define SERCOM_I2CS_CTRLA_MODE_Msk    (0x3u << SERCOM_I2CS_CTRLA_MODE_Pos) /**< \brief (SERCOM_I2CS_CTRLA) SERCOM Mode Register */
#define SERCOM_I2CS_CTRLA_MODE(value) ((SERCOM_I2CS_CTRLA_MODE_Msk & ((value) << SERCOM_I2CS_CTRLA_MODE_Pos)))
#define SERCOM_I2CS_CTRLA_RUNSTDBY  (0x1u <<  7) /**< \brief (SERCOM_I2CS_CTRLA) Run during Standby */
#define SERCOM_I2CS_CTRLA_PINOUT    (0x1u << 16) /**< \brief (SERCOM_I2CS_CTRLA) Pin Usage */
#define SERCOM_I2CS_CTRLA_SDAHOLD_Pos    20
#define SERCOM_I2CS_CTRLA_SDAHOLD_Msk    (0x3u << SERCOM_I2CS_CTRLA_SDAHOLD_Pos) /**< \brief (SERCOM_I2CS_CTRLA) SDA Hold Time */
#define SERCOM_I2CS_CTRLA_SDAHOLD(value) ((SERCOM_I2CS_CTRLA_SDAHOLD_Msk & ((value) << SERCOM_I2CS_CTRLA_SDAHOLD_Pos)))
#define SERCOM_I2CS_CTRLA_LOWTOUT   (0x1u << 30) /**< \brief (SERCOM_I2CS_CTRLA) SCL Low Timeout */
#define SERCOM_I2CS_CTRLA_MASTER    (0x1u << 31) /**< \brief (SERCOM_I2CS_CTRLA) Master Mode */
#define SERCOM_I2CS_CTRLA_MASK      0xC031008Fu /**< \brief (SERCOM_I2CS_CTRLA) MASK Register */

/* -------- SERCOM_SPI_CTRLA : (SERCOM Offset: 0x00) (R/W 32) SPI SPI Control Register A -------- */
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  SERCOM Reset                       */
    uint32_t ENABLE:1;         /*!< bit:      1  SERCOM Enable                      */
    uint32_t MODE:2;           /*!< bit:  2.. 3  SERCOM Mode Register               */
    uint32_t :3;               /*!< bit:  4.. 6  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      7  Run during Standby                 */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t DOPO:1;           /*!< bit:     16  Data Out Pinout                    */
    uint32_t :3;               /*!< bit: 17..19  Reserved                           */
    uint32_t DIPO:2;           /*!< bit: 20..21  Data In Pinout                     */
    uint32_t :2;               /*!< bit: 22..23  Reserved                           */
    uint32_t FORM:4;           /*!< bit: 24..27  Frame Format                       */
    uint32_t CPHA:1;           /*!< bit:     28  Clock Phase                        */
    uint32_t CPOL:1;           /*!< bit:     29  Clock Polarity                     */
    uint32_t DORD:1;           /*!< bit:     30  Data Order                         */
    uint32_t MASTER:1;         /*!< bit:     31  Master Mode                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_SPI_CTRLA_Type;

#define SERCOM_SPI_CTRLA_OFFSET     0x00         /**< \brief (SERCOM_SPI_CTRLA offset) SPI Control Register A */
#define SERCOM_SPI_CTRLA_RESETVALUE 0x00000000   /**< \brief (SERCOM_SPI_CTRLA reset_value) SPI Control Register A */

