zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define SERCOM_SPI_CTRLA_SWRST      (0x1u <<  0) /**< \brief (SERCOM_SPI_CTRLA) SERCOM Reset */
#define SERCOM_SPI_CTRLA_ENABLE     (0x1u <<  1) /**< \brief (SERCOM_SPI_CTRLA) SERCOM Enable */
#define SERCOM_SPI_CTRLA_MODE_Pos    2
#define SERCOM_SPI_CTRLA_MODE_Msk    (0x3u << SERCOM_SPI_CTRLA_MODE_Pos) /**< \brief (SERCOM_SPI_CTRLA) SERCOM Mode Register */
#define SERCOM_SPI_CTRLA_MODE(value) ((SERCOM_SPI_CTRLA_MODE_Msk & ((value) << SERCOM_SPI_CTRLA_MODE_Pos)))
#define SERCOM_SPI_CTRLA_RUNSTDBY   (0x1u <<  7) /**< \brief (SERCOM_SPI_CTRLA) Run during Standby */
#define SERCOM_SPI_CTRLA_DOPO       (0x1u << 16) /**< \brief (SERCOM_SPI_CTRLA) Data Out Pinout */
#define SERCOM_SPI_CTRLA_DIPO_Pos    20
#define SERCOM_SPI_CTRLA_DIPO_Msk    (0x3u << SERCOM_SPI_CTRLA_DIPO_Pos) /**< \brief (SERCOM_SPI_CTRLA) Data In Pinout */
#define SERCOM_SPI_CTRLA_DIPO(value) ((SERCOM_SPI_CTRLA_DIPO_Msk & ((value) << SERCOM_SPI_CTRLA_DIPO_Pos)))
#define SERCOM_SPI_CTRLA_FORM_Pos    24
#define SERCOM_SPI_CTRLA_FORM_Msk    (0xFu << SERCOM_SPI_CTRLA_FORM_Pos) /**< \brief (SERCOM_SPI_CTRLA) Frame Format */
#define SERCOM_SPI_CTRLA_FORM(value) ((SERCOM_SPI_CTRLA_FORM_Msk & ((value) << SERCOM_SPI_CTRLA_FORM_Pos)))
#define SERCOM_SPI_CTRLA_CPHA       (0x1u << 28) /**< \brief (SERCOM_SPI_CTRLA) Clock Phase */
#define SERCOM_SPI_CTRLA_CPOL       (0x1u << 29) /**< \brief (SERCOM_SPI_CTRLA) Clock Polarity */
#define SERCOM_SPI_CTRLA_DORD       (0x1u << 30) /**< \brief (SERCOM_SPI_CTRLA) Data Order */
#define SERCOM_SPI_CTRLA_MASTER     (0x1u << 31) /**< \brief (SERCOM_SPI_CTRLA) Master Mode */
#define SERCOM_SPI_CTRLA_MASK       0xFF31008Fu /**< \brief (SERCOM_SPI_CTRLA) MASK Register */

/* -------- SERCOM_USART_CTRLA : (SERCOM Offset: 0x00) (R/W 32) USART USART Control Register A -------- */
typedef union {
  struct {
    uint32_t SWRST:1;          /*!< bit:      0  SERCOM Reset                       */
    uint32_t ENABLE:1;         /*!< bit:      1  SERCOM Enable                      */
    uint32_t MODE:2;           /*!< bit:  2.. 3  SERCOM Mode Register               */
    uint32_t :3;               /*!< bit:  4.. 6  Reserved                           */
    uint32_t RUNSTDBY:1;       /*!< bit:      7  Run during Standby                 */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t TXPO:1;           /*!< bit:     16  Transmit Data Pinout               */
    uint32_t :3;               /*!< bit: 17..19  Reserved                           */
    uint32_t RXPO:2;           /*!< bit: 20..21  Receive Data Pinout                */
    uint32_t :2;               /*!< bit: 22..23  Reserved                           */
    uint32_t FORM:2;           /*!< bit: 24..25  Frame Format                       */
    uint32_t :2;               /*!< bit: 26..27  Reserved                           */
    uint32_t CMODE:1;          /*!< bit:     28  Communication Mode                 */
    uint32_t CPOL:1;           /*!< bit:     29  Clock Polarity                     */
    uint32_t DORD:1;           /*!< bit:     30  Data Order                         */
    uint32_t CSRC:1;           /*!< bit:     31  Clock Source                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_USART_CTRLA_Type;

#define SERCOM_USART_CTRLA_OFFSET   0x00         /**< \brief (SERCOM_USART_CTRLA offset) USART Control Register A */
#define SERCOM_USART_CTRLA_RESETVALUE 0x00000000   /**< \brief (SERCOM_USART_CTRLA reset_value) USART Control Register A */

#define SERCOM_USART_CTRLA_SWRST    (0x1u <<  0) /**< \brief (SERCOM_USART_CTRLA) SERCOM Reset */
#define SERCOM_USART_CTRLA_ENABLE   (0x1u <<  1) /**< \brief (SERCOM_USART_CTRLA) SERCOM Enable */
#define SERCOM_USART_CTRLA_MODE_Pos    2
#define SERCOM_USART_CTRLA_MODE_Msk    (0x3u << SERCOM_USART_CTRLA_MODE_Pos) /**< \brief (SERCOM_USART_CTRLA) SERCOM Mode Register */
#define SERCOM_USART_CTRLA_MODE(value) ((SERCOM_USART_CTRLA_MODE_Msk & ((value) << SERCOM_USART_CTRLA_MODE_Pos)))
#define SERCOM_USART_CTRLA_RUNSTDBY (0x1u <<  7) /**< \brief (SERCOM_USART_CTRLA) Run during Standby */
#define SERCOM_USART_CTRLA_TXPO     (0x1u << 16) /**< \brief (SERCOM_USART_CTRLA) Transmit Data Pinout */
#define SERCOM_USART_CTRLA_RXPO_Pos    20
#define SERCOM_USART_CTRLA_RXPO_Msk    (0x3u << SERCOM_USART_CTRLA_RXPO_Pos) /**< \brief (SERCOM_USART_CTRLA) Receive Data Pinout */
#define SERCOM_USART_CTRLA_RXPO(value) ((SERCOM_USART_CTRLA_RXPO_Msk & ((value) << SERCOM_USART_CTRLA_RXPO_Pos)))
#define SERCOM_USART_CTRLA_FORM_Pos    24
#define SERCOM_USART_CTRLA_FORM_Msk    (0x3u << SERCOM_USART_CTRLA_FORM_Pos) /**< \brief (SERCOM_USART_CTRLA) Frame Format */
#define SERCOM_USART_CTRLA_FORM(value) ((SERCOM_USART_CTRLA_FORM_Msk & ((value) << SERCOM_USART_CTRLA_FORM_Pos)))
#define SERCOM_USART_CTRLA_CMODE    (0x1u << 28) /**< \brief (SERCOM_USART_CTRLA) Communication Mode */
#define SERCOM_USART_CTRLA_CPOL     (0x1u << 29) /**< \brief (SERCOM_USART_CTRLA) Clock Polarity */
#define SERCOM_USART_CTRLA_DORD     (0x1u << 30) /**< \brief (SERCOM_USART_CTRLA) Data Order */
#define SERCOM_USART_CTRLA_CSRC     (0x1u << 31) /**< \brief (SERCOM_USART_CTRLA) Clock Source */
#define SERCOM_USART_CTRLA_MASK     0xF331008Fu /**< \brief (SERCOM_USART_CTRLA) MASK Register */

/* -------- SERCOM_I2CM_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CM Control Register B -------- */
typedef union {
  struct {
    uint32_t :8;               /*!< bit:  0.. 7  Reserved                           */
    uint32_t SMEN:1;           /*!< bit:      8  Smart Mode Enable                  */
    uint32_t QCEN:1;           /*!< bit:      9  Quick Command Enable               */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t CMD:2;            /*!< bit: 16..17  Command                            */
    uint32_t ACKACT:1;         /*!< bit:     18  Acknowledge Action                 */
    uint32_t :13;              /*!< bit: 19..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CM_CTRLB_Type;

#define SERCOM_I2CM_CTRLB_OFFSET    0x04         /**< \brief (SERCOM_I2CM_CTRLB offset) Control Register B */
#define SERCOM_I2CM_CTRLB_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CM_CTRLB reset_value) Control Register B */

