zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define SERCOM_I2CM_DEBUG_OFFSET    0x08         /**< \brief (SERCOM_I2CM_DEBUG offset) Debug Register */
#define SERCOM_I2CM_DEBUG_RESETVALUE 0x00         /**< \brief (SERCOM_I2CM_DEBUG reset_value) Debug Register */

#define SERCOM_I2CM_DEBUG_DBGSTOP   (0x1u <<  0) /**< \brief (SERCOM_I2CM_DEBUG) Debug Mode */
#define SERCOM_I2CM_DEBUG_MASK      0x1u /**< \brief (SERCOM_I2CM_DEBUG) MASK Register */

/* -------- SERCOM_I2CS_DEBUG : (SERCOM Offset: 0x08) (R/W  8) I2CS Debug Register -------- */
typedef union {
  struct {
    uint8_t  DBGSTOP:1;        /*!< bit:      0  Debug Mode                         */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_I2CS_DEBUG_Type;

#define SERCOM_I2CS_DEBUG_OFFSET    0x08         /**< \brief (SERCOM_I2CS_DEBUG offset) Debug Register */
#define SERCOM_I2CS_DEBUG_RESETVALUE 0x00         /**< \brief (SERCOM_I2CS_DEBUG reset_value) Debug Register */

#define SERCOM_I2CS_DEBUG_DBGSTOP   (0x1u <<  0) /**< \brief (SERCOM_I2CS_DEBUG) Debug Mode */
#define SERCOM_I2CS_DEBUG_MASK      0x1u /**< \brief (SERCOM_I2CS_DEBUG) MASK Register */

/* -------- SERCOM_SPI_DEBUG : (SERCOM Offset: 0x08) (R/W  8) SPI SPI Debug Register -------- */
typedef union {
  struct {
    uint8_t  DBGSTOP:1;        /*!< bit:      0  Debug Mode                         */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_SPI_DEBUG_Type;

#define SERCOM_SPI_DEBUG_OFFSET     0x08         /**< \brief (SERCOM_SPI_DEBUG offset) SPI Debug Register */
#define SERCOM_SPI_DEBUG_RESETVALUE 0x00         /**< \brief (SERCOM_SPI_DEBUG reset_value) SPI Debug Register */

#define SERCOM_SPI_DEBUG_DBGSTOP    (0x1u <<  0) /**< \brief (SERCOM_SPI_DEBUG) Debug Mode */
#define SERCOM_SPI_DEBUG_MASK       0x1u /**< \brief (SERCOM_SPI_DEBUG) MASK Register */

/* -------- SERCOM_USART_DEBUG : (SERCOM Offset: 0x08) (R/W  8) USART USART Debug Register -------- */
typedef union {
  struct {
    uint8_t  DBGSTOP:1;        /*!< bit:      0  Debug Mode                         */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_USART_DEBUG_Type;

#define SERCOM_USART_DEBUG_OFFSET   0x08         /**< \brief (SERCOM_USART_DEBUG offset) USART Debug Register */
#define SERCOM_USART_DEBUG_RESETVALUE 0x00         /**< \brief (SERCOM_USART_DEBUG reset_value) USART Debug Register */

#define SERCOM_USART_DEBUG_DBGSTOP  (0x1u <<  0) /**< \brief (SERCOM_USART_DEBUG) Debug Mode */
#define SERCOM_USART_DEBUG_MASK     0x1u /**< \brief (SERCOM_USART_DEBUG) MASK Register */

/* -------- SERCOM_I2CM_BAUD : (SERCOM Offset: 0x0A) (R/W 16) I2CM Baud Rate Register -------- */
typedef union {
  struct {
    uint16_t BAUD:8;           /*!< bit:  0.. 7  Baud Rate Register                 */
    uint16_t :8;               /*!< bit:  8..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CM_BAUD_Type;

#define SERCOM_I2CM_BAUD_OFFSET     0x0A         /**< \brief (SERCOM_I2CM_BAUD offset) Baud Rate Register */
#define SERCOM_I2CM_BAUD_RESETVALUE 0x0000       /**< \brief (SERCOM_I2CM_BAUD reset_value) Baud Rate Register */

#define SERCOM_I2CM_BAUD_BAUD_Pos    0
#define SERCOM_I2CM_BAUD_BAUD_Msk    (0xFFu << SERCOM_I2CM_BAUD_BAUD_Pos) /**< \brief (SERCOM_I2CM_BAUD) Baud Rate Register */
#define SERCOM_I2CM_BAUD_BAUD(value) ((SERCOM_I2CM_BAUD_BAUD_Msk & ((value) << SERCOM_I2CM_BAUD_BAUD_Pos)))
#define SERCOM_I2CM_BAUD_MASK       0xFFu /**< \brief (SERCOM_I2CM_BAUD) MASK Register */

/* -------- SERCOM_SPI_BAUD : (SERCOM Offset: 0x0A) (R/W 16) SPI SPI Baud Rate Register -------- */
typedef union {
  struct {
    uint16_t BAUD:8;           /*!< bit:  0.. 7  Baud Rate Register                 */
    uint16_t :8;               /*!< bit:  8..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} SERCOM_SPI_BAUD_Type;

#define SERCOM_SPI_BAUD_OFFSET      0x0A         /**< \brief (SERCOM_SPI_BAUD offset) SPI Baud Rate Register */
#define SERCOM_SPI_BAUD_RESETVALUE  0x0000       /**< \brief (SERCOM_SPI_BAUD reset_value) SPI Baud Rate Register */

#define SERCOM_SPI_BAUD_BAUD_Pos    0
#define SERCOM_SPI_BAUD_BAUD_Msk    (0xFFu << SERCOM_SPI_BAUD_BAUD_Pos) /**< \brief (SERCOM_SPI_BAUD) Baud Rate Register */
#define SERCOM_SPI_BAUD_BAUD(value) ((SERCOM_SPI_BAUD_BAUD_Msk & ((value) << SERCOM_SPI_BAUD_BAUD_Pos)))
#define SERCOM_SPI_BAUD_MASK        0xFFu /**< \brief (SERCOM_SPI_BAUD) MASK Register */

/* -------- SERCOM_USART_BAUD : (SERCOM Offset: 0x0A) (R/W 16) USART USART Baud Rate Register -------- */
typedef union {
  struct {
    uint16_t BAUD:16;          /*!< bit:  0..15  Baud Rate Register                 */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} SERCOM_USART_BAUD_Type;

#define SERCOM_USART_BAUD_OFFSET    0x0A         /**< \brief (SERCOM_USART_BAUD offset) USART Baud Rate Register */
#define SERCOM_USART_BAUD_RESETVALUE 0x0000       /**< \brief (SERCOM_USART_BAUD reset_value) USART Baud Rate Register */

#define SERCOM_USART_BAUD_BAUD_Pos    0
#define SERCOM_USART_BAUD_BAUD_Msk    (0xFFFFu << SERCOM_USART_BAUD_BAUD_Pos) /**< \brief (SERCOM_USART_BAUD) Baud Rate Register */
#define SERCOM_USART_BAUD_BAUD(value) ((SERCOM_USART_BAUD_BAUD_Msk & ((value) << SERCOM_USART_BAUD_BAUD_Pos)))
#define SERCOM_USART_BAUD_MASK      0xFFFFu /**< \brief (SERCOM_USART_BAUD) MASK Register */

/* -------- SERCOM_I2CM_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) I2CM Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  WIEN:1;           /*!< bit:      0  Write Interrupt Disable            */
    uint8_t  RIEN:1;           /*!< bit:      1  Read Interrupt Disable             */
    uint8_t  :6;               /*!< bit:  2.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_I2CM_INTENCLR_Type;

#define SERCOM_I2CM_INTENCLR_OFFSET 0x0C         /**< \brief (SERCOM_I2CM_INTENCLR offset) Interrupt Enable Clear Register */
#define SERCOM_I2CM_INTENCLR_RESETVALUE 0x00         /**< \brief (SERCOM_I2CM_INTENCLR reset_value) Interrupt Enable Clear Register */

#define SERCOM_I2CM_INTENCLR_WIEN   (0x1u <<  0) /**< \brief (SERCOM_I2CM_INTENCLR) Write Interrupt Disable */
#define SERCOM_I2CM_INTENCLR_RIEN   (0x1u <<  1) /**< \brief (SERCOM_I2CM_INTENCLR) Read Interrupt Disable */
#define SERCOM_I2CM_INTENCLR_MASK   0x3u /**< \brief (SERCOM_I2CM_INTENCLR) MASK Register */

/* -------- SERCOM_I2CS_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) I2CS Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  PIEN:1;           /*!< bit:      0  Stop Interrupt Disable             */
    uint8_t  AIEN:1;           /*!< bit:      1  Address Interrupt Disable          */
    uint8_t  DIEN:1;           /*!< bit:      2  Data Interrupt Disable             */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_I2CS_INTENCLR_Type;

#define SERCOM_I2CS_INTENCLR_OFFSET 0x0C         /**< \brief (SERCOM_I2CS_INTENCLR offset) Interrupt Enable Clear Register */
#define SERCOM_I2CS_INTENCLR_RESETVALUE 0x00         /**< \brief (SERCOM_I2CS_INTENCLR reset_value) Interrupt Enable Clear Register */

#define SERCOM_I2CS_INTENCLR_PIEN   (0x1u <<  0) /**< \brief (SERCOM_I2CS_INTENCLR) Stop Interrupt Disable */
#define SERCOM_I2CS_INTENCLR_AIEN   (0x1u <<  1) /**< \brief (SERCOM_I2CS_INTENCLR) Address Interrupt Disable */
#define SERCOM_I2CS_INTENCLR_DIEN   (0x1u <<  2) /**< \brief (SERCOM_I2CS_INTENCLR) Data Interrupt Disable */
#define SERCOM_I2CS_INTENCLR_MASK   0x7u /**< \brief (SERCOM_I2CS_INTENCLR) MASK Register */

/* -------- SERCOM_SPI_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) SPI SPI Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  DREIEN:1;         /*!< bit:      0  Data Register Empty Interrupt Disable */
    uint8_t  TXCIEN:1;         /*!< bit:      1  Transmit Complete Interrupt Disable */
    uint8_t  RXCIEN:1;         /*!< bit:      2  Receive Complete Interrupt Disable */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_SPI_INTENCLR_Type;

