zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define SERCOM_I2CS_INTFLAG_OFFSET  0x0E         /**< \brief (SERCOM_I2CS_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define SERCOM_I2CS_INTFLAG_RESETVALUE 0x00         /**< \brief (SERCOM_I2CS_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define SERCOM_I2CS_INTFLAG_PIF     (0x1u <<  0) /**< \brief (SERCOM_I2CS_INTFLAG) Stop Interrupt */
#define SERCOM_I2CS_INTFLAG_AIF     (0x1u <<  1) /**< \brief (SERCOM_I2CS_INTFLAG) Address Interrupt */
#define SERCOM_I2CS_INTFLAG_DIF     (0x1u <<  2) /**< \brief (SERCOM_I2CS_INTFLAG) Data Interrupt */
#define SERCOM_I2CS_INTFLAG_MASK    0x7u /**< \brief (SERCOM_I2CS_INTFLAG) MASK Register */

/* -------- SERCOM_SPI_INTFLAG : (SERCOM Offset: 0x0E) (R/W  8) SPI SPI Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  DREIF:1;          /*!< bit:      0  Data Register Empty Interrupt      */
    uint8_t  TXCIF:1;          /*!< bit:      1  Transmit Complete Interrupt        */
    uint8_t  RXCIF:1;          /*!< bit:      2  Receive Complete Interrupt         */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_SPI_INTFLAG_Type;

#define SERCOM_SPI_INTFLAG_OFFSET   0x0E         /**< \brief (SERCOM_SPI_INTFLAG offset) SPI Interrupt Flag Status and Clear Register */
#define SERCOM_SPI_INTFLAG_RESETVALUE 0x00         /**< \brief (SERCOM_SPI_INTFLAG reset_value) SPI Interrupt Flag Status and Clear Register */

#define SERCOM_SPI_INTFLAG_DREIF    (0x1u <<  0) /**< \brief (SERCOM_SPI_INTFLAG) Data Register Empty Interrupt */
#define SERCOM_SPI_INTFLAG_TXCIF    (0x1u <<  1) /**< \brief (SERCOM_SPI_INTFLAG) Transmit Complete Interrupt */
#define SERCOM_SPI_INTFLAG_RXCIF    (0x1u <<  2) /**< \brief (SERCOM_SPI_INTFLAG) Receive Complete Interrupt */
#define SERCOM_SPI_INTFLAG_MASK     0x7u /**< \brief (SERCOM_SPI_INTFLAG) MASK Register */

/* -------- SERCOM_USART_INTFLAG : (SERCOM Offset: 0x0E) (R/W  8) USART USART Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  DREIF:1;          /*!< bit:      0  Data Register Empty Interrupt      */
    uint8_t  TXCIF:1;          /*!< bit:      1  Transmit Complete Interrupt        */
    uint8_t  RXCIF:1;          /*!< bit:      2  Receive Complete Interrupt         */
    uint8_t  RXSIF:1;          /*!< bit:      3  Receive Start Interrupt            */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} SERCOM_USART_INTFLAG_Type;

#define SERCOM_USART_INTFLAG_OFFSET 0x0E         /**< \brief (SERCOM_USART_INTFLAG offset) USART Interrupt Flag Status and Clear Register */
#define SERCOM_USART_INTFLAG_RESETVALUE 0x00         /**< \brief (SERCOM_USART_INTFLAG reset_value) USART Interrupt Flag Status and Clear Register */

#define SERCOM_USART_INTFLAG_DREIF  (0x1u <<  0) /**< \brief (SERCOM_USART_INTFLAG) Data Register Empty Interrupt */
#define SERCOM_USART_INTFLAG_TXCIF  (0x1u <<  1) /**< \brief (SERCOM_USART_INTFLAG) Transmit Complete Interrupt */
#define SERCOM_USART_INTFLAG_RXCIF  (0x1u <<  2) /**< \brief (SERCOM_USART_INTFLAG) Receive Complete Interrupt */
#define SERCOM_USART_INTFLAG_RXSIF  (0x1u <<  3) /**< \brief (SERCOM_USART_INTFLAG) Receive Start Interrupt */
#define SERCOM_USART_INTFLAG_MASK   0xFu /**< \brief (SERCOM_USART_INTFLAG) MASK Register */

/* -------- SERCOM_I2CM_STATUS : (SERCOM Offset: 0x10) (R/W 32) I2CM Status Register -------- */
typedef union {
  struct {
    uint32_t BUSERR:1;         /*!< bit:      0  Bus Error                          */
    uint32_t ARBLOST:1;        /*!< bit:      1  Arbitration Lost                   */
    uint32_t RXACK:1;          /*!< bit:      2  Received Acknowledge               */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t BUSSTATE:2;       /*!< bit:  4.. 5  Bus State                          */
    uint32_t LOWTOUT:1;        /*!< bit:      6  SCL Low Timeout                    */
    uint32_t CLKHOLD:1;        /*!< bit:      7  Clock Hold                         */
    uint32_t :7;               /*!< bit:  8..14  Reserved                           */
    uint32_t SYNCBUSY:1;       /*!< bit:     15  Synchronization Busy               */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CM_STATUS_Type;

#define SERCOM_I2CM_STATUS_OFFSET   0x10         /**< \brief (SERCOM_I2CM_STATUS offset) Status Register */
#define SERCOM_I2CM_STATUS_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CM_STATUS reset_value) Status Register */

#define SERCOM_I2CM_STATUS_BUSERR   (0x1u <<  0) /**< \brief (SERCOM_I2CM_STATUS) Bus Error */
#define SERCOM_I2CM_STATUS_ARBLOST  (0x1u <<  1) /**< \brief (SERCOM_I2CM_STATUS) Arbitration Lost */
#define SERCOM_I2CM_STATUS_RXACK    (0x1u <<  2) /**< \brief (SERCOM_I2CM_STATUS) Received Acknowledge */
#define SERCOM_I2CM_STATUS_BUSSTATE_Pos    4
#define SERCOM_I2CM_STATUS_BUSSTATE_Msk    (0x3u << SERCOM_I2CM_STATUS_BUSSTATE_Pos) /**< \brief (SERCOM_I2CM_STATUS) Bus State */
#define SERCOM_I2CM_STATUS_BUSSTATE(value) ((SERCOM_I2CM_STATUS_BUSSTATE_Msk & ((value) << SERCOM_I2CM_STATUS_BUSSTATE_Pos)))
#define SERCOM_I2CM_STATUS_LOWTOUT  (0x1u <<  6) /**< \brief (SERCOM_I2CM_STATUS) SCL Low Timeout */
#define SERCOM_I2CM_STATUS_CLKHOLD  (0x1u <<  7) /**< \brief (SERCOM_I2CM_STATUS) Clock Hold */
#define SERCOM_I2CM_STATUS_SYNCBUSY (0x1u << 15) /**< \brief (SERCOM_I2CM_STATUS) Synchronization Busy */
#define SERCOM_I2CM_STATUS_MASK     0x80F7u /**< \brief (SERCOM_I2CM_STATUS) MASK Register */

/* -------- SERCOM_I2CS_STATUS : (SERCOM Offset: 0x10) (R/W 32) I2CS Status Register -------- */
typedef union {
  struct {
    uint32_t BUSERR:1;         /*!< bit:      0  Bus Error                          */
    uint32_t COLL:1;           /*!< bit:      1  Transmit Collision                 */
    uint32_t RXACK:1;          /*!< bit:      2  Receive Acknowledge                */
    uint32_t DIR:1;            /*!< bit:      3  Read/Write Direction               */
    uint32_t SR:1;             /*!< bit:      4  Repeated Start                     */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t LOWTOUT:1;        /*!< bit:      6  SCL Low Timeout                    */
    uint32_t CLKHOLD:1;        /*!< bit:      7  Clock Hold                         */
    uint32_t :7;               /*!< bit:  8..14  Reserved                           */
    uint32_t SYNCBUSY:1;       /*!< bit:     15  Synchronization Busy               */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CS_STATUS_Type;

