zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define SERCOM_I2CS_STATUS_OFFSET   0x10         /**< \brief (SERCOM_I2CS_STATUS offset) Status Register */
#define SERCOM_I2CS_STATUS_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CS_STATUS reset_value) Status Register */

#define SERCOM_I2CS_STATUS_BUSERR   (0x1u <<  0) /**< \brief (SERCOM_I2CS_STATUS) Bus Error */
#define SERCOM_I2CS_STATUS_COLL     (0x1u <<  1) /**< \brief (SERCOM_I2CS_STATUS) Transmit Collision */
#define SERCOM_I2CS_STATUS_RXACK    (0x1u <<  2) /**< \brief (SERCOM_I2CS_STATUS) Receive Acknowledge */
#define SERCOM_I2CS_STATUS_DIR      (0x1u <<  3) /**< \brief (SERCOM_I2CS_STATUS) Read/Write Direction */
#define SERCOM_I2CS_STATUS_SR       (0x1u <<  4) /**< \brief (SERCOM_I2CS_STATUS) Repeated Start */
#define SERCOM_I2CS_STATUS_LOWTOUT  (0x1u <<  6) /**< \brief (SERCOM_I2CS_STATUS) SCL Low Timeout */
#define SERCOM_I2CS_STATUS_CLKHOLD  (0x1u <<  7) /**< \brief (SERCOM_I2CS_STATUS) Clock Hold */
#define SERCOM_I2CS_STATUS_SYNCBUSY (0x1u << 15) /**< \brief (SERCOM_I2CS_STATUS) Synchronization Busy */
#define SERCOM_I2CS_STATUS_MASK     0x80DFu /**< \brief (SERCOM_I2CS_STATUS) MASK Register */

/* -------- SERCOM_SPI_STATUS : (SERCOM Offset: 0x10) (R/W 32) SPI SPI Status Register -------- */
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t BUFOVF:1;         /*!< bit:      2  Buffer Overflow                    */
    uint32_t :12;              /*!< bit:  3..14  Reserved                           */
    uint32_t SYNCBUSY:1;       /*!< bit:     15  Synchronization Busy               */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_SPI_STATUS_Type;

#define SERCOM_SPI_STATUS_OFFSET    0x10         /**< \brief (SERCOM_SPI_STATUS offset) SPI Status Register */
#define SERCOM_SPI_STATUS_RESETVALUE 0x00000000   /**< \brief (SERCOM_SPI_STATUS reset_value) SPI Status Register */

#define SERCOM_SPI_STATUS_BUFOVF    (0x1u <<  2) /**< \brief (SERCOM_SPI_STATUS) Buffer Overflow */
#define SERCOM_SPI_STATUS_SYNCBUSY  (0x1u << 15) /**< \brief (SERCOM_SPI_STATUS) Synchronization Busy */
#define SERCOM_SPI_STATUS_MASK      0x8004u /**< \brief (SERCOM_SPI_STATUS) MASK Register */

/* -------- SERCOM_USART_STATUS : (SERCOM Offset: 0x10) (R/W 32) USART USART Status Register -------- */
typedef union {
  struct {
    uint32_t PERR:1;           /*!< bit:      0  Parity Error                       */
    uint32_t FERR:1;           /*!< bit:      1  Frame Error                        */
    uint32_t BUFOVF:1;         /*!< bit:      2  Buffer Overflow                    */
    uint32_t :12;              /*!< bit:  3..14  Reserved                           */
    uint32_t SYNCBUSY:1;       /*!< bit:     15  Synchronization Busy               */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_USART_STATUS_Type;

#define SERCOM_USART_STATUS_OFFSET  0x10         /**< \brief (SERCOM_USART_STATUS offset) USART Status Register */
#define SERCOM_USART_STATUS_RESETVALUE 0x00000000   /**< \brief (SERCOM_USART_STATUS reset_value) USART Status Register */

#define SERCOM_USART_STATUS_PERR    (0x1u <<  0) /**< \brief (SERCOM_USART_STATUS) Parity Error */
#define SERCOM_USART_STATUS_FERR    (0x1u <<  1) /**< \brief (SERCOM_USART_STATUS) Frame Error */
#define SERCOM_USART_STATUS_BUFOVF  (0x1u <<  2) /**< \brief (SERCOM_USART_STATUS) Buffer Overflow */
#define SERCOM_USART_STATUS_SYNCBUSY (0x1u << 15) /**< \brief (SERCOM_USART_STATUS) Synchronization Busy */
#define SERCOM_USART_STATUS_MASK    0x8007u /**< \brief (SERCOM_USART_STATUS) MASK Register */

/* -------- SERCOM_I2CM_ADDR : (SERCOM Offset: 0x14) (R/W 32) I2CM Address Register -------- */
typedef union {
  struct {
    uint32_t ADDR:8;           /*!< bit:  0.. 7  Address Register                   */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CM_ADDR_Type;

#define SERCOM_I2CM_ADDR_OFFSET     0x14         /**< \brief (SERCOM_I2CM_ADDR offset) Address Register */
#define SERCOM_I2CM_ADDR_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CM_ADDR reset_value) Address Register */

#define SERCOM_I2CM_ADDR_ADDR_Pos    0
#define SERCOM_I2CM_ADDR_ADDR_Msk    (0xFFu << SERCOM_I2CM_ADDR_ADDR_Pos) /**< \brief (SERCOM_I2CM_ADDR) Address Register */
#define SERCOM_I2CM_ADDR_ADDR(value) ((SERCOM_I2CM_ADDR_ADDR_Msk & ((value) << SERCOM_I2CM_ADDR_ADDR_Pos)))
#define SERCOM_I2CM_ADDR_MASK       0xFFu /**< \brief (SERCOM_I2CM_ADDR) MASK Register */

/* -------- SERCOM_I2CS_ADDR : (SERCOM Offset: 0x14) (R/W 32) I2CS Address Register -------- */
typedef union {
  struct {
    uint32_t GENCEN:1;         /*!< bit:      0  General Call Address Enable        */
    uint32_t ADDR:7;           /*!< bit:  1.. 7  Address Register                   */
    uint32_t :9;               /*!< bit:  8..16  Reserved                           */
    uint32_t ADDRMASK:7;       /*!< bit: 17..23  Address Mask Register              */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CS_ADDR_Type;

#define SERCOM_I2CS_ADDR_OFFSET     0x14         /**< \brief (SERCOM_I2CS_ADDR offset) Address Register */
#define SERCOM_I2CS_ADDR_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CS_ADDR reset_value) Address Register */

#define SERCOM_I2CS_ADDR_GENCEN     (0x1u <<  0) /**< \brief (SERCOM_I2CS_ADDR) General Call Address Enable */
#define SERCOM_I2CS_ADDR_ADDR_Pos    1
#define SERCOM_I2CS_ADDR_ADDR_Msk    (0x7Fu << SERCOM_I2CS_ADDR_ADDR_Pos) /**< \brief (SERCOM_I2CS_ADDR) Address Register */
#define SERCOM_I2CS_ADDR_ADDR(value) ((SERCOM_I2CS_ADDR_ADDR_Msk & ((value) << SERCOM_I2CS_ADDR_ADDR_Pos)))
#define SERCOM_I2CS_ADDR_ADDRMASK_Pos    17
#define SERCOM_I2CS_ADDR_ADDRMASK_Msk    (0x7Fu << SERCOM_I2CS_ADDR_ADDRMASK_Pos) /**< \brief (SERCOM_I2CS_ADDR) Address Mask Register */
#define SERCOM_I2CS_ADDR_ADDRMASK(value) ((SERCOM_I2CS_ADDR_ADDRMASK_Msk & ((value) << SERCOM_I2CS_ADDR_ADDRMASK_Pos)))
#define SERCOM_I2CS_ADDR_MASK       0xFE00FFu /**< \brief (SERCOM_I2CS_ADDR) MASK Register */

/* -------- SERCOM_SPI_ADDR : (SERCOM Offset: 0x14) (R/W 32) SPI SPI Address Register -------- */
typedef union {
  struct {
    uint32_t ADDR:8;           /*!< bit:  0.. 7  Address Register                   */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t ADDRMASK:8;       /*!< bit: 16..23  Address Mask Register              */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_SPI_ADDR_Type;

#define SERCOM_SPI_ADDR_OFFSET      0x14         /**< \brief (SERCOM_SPI_ADDR offset) SPI Address Register */
#define SERCOM_SPI_ADDR_RESETVALUE  0x00000000   /**< \brief (SERCOM_SPI_ADDR reset_value) SPI Address Register */

#define SERCOM_SPI_ADDR_ADDR_Pos    0
#define SERCOM_SPI_ADDR_ADDR_Msk    (0xFFu << SERCOM_SPI_ADDR_ADDR_Pos) /**< \brief (SERCOM_SPI_ADDR) Address Register */
#define SERCOM_SPI_ADDR_ADDR(value) ((SERCOM_SPI_ADDR_ADDR_Msk & ((value) << SERCOM_SPI_ADDR_ADDR_Pos)))
#define SERCOM_SPI_ADDR_ADDRMASK_Pos    16
#define SERCOM_SPI_ADDR_ADDRMASK_Msk    (0xFFu << SERCOM_SPI_ADDR_ADDRMASK_Pos) /**< \brief (SERCOM_SPI_ADDR) Address Mask Register */
#define SERCOM_SPI_ADDR_ADDRMASK(value) ((SERCOM_SPI_ADDR_ADDRMASK_Msk & ((value) << SERCOM_SPI_ADDR_ADDRMASK_Pos)))
#define SERCOM_SPI_ADDR_MASK        0xFF00FFu /**< \brief (SERCOM_SPI_ADDR) MASK Register */

/* -------- SERCOM_I2CM_DATA : (SERCOM Offset: 0x18) (R/W 32) I2CM Data Register -------- */
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Data Register                      */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SERCOM_I2CM_DATA_Type;

#define SERCOM_I2CM_DATA_OFFSET     0x18         /**< \brief (SERCOM_I2CM_DATA offset) Data Register */
#define SERCOM_I2CM_DATA_RESETVALUE 0x00000000   /**< \brief (SERCOM_I2CM_DATA reset_value) Data Register */

#define SERCOM_I2CM_DATA_DATA_Pos    0
#define SERCOM_I2CM_DATA_DATA_Msk    (0xFFu << SERCOM_I2CM_DATA_DATA_Pos) /**< \brief (SERCOM_I2CM_DATA) Data Register */
#define SERCOM_I2CM_DATA_DATA(value) ((SERCOM_I2CM_DATA_DATA_Msk & ((value) << SERCOM_I2CM_DATA_DATA_Pos)))
#define SERCOM_I2CM_DATA_MASK       0xFFu /**< \brief (SERCOM_I2CM_DATA) MASK Register */

