zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
/* -------- SYSCTRL_VREFTESTA : (SYSCTRL Offset: 0x4C) (R/W 32) VREF Test Register A -------- */
typedef union {
  struct {
    uint32_t BIASEN:1;         /*!< bit:      0  Bias Current Generator Enable      */
    uint32_t BGEN:1;           /*!< bit:      1  Bandgap Voltage Reference Enable   */
    uint32_t :6;               /*!< bit:  2.. 7  Reserved                           */
    uint32_t BGBUFEN:8;        /*!< bit:  8..15  Bandgap Buffers Enable             */
    uint32_t BGRDY:1;          /*!< bit:     16  Bandgap Voltage Reference Ready    */
    uint32_t BIASRDY:1;        /*!< bit:     17  PTAT Bias Ready                    */
    uint32_t ACBUFRDY:1;       /*!< bit:     18  AC Bandgap Buffer Ready            */
    uint32_t ADCBUFRDY:1;      /*!< bit:     19  ADC Bandgap Buffer Ready           */
    uint32_t DACBUFRDY:1;      /*!< bit:     20  DAC Bandgap Buffer Ready           */
    uint32_t VDOUBBUFRDY:1;    /*!< bit:     21  Voltage Doubler Bandgap Buffer Ready */
    uint32_t BUFRRRDY:1;       /*!< bit:     22  Rail-to-Rail Buffer Ready          */
    uint32_t DIV2BUFRDY:1;     /*!< bit:     23  Divide-by-2 Buffer Ready           */
    uint32_t BUFRRSEL:2;       /*!< bit: 24..25  Rail-to-Rail Buffer Input Select   */
    uint32_t :5;               /*!< bit: 26..30  Reserved                           */
    uint32_t TESTEN:1;         /*!< bit:     31  Test Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SYSCTRL_VREFTESTA_Type;

#define SYSCTRL_VREFTESTA_OFFSET    0x4C         /**< \brief (SYSCTRL_VREFTESTA offset) VREF Test Register A */
#define SYSCTRL_VREFTESTA_RESETVALUE 0x00000000   /**< \brief (SYSCTRL_VREFTESTA reset_value) VREF Test Register A */

#define SYSCTRL_VREFTESTA_BIASEN    (0x1u <<  0) /**< \brief (SYSCTRL_VREFTESTA) Bias Current Generator Enable */
#define SYSCTRL_VREFTESTA_BGEN      (0x1u <<  1) /**< \brief (SYSCTRL_VREFTESTA) Bandgap Voltage Reference Enable */
#define SYSCTRL_VREFTESTA_BGBUFEN_Pos    8
#define SYSCTRL_VREFTESTA_BGBUFEN_Msk    (0xFFu << SYSCTRL_VREFTESTA_BGBUFEN_Pos) /**< \brief (SYSCTRL_VREFTESTA) Bandgap Buffers Enable */
#define SYSCTRL_VREFTESTA_BGBUFEN(value) ((SYSCTRL_VREFTESTA_BGBUFEN_Msk & ((value) << SYSCTRL_VREFTESTA_BGBUFEN_Pos)))
#define SYSCTRL_VREFTESTA_BGRDY     (0x1u << 16) /**< \brief (SYSCTRL_VREFTESTA) Bandgap Voltage Reference Ready */
#define SYSCTRL_VREFTESTA_BIASRDY   (0x1u << 17) /**< \brief (SYSCTRL_VREFTESTA) PTAT Bias Ready */
#define SYSCTRL_VREFTESTA_ACBUFRDY  (0x1u << 18) /**< \brief (SYSCTRL_VREFTESTA) AC Bandgap Buffer Ready */
#define SYSCTRL_VREFTESTA_ADCBUFRDY (0x1u << 19) /**< \brief (SYSCTRL_VREFTESTA) ADC Bandgap Buffer Ready */
#define SYSCTRL_VREFTESTA_DACBUFRDY (0x1u << 20) /**< \brief (SYSCTRL_VREFTESTA) DAC Bandgap Buffer Ready */
#define SYSCTRL_VREFTESTA_VDOUBBUFRDY (0x1u << 21) /**< \brief (SYSCTRL_VREFTESTA) Voltage Doubler Bandgap Buffer Ready */
#define SYSCTRL_VREFTESTA_BUFRRRDY  (0x1u << 22) /**< \brief (SYSCTRL_VREFTESTA) Rail-to-Rail Buffer Ready */
#define SYSCTRL_VREFTESTA_DIV2BUFRDY (0x1u << 23) /**< \brief (SYSCTRL_VREFTESTA) Divide-by-2 Buffer Ready */
#define SYSCTRL_VREFTESTA_BUFRRSEL_Pos    24
#define SYSCTRL_VREFTESTA_BUFRRSEL_Msk    (0x3u << SYSCTRL_VREFTESTA_BUFRRSEL_Pos) /**< \brief (SYSCTRL_VREFTESTA) Rail-to-Rail Buffer Input Select */
#define SYSCTRL_VREFTESTA_BUFRRSEL(value) ((SYSCTRL_VREFTESTA_BUFRRSEL_Msk & ((value) << SYSCTRL_VREFTESTA_BUFRRSEL_Pos)))
#define SYSCTRL_VREFTESTA_TESTEN    (0x1u << 31) /**< \brief (SYSCTRL_VREFTESTA) Test Enable */
#define SYSCTRL_VREFTESTA_MASK      0x83FFFF03u /**< \brief (SYSCTRL_VREFTESTA) MASK Register */

/* -------- SYSCTRL_VREFTESTB : (SYSCTRL Offset: 0x50) (R/W 16) VREF Test Register B -------- */
typedef union {
  struct {
    uint16_t SAMPLECLK:2;      /*!< bit:  0.. 1  Sample Clock Division Factor       */
    uint16_t DIVLEV0:3;        /*!< bit:  2.. 4  ULP VREG Reference Division Level  */
    uint16_t DIVLEV1:3;        /*!< bit:  5.. 7  ULP VREG Gain Reference Division Level */
    uint16_t DIVLEV2:3;        /*!< bit:  8..10  XOSC Reference Division Level      */
    uint16_t DIVLEV3:3;        /*!< bit: 11..13  VREG Reference Division Level      */
    uint16_t :1;               /*!< bit:     14  Reserved                           */
    uint16_t TESTEN:1;         /*!< bit:     15  Test Enable                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} SYSCTRL_VREFTESTB_Type;

#define SYSCTRL_VREFTESTB_OFFSET    0x50         /**< \brief (SYSCTRL_VREFTESTB offset) VREF Test Register B */

#define SYSCTRL_VREFTESTB_SAMPLECLK_Pos    0
#define SYSCTRL_VREFTESTB_SAMPLECLK_Msk    (0x3u << SYSCTRL_VREFTESTB_SAMPLECLK_Pos) /**< \brief (SYSCTRL_VREFTESTB) Sample Clock Division Factor */
#define SYSCTRL_VREFTESTB_SAMPLECLK(value) ((SYSCTRL_VREFTESTB_SAMPLECLK_Msk & ((value) << SYSCTRL_VREFTESTB_SAMPLECLK_Pos)))
#define SYSCTRL_VREFTESTB_DIVLEV0_Pos    2
#define SYSCTRL_VREFTESTB_DIVLEV0_Msk    (0x7u << SYSCTRL_VREFTESTB_DIVLEV0_Pos) /**< \brief (SYSCTRL_VREFTESTB) ULP VREG Reference Division Level */
#define SYSCTRL_VREFTESTB_DIVLEV0(value) ((SYSCTRL_VREFTESTB_DIVLEV0_Msk & ((value) << SYSCTRL_VREFTESTB_DIVLEV0_Pos)))
#define SYSCTRL_VREFTESTB_DIVLEV1_Pos    5
#define SYSCTRL_VREFTESTB_DIVLEV1_Msk    (0x7u << SYSCTRL_VREFTESTB_DIVLEV1_Pos) /**< \brief (SYSCTRL_VREFTESTB) ULP VREG Gain Reference Division Level */
#define SYSCTRL_VREFTESTB_DIVLEV1(value) ((SYSCTRL_VREFTESTB_DIVLEV1_Msk & ((value) << SYSCTRL_VREFTESTB_DIVLEV1_Pos)))
#define SYSCTRL_VREFTESTB_DIVLEV2_Pos    8
#define SYSCTRL_VREFTESTB_DIVLEV2_Msk    (0x7u << SYSCTRL_VREFTESTB_DIVLEV2_Pos) /**< \brief (SYSCTRL_VREFTESTB) XOSC Reference Division Level */
#define SYSCTRL_VREFTESTB_DIVLEV2(value) ((SYSCTRL_VREFTESTB_DIVLEV2_Msk & ((value) << SYSCTRL_VREFTESTB_DIVLEV2_Pos)))
#define SYSCTRL_VREFTESTB_DIVLEV3_Pos    11
#define SYSCTRL_VREFTESTB_DIVLEV3_Msk    (0x7u << SYSCTRL_VREFTESTB_DIVLEV3_Pos) /**< \brief (SYSCTRL_VREFTESTB) VREG Reference Division Level */
#define SYSCTRL_VREFTESTB_DIVLEV3(value) ((SYSCTRL_VREFTESTB_DIVLEV3_Msk & ((value) << SYSCTRL_VREFTESTB_DIVLEV3_Pos)))
#define SYSCTRL_VREFTESTB_TESTEN    (0x1u << 15) /**< \brief (SYSCTRL_VREFTESTB) Test Enable */
#define SYSCTRL_VREFTESTB_MASK      0xBFFFu /**< \brief (SYSCTRL_VREFTESTB) MASK Register */

/* -------- SYSCTRL_FORCECLKON : (SYSCTRL Offset: 0x54) (R/W 32) Force Clock On Register -------- */
typedef union {
  struct {
    uint32_t XOSCON:1;         /*!< bit:      0                                     */
    uint32_t XOSC32KON:1;      /*!< bit:      1                                     */
    uint32_t DFLLON:1;         /*!< bit:      2                                     */
    uint32_t OSC32KON:1;       /*!< bit:      3                                     */
    uint32_t OSC8MON:1;        /*!< bit:      4                                     */
    uint32_t :27;              /*!< bit:  5..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SYSCTRL_FORCECLKON_Type;

