zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define SYSCTRL_FORCECLKON_OFFSET   0x54         /**< \brief (SYSCTRL_FORCECLKON offset) Force Clock On Register */

#define SYSCTRL_FORCECLKON_XOSCON   (0x1u <<  0) /**< \brief (SYSCTRL_FORCECLKON)  */
#define SYSCTRL_FORCECLKON_XOSC32KON (0x1u <<  1) /**< \brief (SYSCTRL_FORCECLKON)  */
#define SYSCTRL_FORCECLKON_DFLLON   (0x1u <<  2) /**< \brief (SYSCTRL_FORCECLKON)  */
#define SYSCTRL_FORCECLKON_OSC32KON (0x1u <<  3) /**< \brief (SYSCTRL_FORCECLKON)  */
#define SYSCTRL_FORCECLKON_OSC8MON  (0x1u <<  4) /**< \brief (SYSCTRL_FORCECLKON)  */
#define SYSCTRL_FORCECLKON_MASK     0x1Fu /**< \brief (SYSCTRL_FORCECLKON) MASK Register */

/* -------- SYSCTRL_TESTMODE : (SYSCTRL Offset: 0x58) (R/W 32) Test Mode Register -------- */
typedef union {
  struct {
    uint32_t XOSC:1;           /*!< bit:      0  XOSC Test Mode Enable              */
    uint32_t XOSC32:1;         /*!< bit:      1  XOSC32 Test Mode Enable            */
    uint32_t DFLL:1;           /*!< bit:      2  DFLL Test Mode Enable              */
    uint32_t BOD33:1;          /*!< bit:      3  BOD33 Test Mode Enable             */
    uint32_t BOD12:1;          /*!< bit:      4  BOD12 Test Mode Enable             */
    uint32_t OSC32K:1;         /*!< bit:      5  OSC32K Test Mode Enable            */
    uint32_t OSCULP32K:1;      /*!< bit:      6  OSCULP32K Test Mode Enable         */
    uint32_t OSC8M:1;          /*!< bit:      7  OSC8M Test Mode Enable             */
    uint32_t VREG:1;           /*!< bit:      8  VREG Test Mode Enable              */
    uint32_t VREF:1;           /*!< bit:      9  VREF Test Mode Enable              */
    uint32_t ALLCLK:1;         /*!< bit:     10  All Clocks Test Mode Enable        */
    uint32_t POR33:1;          /*!< bit:     11  POR33 Test Mode Enable             */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SYSCTRL_TESTMODE_Type;

#define SYSCTRL_TESTMODE_OFFSET     0x58         /**< \brief (SYSCTRL_TESTMODE offset) Test Mode Register */

#define SYSCTRL_TESTMODE_XOSC       (0x1u <<  0) /**< \brief (SYSCTRL_TESTMODE) XOSC Test Mode Enable */
#define SYSCTRL_TESTMODE_XOSC32     (0x1u <<  1) /**< \brief (SYSCTRL_TESTMODE) XOSC32 Test Mode Enable */
#define SYSCTRL_TESTMODE_DFLL       (0x1u <<  2) /**< \brief (SYSCTRL_TESTMODE) DFLL Test Mode Enable */
#define SYSCTRL_TESTMODE_BOD33      (0x1u <<  3) /**< \brief (SYSCTRL_TESTMODE) BOD33 Test Mode Enable */
#define SYSCTRL_TESTMODE_BOD12      (0x1u <<  4) /**< \brief (SYSCTRL_TESTMODE) BOD12 Test Mode Enable */
#define SYSCTRL_TESTMODE_OSC32K     (0x1u <<  5) /**< \brief (SYSCTRL_TESTMODE) OSC32K Test Mode Enable */
#define SYSCTRL_TESTMODE_OSCULP32K  (0x1u <<  6) /**< \brief (SYSCTRL_TESTMODE) OSCULP32K Test Mode Enable */
#define SYSCTRL_TESTMODE_OSC8M      (0x1u <<  7) /**< \brief (SYSCTRL_TESTMODE) OSC8M Test Mode Enable */
#define SYSCTRL_TESTMODE_VREG       (0x1u <<  8) /**< \brief (SYSCTRL_TESTMODE) VREG Test Mode Enable */
#define SYSCTRL_TESTMODE_VREF       (0x1u <<  9) /**< \brief (SYSCTRL_TESTMODE) VREF Test Mode Enable */
#define SYSCTRL_TESTMODE_ALLCLK     (0x1u << 10) /**< \brief (SYSCTRL_TESTMODE) All Clocks Test Mode Enable */
#define SYSCTRL_TESTMODE_POR33      (0x1u << 11) /**< \brief (SYSCTRL_TESTMODE) POR33 Test Mode Enable */
#define SYSCTRL_TESTMODE_MASK       0xFFFu /**< \brief (SYSCTRL_TESTMODE) MASK Register */

/** \brief SYSCTRL hardware registers */
typedef struct {
  __IO SYSCTRL_INTENCLR_Type     INTENCLR;    /**< \brief Offset: 0x00 (R/W 32) Interrupt Enable Clear Register */
  __IO SYSCTRL_INTENSET_Type     INTENSET;    /**< \brief Offset: 0x04 (R/W 32) Interrupt Enable Set Register */
  __IO SYSCTRL_INTFLAG_Type      INTFLAG;     /**< \brief Offset: 0x08 (R/W 32) Interrupt Flag Status and Clear Register */
  __I  SYSCTRL_PCLKSR_Type       PCLKSR;      /**< \brief Offset: 0x0C (R/  32) Power and Clocks Status Register */
  __IO SYSCTRL_XOSC_Type         XOSC;        /**< \brief Offset: 0x10 (R/W 16) XOSC Control Register */
       RoReg8                    Reserved1[0x2];
  __IO SYSCTRL_XOSC32K_Type      XOSC32K;     /**< \brief Offset: 0x14 (R/W 16) XOSC32K Control Register */
  __IO SYSCTRL_XOSC32KTEST_Type  XOSC32KTEST; /**< \brief Offset: 0x16 (R/W  8) XOSC32K Test Register */
       RoReg8                    Reserved2[0x1];
  __IO SYSCTRL_DFLLCTRL_Type     DFLLCTRL;    /**< \brief Offset: 0x18 (R/W 32) DFLL  Config Register */
  __IO SYSCTRL_DFLLVAL_Type      DFLLVAL;     /**< \brief Offset: 0x1C (R/W 32) DFLL Calibration Value Register */
  __IO SYSCTRL_DFLLMUL_Type      DFLLMUL;     /**< \brief Offset: 0x20 (R/W 32) DFLL Multiplier Register */
  __IO SYSCTRL_DFLLSYNC_Type     DFLLSYNC;    /**< \brief Offset: 0x24 (R/W  8) DFLL Synchronization Register */
       RoReg8                    Reserved3[0x3];
  __IO SYSCTRL_BOD33_Type        BOD33;       /**< \brief Offset: 0x28 (R/W 32) BOD33 Control Register */
  __IO SYSCTRL_BOD12_Type        BOD12;       /**< \brief Offset: 0x2C (R/W 32) BOD12 Control Register */
  __IO SYSCTRL_OSC32K_Type       OSC32K;      /**< \brief Offset: 0x30 (R/W 32) OSC32K Control Register */
  __IO SYSCTRL_OSCULP32K_Type    OSCULP32K;   /**< \brief Offset: 0x34 (R/W 32) OSCULP32K Control Register */
  __IO SYSCTRL_OSCULP32KTEST_Type OSCULP32KTEST; /**< \brief Offset: 0x38 (R/W  8) OSCULP32K Test Register */
       RoReg8                    Reserved4[0x3];
  __IO SYSCTRL_OSC8M_Type        OSC8M;       /**< \brief Offset: 0x3C (R/W 32) OSC8M Control Register A */
  __IO SYSCTRL_VREG_Type         VREG;        /**< \brief Offset: 0x40 (R/W 16) VREG Control Register */
       RoReg8                    Reserved5[0x2];
  __IO SYSCTRL_VREGTEST_Type     VREGTEST;    /**< \brief Offset: 0x44 (R/W 32) VREG Test Register */
  __IO SYSCTRL_VREF_Type         VREF;        /**< \brief Offset: 0x48 (R/W 32) VREF Control Register A */
  __IO SYSCTRL_VREFTESTA_Type    VREFTESTA;   /**< \brief Offset: 0x4C (R/W 32) VREF Test Register A */
  __IO SYSCTRL_VREFTESTB_Type    VREFTESTB;   /**< \brief Offset: 0x50 (R/W 16) VREF Test Register B */
       RoReg8                    Reserved6[0x2];
  __IO SYSCTRL_FORCECLKON_Type   FORCECLKON;  /**< \brief Offset: 0x54 (R/W 32) Force Clock On Register */
  __IO SYSCTRL_TESTMODE_Type     TESTMODE;    /**< \brief Offset: 0x58 (R/W 32) Test Mode Register */
} Sysctrl;

#endif /*  __EXCLUDE_SYSCTRL_FROM_CMSIS__ */
#endif /* __ASSEMBLY__ */

/*@}*/

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TC */
/* ========================================================================== */
/** \addtogroup SAM0+D_TC Basic Timer Counter */
/*@{*/

#define REV_TC         0x100

