zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define WDT_INTENCLR_EW             (0x1u <<  0) /**< \brief (WDT_INTENCLR) Early Warning Interrupt Disable */
#define WDT_INTENCLR_MASK           0x1u /**< \brief (WDT_INTENCLR) MASK Register */

/* -------- WDT_INTENSET : (WDT Offset: 0x5) (R/W  8) Interrupt Enable Set Register -------- */
typedef union {
  struct {
    uint8_t  EW:1;             /*!< bit:      0  Early Warning Interrupt Enable     */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} WDT_INTENSET_Type;

#define WDT_INTENSET_OFFSET         0x5          /**< \brief (WDT_INTENSET offset) Interrupt Enable Set Register */
#define WDT_INTENSET_RESETVALUE     0x00         /**< \brief (WDT_INTENSET reset_value) Interrupt Enable Set Register */

#define WDT_INTENSET_EW             (0x1u <<  0) /**< \brief (WDT_INTENSET) Early Warning Interrupt Enable */
#define WDT_INTENSET_MASK           0x1u /**< \brief (WDT_INTENSET) MASK Register */

/* -------- WDT_INTFLAG : (WDT Offset: 0x6) (R/W  8) Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  EW:1;             /*!< bit:      0  Early Warning Interrupt Flag       */
    uint8_t  :7;               /*!< bit:  1.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} WDT_INTFLAG_Type;

#define WDT_INTFLAG_OFFSET          0x6          /**< \brief (WDT_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define WDT_INTFLAG_RESETVALUE      0x00         /**< \brief (WDT_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define WDT_INTFLAG_EW              (0x1u <<  0) /**< \brief (WDT_INTFLAG) Early Warning Interrupt Flag */
#define WDT_INTFLAG_MASK            0x1u /**< \brief (WDT_INTFLAG) MASK Register */

/* -------- WDT_STATUS : (WDT Offset: 0x7) (R/   8) Status Register -------- */
typedef union {
  struct {
    uint8_t  :7;               /*!< bit:  0.. 6  Reserved                           */
    uint8_t  SYNCBUSY:1;       /*!< bit:      7  Synchronization Busy               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} WDT_STATUS_Type;

#define WDT_STATUS_OFFSET           0x7          /**< \brief (WDT_STATUS offset) Status Register */
#define WDT_STATUS_RESETVALUE       0x00         /**< \brief (WDT_STATUS reset_value) Status Register */

#define WDT_STATUS_SYNCBUSY         (0x1u <<  7) /**< \brief (WDT_STATUS) Synchronization Busy */
#define WDT_STATUS_MASK             0x80u /**< \brief (WDT_STATUS) MASK Register */

/* -------- WDT_CLEAR : (WDT Offset: 0x8) ( /W  8) Clear Register -------- */
typedef union {
  struct {
    uint8_t  CLEAR:8;          /*!< bit:  0.. 7  Watchdog Timer Clears Command Register */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} WDT_CLEAR_Type;

#define WDT_CLEAR_OFFSET            0x8          /**< \brief (WDT_CLEAR offset) Clear Register */
#define WDT_CLEAR_RESETVALUE        0x00         /**< \brief (WDT_CLEAR reset_value) Clear Register */

#define WDT_CLEAR_CLEAR_Pos         0
#define WDT_CLEAR_CLEAR_Msk         (0xFFu << WDT_CLEAR_CLEAR_Pos) /**< \brief (WDT_CLEAR) Watchdog Timer Clears Command Register */
#define WDT_CLEAR_CLEAR(value)      ((WDT_CLEAR_CLEAR_Msk & ((value) << WDT_CLEAR_CLEAR_Pos)))
#define WDT_CLEAR_MASK              0xFFu /**< \brief (WDT_CLEAR) MASK Register */

/** \brief WDT hardware registers */
typedef struct {
  __IO WDT_CTRL_Type             CTRL;        /**< \brief Offset: 0x0 (R/W  8) Control Register */
  __IO WDT_WINCTRL_Type          WINCTRL;     /**< \brief Offset: 0x1 (R/W  8) Window Control Register */
  __IO WDT_EWCTRL_Type           EWCTRL;      /**< \brief Offset: 0x2 (R/W  8) Early Warning Control Register */
       RoReg8                    Reserved1[0x1];
  __IO WDT_INTENCLR_Type         INTENCLR;    /**< \brief Offset: 0x4 (R/W  8) Interrupt Enable Clear Register */
  __IO WDT_INTENSET_Type         INTENSET;    /**< \brief Offset: 0x5 (R/W  8) Interrupt Enable Set Register */
  __IO WDT_INTFLAG_Type          INTFLAG;     /**< \brief Offset: 0x6 (R/W  8) Interrupt Flag Status and Clear Register */
  __I  WDT_STATUS_Type           STATUS;      /**< \brief Offset: 0x7 (R/   8) Status Register */
  __O  WDT_CLEAR_Type            CLEAR;       /**< \brief Offset: 0x8 ( /W  8) Clear Register */
} Wdt;

#endif /*  __EXCLUDE_WDT_FROM_CMSIS__ */
#endif /* __ASSEMBLY__ */

/*@}*/

/*@}*/

/* ************************************************************************** */
/**  REGISTER ACCESS DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_reg Registers Access Definitions */
/*@{*/

/* ========== Register definition for PAC0 peripheral ========== */
#define REG_PAC0_WPCLR            REG_ACCESS(RwReg  , 0x40000000U) /**< \brief (PAC0) Write Protection Clear Register */
#define REG_PAC0_WPSET            REG_ACCESS(RwReg  , 0x40000004U) /**< \brief (PAC0) Write Protection Set Register */
/* ========== Register definition for PM peripheral ========== */
#define REG_PM_CTRL               REG_ACCESS(RwReg8 , 0x40000400U) /**< \brief (PM) Control Register */
#define REG_PM_SLEEP              REG_ACCESS(RwReg8 , 0x40000401U) /**< \brief (PM) Sleep Register */
#define REG_PM_CPUSEL             REG_ACCESS(RwReg8 , 0x40000408U) /**< \brief (PM) CPU Clock Select */
#define REG_PM_APBASEL            REG_ACCESS(RwReg8 , 0x40000409U) /**< \brief (PM) APBA Clock Select */
#define REG_PM_APBBSEL            REG_ACCESS(RwReg8 , 0x4000040AU) /**< \brief (PM) APBB Clock Select */
#define REG_PM_APBCSEL            REG_ACCESS(RwReg8 , 0x4000040BU) /**< \brief (PM) APBC Clock Select */
#define REG_PM_AHBMASK            REG_ACCESS(RwReg  , 0x40000414U) /**< \brief (PM) AHB Mask */
#define REG_PM_APBAMASK           REG_ACCESS(RwReg  , 0x40000418U) /**< \brief (PM) APBA Mask */
#define REG_PM_APBBMASK           REG_ACCESS(RwReg  , 0x4000041CU) /**< \brief (PM) APBB Mask */
#define REG_PM_APBCMASK           REG_ACCESS(RwReg  , 0x40000420U) /**< \brief (PM) APBC Mask */
#define REG_PM_INTENCLR           REG_ACCESS(RwReg8 , 0x40000434U) /**< \brief (PM) Interrupt Enable Clear Register */
#define REG_PM_INTENSET           REG_ACCESS(RwReg8 , 0x40000435U) /**< \brief (PM) Interrupt Enable Set Register */
#define REG_PM_INTFLAG            REG_ACCESS(RwReg8 , 0x40000436U) /**< \brief (PM) Interrupt Flag Status and Clear Register */
#define REG_PM_RCAUSE             REG_ACCESS(RoReg8 , 0x40000438U) /**< \brief (PM) Reset Cause Register */
/* ========== Register definition for SYSCTRL peripheral ========== */
#define REG_SYSCTRL_INTENCLR      REG_ACCESS(RwReg  , 0x40000800U) /**< \brief (SYSCTRL) Interrupt Enable Clear Register */
#define REG_SYSCTRL_INTENSET      REG_ACCESS(RwReg  , 0x40000804U) /**< \brief (SYSCTRL) Interrupt Enable Set Register */
#define REG_SYSCTRL_INTFLAG       REG_ACCESS(RwReg  , 0x40000808U) /**< \brief (SYSCTRL) Interrupt Flag Status and Clear Register */
#define REG_SYSCTRL_PCLKSR        REG_ACCESS(RoReg  , 0x4000080CU) /**< \brief (SYSCTRL) Power and Clocks Status Register */
#define REG_SYSCTRL_XOSC          REG_ACCESS(RwReg16, 0x40000810U) /**< \brief (SYSCTRL) XOSC Control Register */
#define REG_SYSCTRL_XOSC32K       REG_ACCESS(RwReg16, 0x40000814U) /**< \brief (SYSCTRL) XOSC32K Control Register */
#define REG_SYSCTRL_XOSC32KTEST   REG_ACCESS(RwReg8 , 0x40000816U) /**< \brief (SYSCTRL) XOSC32K Test Register */
#define REG_SYSCTRL_DFLLCTRL      REG_ACCESS(RwReg  , 0x40000818U) /**< \brief (SYSCTRL) DFLL  Config Register */
#define REG_SYSCTRL_DFLLVAL       REG_ACCESS(RwReg  , 0x4000081CU) /**< \brief (SYSCTRL) DFLL Calibration Value Register */
#define REG_SYSCTRL_DFLLMUL       REG_ACCESS(RwReg  , 0x40000820U) /**< \brief (SYSCTRL) DFLL Multiplier Register */
#define REG_SYSCTRL_DFLLSYNC      REG_ACCESS(RwReg8 , 0x40000824U) /**< \brief (SYSCTRL) DFLL Synchronization Register */
#define REG_SYSCTRL_BOD33         REG_ACCESS(RwReg  , 0x40000828U) /**< \brief (SYSCTRL) BOD33 Control Register */
#define REG_SYSCTRL_BOD12         REG_ACCESS(RwReg  , 0x4000082CU) /**< \brief (SYSCTRL) BOD12 Control Register */
#define REG_SYSCTRL_OSC32K        REG_ACCESS(RwReg  , 0x40000830U) /**< \brief (SYSCTRL) OSC32K Control Register */
#define REG_SYSCTRL_OSCULP32K     REG_ACCESS(RwReg  , 0x40000834U) /**< \brief (SYSCTRL) OSCULP32K Control Register */
#define REG_SYSCTRL_OSCULP32KTEST REG_ACCESS(RwReg8 , 0x40000838U) /**< \brief (SYSCTRL) OSCULP32K Test Register */
#define REG_SYSCTRL_OSC8M         REG_ACCESS(RwReg  , 0x4000083CU) /**< \brief (SYSCTRL) OSC8M Control Register A */
#define REG_SYSCTRL_VREG          REG_ACCESS(RwReg16, 0x40000840U) /**< \brief (SYSCTRL) VREG Control Register */
#define REG_SYSCTRL_VREGTEST      REG_ACCESS(RwReg  , 0x40000844U) /**< \brief (SYSCTRL) VREG Test Register */
#define REG_SYSCTRL_VREF          REG_ACCESS(RwReg  , 0x40000848U) /**< \brief (SYSCTRL) VREF Control Register A */
#define REG_SYSCTRL_VREFTESTA     REG_ACCESS(RwReg  , 0x4000084CU) /**< \brief (SYSCTRL) VREF Test Register A */
#define REG_SYSCTRL_VREFTESTB     REG_ACCESS(RwReg16, 0x40000850U) /**< \brief (SYSCTRL) VREF Test Register B */
#define REG_SYSCTRL_FORCECLKON    REG_ACCESS(RwReg  , 0x40000854U) /**< \brief (SYSCTRL) Force Clock On Register */
#define REG_SYSCTRL_TESTMODE      REG_ACCESS(RwReg  , 0x40000858U) /**< \brief (SYSCTRL) Test Mode Register */
/* ========== Register definition for GCLK peripheral ========== */
#define REG_GCLK_CTRL             REG_ACCESS(RwReg8 , 0x40000C00U) /**< \brief (GCLK) Control Register */
#define REG_GCLK_STATUS           REG_ACCESS(RwReg8 , 0x40000C01U) /**< \brief (GCLK) Status Register */
#define REG_GCLK_CLKCTRL          REG_ACCESS(RwReg16, 0x40000C02U) /**< \brief (GCLK) Generic Clock Control Register */
#define REG_GCLK_GENCTRL          REG_ACCESS(RwReg  , 0x40000C04U) /**< \brief (GCLK) Generic Clock Generator Control Register */
#define REG_GCLK_GENDIV           REG_ACCESS(RwReg  , 0x40000C08U) /**< \brief (GCLK) Generic Clock Generator Division Register */
/* ========== Register definition for WDT peripheral ========== */
#define REG_WDT_CTRL              REG_ACCESS(RwReg8 , 0x40001000U) /**< \brief (WDT) Control Register */
#define REG_WDT_WINCTRL           REG_ACCESS(RwReg8 , 0x40001001U) /**< \brief (WDT) Window Control Register */
#define REG_WDT_EWCTRL            REG_ACCESS(RwReg8 , 0x40001002U) /**< \brief (WDT) Early Warning Control Register */
#define REG_WDT_INTENCLR          REG_ACCESS(RwReg8 , 0x40001004U) /**< \brief (WDT) Interrupt Enable Clear Register */
#define REG_WDT_INTENSET          REG_ACCESS(RwReg8 , 0x40001005U) /**< \brief (WDT) Interrupt Enable Set Register */
#define REG_WDT_INTFLAG           REG_ACCESS(RwReg8 , 0x40001006U) /**< \brief (WDT) Interrupt Flag Status and Clear Register */
#define REG_WDT_STATUS            REG_ACCESS(RoReg8 , 0x40001007U) /**< \brief (WDT) Status Register */
#define REG_WDT_CLEAR             REG_ACCESS(WoReg8 , 0x40001008U) /**< \brief (WDT) Clear Register */
/* ========== Register definition for RTC peripheral ========== */
#define REG_RTC_MODE0_CTRL        REG_ACCESS(RwReg16, 0x40001400U) /**< \brief (RTC) Mode0 Control Register */
#define REG_RTC_MODE1_CTRL        REG_ACCESS(RwReg16, 0x40001400U) /**< \brief (RTC) Mode1 Control Register */
#define REG_RTC_MODE2_CTRL        REG_ACCESS(RwReg16, 0x40001400U) /**< \brief (RTC) Mode2 Control Register */
#define REG_RTC_READREQ           REG_ACCESS(RwReg16, 0x40001402U) /**< \brief (RTC) Read Request Register */
#define REG_RTC_MODE0_EVCTRL      REG_ACCESS(RwReg16, 0x40001404U) /**< \brief (RTC) Mode0 Event Control Register */
#define REG_RTC_MODE1_EVCTRL      REG_ACCESS(RwReg16, 0x40001404U) /**< \brief (RTC) Mode1 Event Control Register */
#define REG_RTC_MODE2_EVCTRL      REG_ACCESS(RwReg16, 0x40001404U) /**< \brief (RTC) Mode2 Event Control Register */
#define REG_RTC_MODE0_INTENCLR    REG_ACCESS(RwReg8 , 0x40001406U) /**< \brief (RTC) Mode0 Interrupt Enable Clear Register */
#define REG_RTC_MODE1_INTENCLR    REG_ACCESS(RwReg8 , 0x40001406U) /**< \brief (RTC) Mode1 Interrupt Enable Clear Register */
#define REG_RTC_MODE2_INTENCLR    REG_ACCESS(RwReg8 , 0x40001406U) /**< \brief (RTC) Mode2 Interrupt Enable Clear Register */
#define REG_RTC_MODE0_INTENSET    REG_ACCESS(RwReg8 , 0x40001407U) /**< \brief (RTC) Mode0 Interrupt Enable Set Register */
#define REG_RTC_MODE1_INTENSET    REG_ACCESS(RwReg8 , 0x40001407U) /**< \brief (RTC) Mode1 Interrupt Enable Set Register */
#define REG_RTC_MODE2_INTENSET    REG_ACCESS(RwReg8 , 0x40001407U) /**< \brief (RTC) Mode2 Interrupt Enable Set Register */
#define REG_RTC_MODE0_INTFLAG     REG_ACCESS(RwReg8 , 0x40001408U) /**< \brief (RTC) Mode0 Interrupt Flag Status and Clear Register */
#define REG_RTC_MODE1_INTFLAG     REG_ACCESS(RwReg8 , 0x40001408U) /**< \brief (RTC) Mode1 Interrupt Flag Status and Clear Register */
#define REG_RTC_MODE2_INTFLAG     REG_ACCESS(RwReg8 , 0x40001408U) /**< \brief (RTC) Mode2 Interrupt Flag Status and Clear Register */
#define REG_RTC_STATUS            REG_ACCESS(RwReg8 , 0x4000140AU) /**< \brief (RTC) Status Register */
#define REG_RTC_DEBUG             REG_ACCESS(RwReg8 , 0x4000140BU) /**< \brief (RTC) Debug Register */
#define REG_RTC_FREQCORR          REG_ACCESS(RwReg8 , 0x4000140CU) /**< \brief (RTC) Frequency Correction Register */
#define REG_RTC_MODE0_COUNT       REG_ACCESS(RwReg  , 0x40001410U) /**< \brief (RTC) Mode0 Count Register */
#define REG_RTC_MODE1_COUNT       REG_ACCESS(RwReg16, 0x40001410U) /**< \brief (RTC) Mode1 Count Register */
#define REG_RTC_MODE2_CLOCK       REG_ACCESS(RwReg  , 0x40001410U) /**< \brief (RTC) Mode2 Clock Register */
#define REG_RTC_MODE1_PER         REG_ACCESS(RwReg16, 0x40001414U) /**< \brief (RTC) Mode1 Period Register */
#define REG_RTC_MODE0_COMP        REG_ACCESS(RwReg  , 0x40001418U) /**< \brief (RTC) Mode0 Compare Register */
#define REG_RTC_MODE1_COMP        REG_ACCESS(RwReg16, 0x40001418U) /**< \brief (RTC) Mode1 Compare Register */
#define REG_RTC_MODE2_ALARM_ALARM REG_ACCESS(RwReg  , 0x40001418U) /**< \brief (RTC) Mode2Alarm Alarm Register */
#define REG_RTC_MODE2_ALARM_MASK  REG_ACCESS(RwReg8 , 0x4000141CU) /**< \brief (RTC) Mode2Alarm Alarm Mask Register */
/* ========== Register definition for EIC peripheral ========== */
#define REG_EIC_CTRL              REG_ACCESS(RwReg8 , 0x40001800U) /**< \brief (EIC) Control Register */
#define REG_EIC_STATUS            REG_ACCESS(RoReg8 , 0x40001801U) /**< \brief (EIC) Status Register */
#define REG_EIC_NMICTRL           REG_ACCESS(RwReg8 , 0x40001802U) /**< \brief (EIC) NMI Control Register */
#define REG_EIC_NMIFLAG           REG_ACCESS(RwReg8 , 0x40001803U) /**< \brief (EIC) NMI Interrupt Flag Register */
#define REG_EIC_EVCTRL            REG_ACCESS(RwReg  , 0x40001804U) /**< \brief (EIC) Event Control Register */
#define REG_EIC_INTENCLR          REG_ACCESS(RwReg  , 0x40001808U) /**< \brief (EIC) Interrupt Enable Clear Register */
#define REG_EIC_INTENSET          REG_ACCESS(RwReg  , 0x4000180CU) /**< \brief (EIC) Interrupt Enable Set Register */
#define REG_EIC_INTFLAG           REG_ACCESS(RwReg  , 0x40001810U) /**< \brief (EIC) Interrupt Flag Status and Clear Register */
#define REG_EIC_WAKEUP            REG_ACCESS(RwReg  , 0x40001814U) /**< \brief (EIC) Wake-up Enable Register */
#define REG_EIC_CONFIG            REG_ACCESS(RwReg  , 0x40001818U) /**< \brief (EIC) Config Register */
/* ========== Register definition for PAC1 peripheral ========== */
#define REG_PAC1_WPCLR            REG_ACCESS(RwReg  , 0x41000000U) /**< \brief (PAC1) Write Protection Clear Register */
#define REG_PAC1_WPSET            REG_ACCESS(RwReg  , 0x41000004U) /**< \brief (PAC1) Write Protection Set Register */
/* ========== Register definition for DSU peripheral ========== */
#define REG_DSU_CTRL              REG_ACCESS(WoReg8 , 0x41002000U) /**< \brief (DSU) Control Register */
#define REG_DSU_STATUSA           REG_ACCESS(RwReg8 , 0x41002001U) /**< \brief (DSU) Status Register A */
#define REG_DSU_STATUSB           REG_ACCESS(RoReg8 , 0x41002002U) /**< \brief (DSU) Status Register B */
#define REG_DSU_STATUSC           REG_ACCESS(RoReg8 , 0x41002003U) /**< \brief (DSU) Status Register C */
#define REG_DSU_ADDR              REG_ACCESS(RwReg  , 0x41002004U) /**< \brief (DSU) Address Register */
#define REG_DSU_LENGTH            REG_ACCESS(RwReg  , 0x41002008U) /**< \brief (DSU) Length Register */
#define REG_DSU_DATA              REG_ACCESS(RwReg  , 0x4100200CU) /**< \brief (DSU) Data Register */
#define REG_DSU_DCC               REG_ACCESS(RwReg  , 0x41002010U) /**< \brief (DSU) Debug Communication Channel Register */
#define REG_DSU_DID               REG_ACCESS(RoReg  , 0x41002018U) /**< \brief (DSU) Device Identification Register */
#define REG_DSU_DCFG              REG_ACCESS(RwReg  , 0x410020F0U) /**< \brief (DSU) Device Configuration Register */
#define REG_DSU_UPTM              REG_ACCESS(RwReg  , 0x410020F8U) /**< \brief (DSU) UnProtected Test Mode Register */
#define REG_DSU_TESTMODE          REG_ACCESS(RwReg  , 0x410020FCU) /**< \brief (DSU) Test Mode Register */
#define REG_DSU_ENTRY             REG_ACCESS(RoReg  , 0x41003000U) /**< \brief (DSU) CoreSight ROM Table Entry Register */
#define REG_DSU_END               REG_ACCESS(RoReg  , 0x41003008U) /**< \brief (DSU) CoreSight ROM Table End Register */
#define REG_DSU_MEMTYPE           REG_ACCESS(RoReg  , 0x41003FCCU) /**< \brief (DSU) CoreSight ROM Table Memory Type Register */
#define REG_DSU_PID4              REG_ACCESS(RoReg  , 0x41003FD0U) /**< \brief (DSU) Peripheral Identification Register 4 */
#define REG_DSU_PID5              REG_ACCESS(RoReg  , 0x41003FD4U) /**< \brief (DSU) Peripheral Identification Register 5 */
#define REG_DSU_PID6              REG_ACCESS(RoReg  , 0x41003FD8U) /**< \brief (DSU) Peripheral Identification Register 6 */
#define REG_DSU_PID7              REG_ACCESS(RoReg  , 0x41003FDCU) /**< \brief (DSU) Peripheral Identification Register 7 */
#define REG_DSU_PID0              REG_ACCESS(RoReg  , 0x41003FE0U) /**< \brief (DSU) Peripheral Identification Register 0 */
#define REG_DSU_PID1              REG_ACCESS(RoReg  , 0x41003FE4U) /**< \brief (DSU) Peripheral Identification Register 1 */
#define REG_DSU_PID2              REG_ACCESS(RoReg  , 0x41003FE8U) /**< \brief (DSU) Peripheral Identification Register 2 */
#define REG_DSU_PID3              REG_ACCESS(RoReg  , 0x41003FECU) /**< \brief (DSU) Peripheral Identification Register 3 */
#define REG_DSU_CID0              REG_ACCESS(RoReg  , 0x41003FF0U) /**< \brief (DSU) Component Identification Register 0 */
#define REG_DSU_CID1              REG_ACCESS(RoReg  , 0x41003FF4U) /**< \brief (DSU) Component Identification Register 1 */
#define REG_DSU_CID2              REG_ACCESS(RoReg  , 0x41003FF8U) /**< \brief (DSU) Component Identification Register 2 */
#define REG_DSU_CID3              REG_ACCESS(RoReg  , 0x41003FFCU) /**< \brief (DSU) Component Identification Register 3 */
/* ========== Register definition for NVMCTRL peripheral ========== */
#define REG_NVMCTRL_CTRLA         REG_ACCESS(RwReg  , 0x41004000U) /**< \brief (NVMCTRL) NVM Control Register A */
#define REG_NVMCTRL_CTRLB         REG_ACCESS(RwReg  , 0x41004004U) /**< \brief (NVMCTRL) NVM Control Register B */
#define REG_NVMCTRL_PARAM         REG_ACCESS(RwReg  , 0x41004008U) /**< \brief (NVMCTRL) Parameter Register */
#define REG_NVMCTRL_INTENCLR      REG_ACCESS(RwReg8 , 0x4100400CU) /**< \brief (NVMCTRL) Interrupt Enable Clear Register */
#define REG_NVMCTRL_INTENSET      REG_ACCESS(RwReg8 , 0x41004010U) /**< \brief (NVMCTRL) Interrupt Enable Set Register */
#define REG_NVMCTRL_INTFLAG       REG_ACCESS(RwReg8 , 0x41004014U) /**< \brief (NVMCTRL) Interrupt Flag Status and Clear Register */
#define REG_NVMCTRL_STATUS        REG_ACCESS(RwReg  , 0x41004018U) /**< \brief (NVMCTRL) Status Register */
#define REG_NVMCTRL_ADDR          REG_ACCESS(RwReg  , 0x4100401CU) /**< \brief (NVMCTRL) Address Register */
#define REG_NVMCTRL_LOCK          REG_ACCESS(RwReg  , 0x41004020U) /**< \brief (NVMCTRL) Lock Register */
/* ========== Register definition for PORT peripheral ========== */
#define REG_PORT_DIR0             REG_ACCESS(RwReg  , 0x41004400U) /**< \brief (PORT) Data Direction Register 0 */
#define REG_PORT_DIRCLR0          REG_ACCESS(RwReg  , 0x41004404U) /**< \brief (PORT) Data Direction Clear Register 0 */
#define REG_PORT_DIRSET0          REG_ACCESS(RwReg  , 0x41004408U) /**< \brief (PORT) Data Direction Set Register 0 */
#define REG_PORT_DIRTGL0          REG_ACCESS(RwReg  , 0x4100440CU) /**< \brief (PORT) Data Direction Toggle Register 0 */
#define REG_PORT_OUT0             REG_ACCESS(RwReg  , 0x41004410U) /**< \brief (PORT) Data Output Value Register 0 */
#define REG_PORT_OUTCLR0          REG_ACCESS(RwReg  , 0x41004414U) /**< \brief (PORT) Data Output Value Clear Register 0 */
#define REG_PORT_OUTSET0          REG_ACCESS(RwReg  , 0x41004418U) /**< \brief (PORT) Data Output Value Set Register 0 */
#define REG_PORT_OUTTGL0          REG_ACCESS(RwReg  , 0x4100441CU) /**< \brief (PORT) Data Output Value Toggle Register 0 */
#define REG_PORT_IN0              REG_ACCESS(RoReg  , 0x41004420U) /**< \brief (PORT) Data Input Value Register 0 */
#define REG_PORT_CTRL0            REG_ACCESS(RwReg  , 0x41004424U) /**< \brief (PORT) Control Register 0 */
#define REG_PORT_WRCONFIG0        REG_ACCESS(WoReg  , 0x41004428U) /**< \brief (PORT) Write Configuration Register 0 */
#define REG_PORT_PMUX0            REG_ACCESS(RwReg  , 0x41004430U) /**< \brief (PORT) Peripheral Multiplexing Register 0 */
#define REG_PORT_PINCFG0          REG_ACCESS(RwReg  , 0x41004440U) /**< \brief (PORT) Pin Configuration Register 0 */
#define REG_PORT_DIR1             REG_ACCESS(RwReg  , 0x41004480U) /**< \brief (PORT) Data Direction Register 1 */
#define REG_PORT_DIRCLR1          REG_ACCESS(RwReg  , 0x41004484U) /**< \brief (PORT) Data Direction Clear Register 1 */
#define REG_PORT_DIRSET1          REG_ACCESS(RwReg  , 0x41004488U) /**< \brief (PORT) Data Direction Set Register 1 */
#define REG_PORT_DIRTGL1          REG_ACCESS(RwReg  , 0x4100448CU) /**< \brief (PORT) Data Direction Toggle Register 1 */
#define REG_PORT_OUT1             REG_ACCESS(RwReg  , 0x41004490U) /**< \brief (PORT) Data Output Value Register 1 */
#define REG_PORT_OUTCLR1          REG_ACCESS(RwReg  , 0x41004494U) /**< \brief (PORT) Data Output Value Clear Register 1 */
#define REG_PORT_OUTSET1          REG_ACCESS(RwReg  , 0x41004498U) /**< \brief (PORT) Data Output Value Set Register 1 */
#define REG_PORT_OUTTGL1          REG_ACCESS(RwReg  , 0x4100449CU) /**< \brief (PORT) Data Output Value Toggle Register 1 */
#define REG_PORT_IN1              REG_ACCESS(RoReg  , 0x410044A0U) /**< \brief (PORT) Data Input Value Register 1 */
#define REG_PORT_CTRL1            REG_ACCESS(RwReg  , 0x410044A4U) /**< \brief (PORT) Control Register 1 */
#define REG_PORT_WRCONFIG1        REG_ACCESS(WoReg  , 0x410044A8U) /**< \brief (PORT) Write Configuration Register 1 */
#define REG_PORT_PMUX1            REG_ACCESS(RwReg  , 0x410044B0U) /**< \brief (PORT) Peripheral Multiplexing Register 1 */
#define REG_PORT_PINCFG1          REG_ACCESS(RwReg  , 0x410044C0U) /**< \brief (PORT) Pin Configuration Register 1 */
/* ========== Register definition for HMATRIX peripheral ========== */
