zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define REG_HMATRIX_MCFG          REG_ACCESS(RwReg  , 0x41004800U) /**< \brief (HMATRIX) Master Configuration Register */
#define REG_HMATRIX_SCFG          REG_ACCESS(RwReg  , 0x41004840U) /**< \brief (HMATRIX) Slave Configuration Register */
#define REG_HMATRIX_PRAS0         REG_ACCESS(RwReg  , 0x41004880U) /**< \brief (HMATRIX) Priority Register A for Slave 0 */
#define REG_HMATRIX_PRBS0         REG_ACCESS(RwReg  , 0x41004884U) /**< \brief (HMATRIX) Priority Register B for Slave 0 */
#define REG_HMATRIX_PRAS1         REG_ACCESS(RwReg  , 0x41004888U) /**< \brief (HMATRIX) Priority Register A for Slave 1 */
#define REG_HMATRIX_PRBS1         REG_ACCESS(RwReg  , 0x4100488CU) /**< \brief (HMATRIX) Priority Register B for Slave 1 */
#define REG_HMATRIX_PRAS2         REG_ACCESS(RwReg  , 0x41004890U) /**< \brief (HMATRIX) Priority Register A for Slave 2 */
#define REG_HMATRIX_PRBS2         REG_ACCESS(RwReg  , 0x41004894U) /**< \brief (HMATRIX) Priority Register B for Slave 2 */
#define REG_HMATRIX_PRAS3         REG_ACCESS(RwReg  , 0x41004898U) /**< \brief (HMATRIX) Priority Register A for Slave 3 */
#define REG_HMATRIX_PRBS3         REG_ACCESS(RwReg  , 0x4100489CU) /**< \brief (HMATRIX) Priority Register B for Slave 3 */
#define REG_HMATRIX_PRAS4         REG_ACCESS(RwReg  , 0x410048A0U) /**< \brief (HMATRIX) Priority Register A for Slave 4 */
#define REG_HMATRIX_PRBS4         REG_ACCESS(RwReg  , 0x410048A4U) /**< \brief (HMATRIX) Priority Register B for Slave 4 */
#define REG_HMATRIX_PRAS5         REG_ACCESS(RwReg  , 0x410048A8U) /**< \brief (HMATRIX) Priority Register A for Slave 5 */
#define REG_HMATRIX_PRBS5         REG_ACCESS(RwReg  , 0x410048ACU) /**< \brief (HMATRIX) Priority Register B for Slave 5 */
#define REG_HMATRIX_PRAS6         REG_ACCESS(RwReg  , 0x410048B0U) /**< \brief (HMATRIX) Priority Register A for Slave 6 */
#define REG_HMATRIX_PRBS6         REG_ACCESS(RwReg  , 0x410048B4U) /**< \brief (HMATRIX) Priority Register B for Slave 6 */
#define REG_HMATRIX_PRAS7         REG_ACCESS(RwReg  , 0x410048B8U) /**< \brief (HMATRIX) Priority Register A for Slave 7 */
#define REG_HMATRIX_PRBS7         REG_ACCESS(RwReg  , 0x410048BCU) /**< \brief (HMATRIX) Priority Register B for Slave 7 */
#define REG_HMATRIX_PRAS8         REG_ACCESS(RwReg  , 0x410048C0U) /**< \brief (HMATRIX) Priority Register A for Slave 8 */
#define REG_HMATRIX_PRBS8         REG_ACCESS(RwReg  , 0x410048C4U) /**< \brief (HMATRIX) Priority Register B for Slave 8 */
#define REG_HMATRIX_PRAS9         REG_ACCESS(RwReg  , 0x410048C8U) /**< \brief (HMATRIX) Priority Register A for Slave 9 */
#define REG_HMATRIX_PRBS9         REG_ACCESS(RwReg  , 0x410048CCU) /**< \brief (HMATRIX) Priority Register B for Slave 9 */
#define REG_HMATRIX_PRAS10        REG_ACCESS(RwReg  , 0x410048D0U) /**< \brief (HMATRIX) Priority Register A for Slave 10 */
#define REG_HMATRIX_PRBS10        REG_ACCESS(RwReg  , 0x410048D4U) /**< \brief (HMATRIX) Priority Register B for Slave 10 */
#define REG_HMATRIX_PRAS11        REG_ACCESS(RwReg  , 0x410048D8U) /**< \brief (HMATRIX) Priority Register A for Slave 11 */
#define REG_HMATRIX_PRBS11        REG_ACCESS(RwReg  , 0x410048DCU) /**< \brief (HMATRIX) Priority Register B for Slave 11 */
#define REG_HMATRIX_PRAS12        REG_ACCESS(RwReg  , 0x410048E0U) /**< \brief (HMATRIX) Priority Register A for Slave 12 */
#define REG_HMATRIX_PRBS12        REG_ACCESS(RwReg  , 0x410048E4U) /**< \brief (HMATRIX) Priority Register B for Slave 12 */
#define REG_HMATRIX_PRAS13        REG_ACCESS(RwReg  , 0x410048E8U) /**< \brief (HMATRIX) Priority Register A for Slave 13 */
#define REG_HMATRIX_PRBS13        REG_ACCESS(RwReg  , 0x410048ECU) /**< \brief (HMATRIX) Priority Register B for Slave 13 */
#define REG_HMATRIX_PRAS14        REG_ACCESS(RwReg  , 0x410048F0U) /**< \brief (HMATRIX) Priority Register A for Slave 14 */
#define REG_HMATRIX_PRBS14        REG_ACCESS(RwReg  , 0x410048F4U) /**< \brief (HMATRIX) Priority Register B for Slave 14 */
#define REG_HMATRIX_PRAS15        REG_ACCESS(RwReg  , 0x410048F8U) /**< \brief (HMATRIX) Priority Register A for Slave 15 */
#define REG_HMATRIX_PRBS15        REG_ACCESS(RwReg  , 0x410048FCU) /**< \brief (HMATRIX) Priority Register B for Slave 15 */
#define REG_HMATRIX_MRCR          REG_ACCESS(RwReg  , 0x41004900U) /**< \brief (HMATRIX) Master Remap Control Register */
#define REG_HMATRIX_SFR           REG_ACCESS(RwReg  , 0x41004910U) /**< \brief (HMATRIX) Special Function Register */
/* ========== Register definition for PAC2 peripheral ========== */
#define REG_PAC2_WPCLR            REG_ACCESS(RwReg  , 0x42000000U) /**< \brief (PAC2) Write Protection Clear Register */
#define REG_PAC2_WPSET            REG_ACCESS(RwReg  , 0x42000004U) /**< \brief (PAC2) Write Protection Set Register */
/* ========== Register definition for EVSYS peripheral ========== */
#define REG_EVSYS_CTRL            REG_ACCESS(WoReg8 , 0x42000400U) /**< \brief (EVSYS) Control Register */
#define REG_EVSYS_CHANNEL         REG_ACCESS(RwReg  , 0x42000404U) /**< \brief (EVSYS) Channel Register */
#define REG_EVSYS_USERMUX         REG_ACCESS(RwReg16, 0x42000408U) /**< \brief (EVSYS) User Mux Register */
#define REG_EVSYS_CHSTATUS        REG_ACCESS(RoReg  , 0x4200040CU) /**< \brief (EVSYS) Channel Status Register */
#define REG_EVSYS_INTENCLR        REG_ACCESS(RwReg  , 0x42000410U) /**< \brief (EVSYS) Interrupt Enable Clear Register */
#define REG_EVSYS_INTENSET        REG_ACCESS(RwReg  , 0x42000414U) /**< \brief (EVSYS) Interrupt Enable Set Register */
#define REG_EVSYS_INTFLAG         REG_ACCESS(RwReg  , 0x42000418U) /**< \brief (EVSYS) Interrupt Flag Status and Clear Register */
/* ========== Register definition for SERCOM0 peripheral ========== */
#define REG_SERCOM0_I2CM_CTRLA    REG_ACCESS(RwReg  , 0x42000800U) /**< \brief (SERCOM0) I2cm Control Register A */
#define REG_SERCOM0_I2CS_CTRLA    REG_ACCESS(RwReg  , 0x42000800U) /**< \brief (SERCOM0) I2cs Control Register A */
#define REG_SERCOM0_SPI_CTRLA     REG_ACCESS(RwReg  , 0x42000800U) /**< \brief (SERCOM0) Spi SPI Control Register A */
#define REG_SERCOM0_USART_CTRLA   REG_ACCESS(RwReg  , 0x42000800U) /**< \brief (SERCOM0) Usart USART Control Register A */
#define REG_SERCOM0_I2CM_CTRLB    REG_ACCESS(RwReg  , 0x42000804U) /**< \brief (SERCOM0) I2cm Control Register B */
#define REG_SERCOM0_I2CS_CTRLB    REG_ACCESS(RwReg  , 0x42000804U) /**< \brief (SERCOM0) I2cs Control Register B */
#define REG_SERCOM0_SPI_CTRLB     REG_ACCESS(RwReg  , 0x42000804U) /**< \brief (SERCOM0) Spi SPI Control Register B */
#define REG_SERCOM0_USART_CTRLB   REG_ACCESS(RwReg  , 0x42000804U) /**< \brief (SERCOM0) Usart USART Control Register B */
#define REG_SERCOM0_I2CM_DEBUG    REG_ACCESS(RwReg8 , 0x42000808U) /**< \brief (SERCOM0) I2cm Debug Register */
#define REG_SERCOM0_I2CS_DEBUG    REG_ACCESS(RwReg8 , 0x42000808U) /**< \brief (SERCOM0) I2cs Debug Register */
#define REG_SERCOM0_SPI_DEBUG     REG_ACCESS(RwReg8 , 0x42000808U) /**< \brief (SERCOM0) Spi SPI Debug Register */
#define REG_SERCOM0_USART_DEBUG   REG_ACCESS(RwReg8 , 0x42000808U) /**< \brief (SERCOM0) Usart USART Debug Register */
#define REG_SERCOM0_I2CM_BAUD     REG_ACCESS(RwReg16, 0x4200080AU) /**< \brief (SERCOM0) I2cm Baud Rate Register */
#define REG_SERCOM0_SPI_BAUD      REG_ACCESS(RwReg16, 0x4200080AU) /**< \brief (SERCOM0) Spi SPI Baud Rate Register */
#define REG_SERCOM0_USART_BAUD    REG_ACCESS(RwReg16, 0x4200080AU) /**< \brief (SERCOM0) Usart USART Baud Rate Register */
#define REG_SERCOM0_I2CM_INTENCLR REG_ACCESS(RwReg8 , 0x4200080CU) /**< \brief (SERCOM0) I2cm Interrupt Enable Clear Register */
#define REG_SERCOM0_I2CS_INTENCLR REG_ACCESS(RwReg8 , 0x4200080CU) /**< \brief (SERCOM0) I2cs Interrupt Enable Clear Register */
#define REG_SERCOM0_SPI_INTENCLR  REG_ACCESS(RwReg8 , 0x4200080CU) /**< \brief (SERCOM0) Spi SPI Interrupt Enable Clear Register */
#define REG_SERCOM0_USART_INTENCLR REG_ACCESS(RwReg8 , 0x4200080CU) /**< \brief (SERCOM0) Usart USART Interrupt Enable Clear Register */
#define REG_SERCOM0_I2CM_INTENSET REG_ACCESS(RwReg8 , 0x4200080DU) /**< \brief (SERCOM0) I2cm Interrupt Enable Set Register */
#define REG_SERCOM0_I2CS_INTENSET REG_ACCESS(RwReg8 , 0x4200080DU) /**< \brief (SERCOM0) I2cs Interrupt Enable Set Register */
#define REG_SERCOM0_SPI_INTENSET  REG_ACCESS(RwReg8 , 0x4200080DU) /**< \brief (SERCOM0) Spi SPI Interrupt Enable Set Register */
#define REG_SERCOM0_USART_INTENSET REG_ACCESS(RwReg8 , 0x4200080DU) /**< \brief (SERCOM0) Usart USART Interrupt Enable Set Register */
#define REG_SERCOM0_I2CM_INTFLAG  REG_ACCESS(RwReg8 , 0x4200080EU) /**< \brief (SERCOM0) I2cm Interrupt Flag Status and Clear Register */
#define REG_SERCOM0_I2CS_INTFLAG  REG_ACCESS(RwReg8 , 0x4200080EU) /**< \brief (SERCOM0) I2cs Interrupt Flag Status and Clear Register */
#define REG_SERCOM0_SPI_INTFLAG   REG_ACCESS(RwReg8 , 0x4200080EU) /**< \brief (SERCOM0) Spi SPI Interrupt Flag Status and Clear Register */
#define REG_SERCOM0_USART_INTFLAG REG_ACCESS(RwReg8 , 0x4200080EU) /**< \brief (SERCOM0) Usart USART Interrupt Flag Status and Clear Register */
#define REG_SERCOM0_I2CM_STATUS   REG_ACCESS(RwReg  , 0x42000810U) /**< \brief (SERCOM0) I2cm Status Register */
#define REG_SERCOM0_I2CS_STATUS   REG_ACCESS(RwReg  , 0x42000810U) /**< \brief (SERCOM0) I2cs Status Register */
#define REG_SERCOM0_SPI_STATUS    REG_ACCESS(RwReg  , 0x42000810U) /**< \brief (SERCOM0) Spi SPI Status Register */
#define REG_SERCOM0_USART_STATUS  REG_ACCESS(RwReg  , 0x42000810U) /**< \brief (SERCOM0) Usart USART Status Register */
#define REG_SERCOM0_I2CM_ADDR     REG_ACCESS(RwReg  , 0x42000814U) /**< \brief (SERCOM0) I2cm Address Register */
#define REG_SERCOM0_I2CS_ADDR     REG_ACCESS(RwReg  , 0x42000814U) /**< \brief (SERCOM0) I2cs Address Register */
#define REG_SERCOM0_SPI_ADDR      REG_ACCESS(RwReg  , 0x42000814U) /**< \brief (SERCOM0) Spi SPI Address Register */
#define REG_SERCOM0_I2CM_DATA     REG_ACCESS(RwReg  , 0x42000818U) /**< \brief (SERCOM0) I2cm Data Register */
#define REG_SERCOM0_I2CS_DATA     REG_ACCESS(RwReg  , 0x42000818U) /**< \brief (SERCOM0) I2cs Data Register */
#define REG_SERCOM0_SPI_DATA      REG_ACCESS(RwReg  , 0x42000818U) /**< \brief (SERCOM0) Spi SPI Data Register */
#define REG_SERCOM0_USART_DATA    REG_ACCESS(RwReg  , 0x42000818U) /**< \brief (SERCOM0) Usart USART Data Register */
/* ========== Register definition for SERCOM1 peripheral ========== */
#define REG_SERCOM1_I2CM_CTRLA    REG_ACCESS(RwReg  , 0x42000C00U) /**< \brief (SERCOM1) I2cm Control Register A */
#define REG_SERCOM1_I2CS_CTRLA    REG_ACCESS(RwReg  , 0x42000C00U) /**< \brief (SERCOM1) I2cs Control Register A */
#define REG_SERCOM1_SPI_CTRLA     REG_ACCESS(RwReg  , 0x42000C00U) /**< \brief (SERCOM1) Spi SPI Control Register A */
#define REG_SERCOM1_USART_CTRLA   REG_ACCESS(RwReg  , 0x42000C00U) /**< \brief (SERCOM1) Usart USART Control Register A */
#define REG_SERCOM1_I2CM_CTRLB    REG_ACCESS(RwReg  , 0x42000C04U) /**< \brief (SERCOM1) I2cm Control Register B */
#define REG_SERCOM1_I2CS_CTRLB    REG_ACCESS(RwReg  , 0x42000C04U) /**< \brief (SERCOM1) I2cs Control Register B */
#define REG_SERCOM1_SPI_CTRLB     REG_ACCESS(RwReg  , 0x42000C04U) /**< \brief (SERCOM1) Spi SPI Control Register B */
#define REG_SERCOM1_USART_CTRLB   REG_ACCESS(RwReg  , 0x42000C04U) /**< \brief (SERCOM1) Usart USART Control Register B */
#define REG_SERCOM1_I2CM_DEBUG    REG_ACCESS(RwReg8 , 0x42000C08U) /**< \brief (SERCOM1) I2cm Debug Register */
#define REG_SERCOM1_I2CS_DEBUG    REG_ACCESS(RwReg8 , 0x42000C08U) /**< \brief (SERCOM1) I2cs Debug Register */
#define REG_SERCOM1_SPI_DEBUG     REG_ACCESS(RwReg8 , 0x42000C08U) /**< \brief (SERCOM1) Spi SPI Debug Register */
#define REG_SERCOM1_USART_DEBUG   REG_ACCESS(RwReg8 , 0x42000C08U) /**< \brief (SERCOM1) Usart USART Debug Register */
#define REG_SERCOM1_I2CM_BAUD     REG_ACCESS(RwReg16, 0x42000C0AU) /**< \brief (SERCOM1) I2cm Baud Rate Register */
#define REG_SERCOM1_SPI_BAUD      REG_ACCESS(RwReg16, 0x42000C0AU) /**< \brief (SERCOM1) Spi SPI Baud Rate Register */
#define REG_SERCOM1_USART_BAUD    REG_ACCESS(RwReg16, 0x42000C0AU) /**< \brief (SERCOM1) Usart USART Baud Rate Register */
#define REG_SERCOM1_I2CM_INTENCLR REG_ACCESS(RwReg8 , 0x42000C0CU) /**< \brief (SERCOM1) I2cm Interrupt Enable Clear Register */
#define REG_SERCOM1_I2CS_INTENCLR REG_ACCESS(RwReg8 , 0x42000C0CU) /**< \brief (SERCOM1) I2cs Interrupt Enable Clear Register */
#define REG_SERCOM1_SPI_INTENCLR  REG_ACCESS(RwReg8 , 0x42000C0CU) /**< \brief (SERCOM1) Spi SPI Interrupt Enable Clear Register */
#define REG_SERCOM1_USART_INTENCLR REG_ACCESS(RwReg8 , 0x42000C0CU) /**< \brief (SERCOM1) Usart USART Interrupt Enable Clear Register */
#define REG_SERCOM1_I2CM_INTENSET REG_ACCESS(RwReg8 , 0x42000C0DU) /**< \brief (SERCOM1) I2cm Interrupt Enable Set Register */
#define REG_SERCOM1_I2CS_INTENSET REG_ACCESS(RwReg8 , 0x42000C0DU) /**< \brief (SERCOM1) I2cs Interrupt Enable Set Register */
#define REG_SERCOM1_SPI_INTENSET  REG_ACCESS(RwReg8 , 0x42000C0DU) /**< \brief (SERCOM1) Spi SPI Interrupt Enable Set Register */
#define REG_SERCOM1_USART_INTENSET REG_ACCESS(RwReg8 , 0x42000C0DU) /**< \brief (SERCOM1) Usart USART Interrupt Enable Set Register */
#define REG_SERCOM1_I2CM_INTFLAG  REG_ACCESS(RwReg8 , 0x42000C0EU) /**< \brief (SERCOM1) I2cm Interrupt Flag Status and Clear Register */
#define REG_SERCOM1_I2CS_INTFLAG  REG_ACCESS(RwReg8 , 0x42000C0EU) /**< \brief (SERCOM1) I2cs Interrupt Flag Status and Clear Register */
#define REG_SERCOM1_SPI_INTFLAG   REG_ACCESS(RwReg8 , 0x42000C0EU) /**< \brief (SERCOM1) Spi SPI Interrupt Flag Status and Clear Register */
#define REG_SERCOM1_USART_INTFLAG REG_ACCESS(RwReg8 , 0x42000C0EU) /**< \brief (SERCOM1) Usart USART Interrupt Flag Status and Clear Register */
#define REG_SERCOM1_I2CM_STATUS   REG_ACCESS(RwReg  , 0x42000C10U) /**< \brief (SERCOM1) I2cm Status Register */
#define REG_SERCOM1_I2CS_STATUS   REG_ACCESS(RwReg  , 0x42000C10U) /**< \brief (SERCOM1) I2cs Status Register */
#define REG_SERCOM1_SPI_STATUS    REG_ACCESS(RwReg  , 0x42000C10U) /**< \brief (SERCOM1) Spi SPI Status Register */
#define REG_SERCOM1_USART_STATUS  REG_ACCESS(RwReg  , 0x42000C10U) /**< \brief (SERCOM1) Usart USART Status Register */
#define REG_SERCOM1_I2CM_ADDR     REG_ACCESS(RwReg  , 0x42000C14U) /**< \brief (SERCOM1) I2cm Address Register */
#define REG_SERCOM1_I2CS_ADDR     REG_ACCESS(RwReg  , 0x42000C14U) /**< \brief (SERCOM1) I2cs Address Register */
#define REG_SERCOM1_SPI_ADDR      REG_ACCESS(RwReg  , 0x42000C14U) /**< \brief (SERCOM1) Spi SPI Address Register */
#define REG_SERCOM1_I2CM_DATA     REG_ACCESS(RwReg  , 0x42000C18U) /**< \brief (SERCOM1) I2cm Data Register */
#define REG_SERCOM1_I2CS_DATA     REG_ACCESS(RwReg  , 0x42000C18U) /**< \brief (SERCOM1) I2cs Data Register */
#define REG_SERCOM1_SPI_DATA      REG_ACCESS(RwReg  , 0x42000C18U) /**< \brief (SERCOM1) Spi SPI Data Register */
#define REG_SERCOM1_USART_DATA    REG_ACCESS(RwReg  , 0x42000C18U) /**< \brief (SERCOM1) Usart USART Data Register */
/* ========== Register definition for SERCOM2 peripheral ========== */
#define REG_SERCOM2_I2CM_CTRLA    REG_ACCESS(RwReg  , 0x42001000U) /**< \brief (SERCOM2) I2cm Control Register A */
#define REG_SERCOM2_I2CS_CTRLA    REG_ACCESS(RwReg  , 0x42001000U) /**< \brief (SERCOM2) I2cs Control Register A */
#define REG_SERCOM2_SPI_CTRLA     REG_ACCESS(RwReg  , 0x42001000U) /**< \brief (SERCOM2) Spi SPI Control Register A */
#define REG_SERCOM2_USART_CTRLA   REG_ACCESS(RwReg  , 0x42001000U) /**< \brief (SERCOM2) Usart USART Control Register A */
#define REG_SERCOM2_I2CM_CTRLB    REG_ACCESS(RwReg  , 0x42001004U) /**< \brief (SERCOM2) I2cm Control Register B */
#define REG_SERCOM2_I2CS_CTRLB    REG_ACCESS(RwReg  , 0x42001004U) /**< \brief (SERCOM2) I2cs Control Register B */
#define REG_SERCOM2_SPI_CTRLB     REG_ACCESS(RwReg  , 0x42001004U) /**< \brief (SERCOM2) Spi SPI Control Register B */
#define REG_SERCOM2_USART_CTRLB   REG_ACCESS(RwReg  , 0x42001004U) /**< \brief (SERCOM2) Usart USART Control Register B */
#define REG_SERCOM2_I2CM_DEBUG    REG_ACCESS(RwReg8 , 0x42001008U) /**< \brief (SERCOM2) I2cm Debug Register */
#define REG_SERCOM2_I2CS_DEBUG    REG_ACCESS(RwReg8 , 0x42001008U) /**< \brief (SERCOM2) I2cs Debug Register */
#define REG_SERCOM2_SPI_DEBUG     REG_ACCESS(RwReg8 , 0x42001008U) /**< \brief (SERCOM2) Spi SPI Debug Register */
#define REG_SERCOM2_USART_DEBUG   REG_ACCESS(RwReg8 , 0x42001008U) /**< \brief (SERCOM2) Usart USART Debug Register */
#define REG_SERCOM2_I2CM_BAUD     REG_ACCESS(RwReg16, 0x4200100AU) /**< \brief (SERCOM2) I2cm Baud Rate Register */
#define REG_SERCOM2_SPI_BAUD      REG_ACCESS(RwReg16, 0x4200100AU) /**< \brief (SERCOM2) Spi SPI Baud Rate Register */
#define REG_SERCOM2_USART_BAUD    REG_ACCESS(RwReg16, 0x4200100AU) /**< \brief (SERCOM2) Usart USART Baud Rate Register */
#define REG_SERCOM2_I2CM_INTENCLR REG_ACCESS(RwReg8 , 0x4200100CU) /**< \brief (SERCOM2) I2cm Interrupt Enable Clear Register */
#define REG_SERCOM2_I2CS_INTENCLR REG_ACCESS(RwReg8 , 0x4200100CU) /**< \brief (SERCOM2) I2cs Interrupt Enable Clear Register */
#define REG_SERCOM2_SPI_INTENCLR  REG_ACCESS(RwReg8 , 0x4200100CU) /**< \brief (SERCOM2) Spi SPI Interrupt Enable Clear Register */
#define REG_SERCOM2_USART_INTENCLR REG_ACCESS(RwReg8 , 0x4200100CU) /**< \brief (SERCOM2) Usart USART Interrupt Enable Clear Register */
#define REG_SERCOM2_I2CM_INTENSET REG_ACCESS(RwReg8 , 0x4200100DU) /**< \brief (SERCOM2) I2cm Interrupt Enable Set Register */
#define REG_SERCOM2_I2CS_INTENSET REG_ACCESS(RwReg8 , 0x4200100DU) /**< \brief (SERCOM2) I2cs Interrupt Enable Set Register */
#define REG_SERCOM2_SPI_INTENSET  REG_ACCESS(RwReg8 , 0x4200100DU) /**< \brief (SERCOM2) Spi SPI Interrupt Enable Set Register */
#define REG_SERCOM2_USART_INTENSET REG_ACCESS(RwReg8 , 0x4200100DU) /**< \brief (SERCOM2) Usart USART Interrupt Enable Set Register */
#define REG_SERCOM2_I2CM_INTFLAG  REG_ACCESS(RwReg8 , 0x4200100EU) /**< \brief (SERCOM2) I2cm Interrupt Flag Status and Clear Register */
#define REG_SERCOM2_I2CS_INTFLAG  REG_ACCESS(RwReg8 , 0x4200100EU) /**< \brief (SERCOM2) I2cs Interrupt Flag Status and Clear Register */
#define REG_SERCOM2_SPI_INTFLAG   REG_ACCESS(RwReg8 , 0x4200100EU) /**< \brief (SERCOM2) Spi SPI Interrupt Flag Status and Clear Register */
#define REG_SERCOM2_USART_INTFLAG REG_ACCESS(RwReg8 , 0x4200100EU) /**< \brief (SERCOM2) Usart USART Interrupt Flag Status and Clear Register */
#define REG_SERCOM2_I2CM_STATUS   REG_ACCESS(RwReg  , 0x42001010U) /**< \brief (SERCOM2) I2cm Status Register */
#define REG_SERCOM2_I2CS_STATUS   REG_ACCESS(RwReg  , 0x42001010U) /**< \brief (SERCOM2) I2cs Status Register */
#define REG_SERCOM2_SPI_STATUS    REG_ACCESS(RwReg  , 0x42001010U) /**< \brief (SERCOM2) Spi SPI Status Register */
#define REG_SERCOM2_USART_STATUS  REG_ACCESS(RwReg  , 0x42001010U) /**< \brief (SERCOM2) Usart USART Status Register */
#define REG_SERCOM2_I2CM_ADDR     REG_ACCESS(RwReg  , 0x42001014U) /**< \brief (SERCOM2) I2cm Address Register */
#define REG_SERCOM2_I2CS_ADDR     REG_ACCESS(RwReg  , 0x42001014U) /**< \brief (SERCOM2) I2cs Address Register */
#define REG_SERCOM2_SPI_ADDR      REG_ACCESS(RwReg  , 0x42001014U) /**< \brief (SERCOM2) Spi SPI Address Register */
#define REG_SERCOM2_I2CM_DATA     REG_ACCESS(RwReg  , 0x42001018U) /**< \brief (SERCOM2) I2cm Data Register */
#define REG_SERCOM2_I2CS_DATA     REG_ACCESS(RwReg  , 0x42001018U) /**< \brief (SERCOM2) I2cs Data Register */
#define REG_SERCOM2_SPI_DATA      REG_ACCESS(RwReg  , 0x42001018U) /**< \brief (SERCOM2) Spi SPI Data Register */
#define REG_SERCOM2_USART_DATA    REG_ACCESS(RwReg  , 0x42001018U) /**< \brief (SERCOM2) Usart USART Data Register */
/* ========== Register definition for SERCOM3 peripheral ========== */
#define REG_SERCOM3_I2CM_CTRLA    REG_ACCESS(RwReg  , 0x42001400U) /**< \brief (SERCOM3) I2cm Control Register A */
#define REG_SERCOM3_I2CS_CTRLA    REG_ACCESS(RwReg  , 0x42001400U) /**< \brief (SERCOM3) I2cs Control Register A */
#define REG_SERCOM3_SPI_CTRLA     REG_ACCESS(RwReg  , 0x42001400U) /**< \brief (SERCOM3) Spi SPI Control Register A */
#define REG_SERCOM3_USART_CTRLA   REG_ACCESS(RwReg  , 0x42001400U) /**< \brief (SERCOM3) Usart USART Control Register A */
#define REG_SERCOM3_I2CM_CTRLB    REG_ACCESS(RwReg  , 0x42001404U) /**< \brief (SERCOM3) I2cm Control Register B */
#define REG_SERCOM3_I2CS_CTRLB    REG_ACCESS(RwReg  , 0x42001404U) /**< \brief (SERCOM3) I2cs Control Register B */
#define REG_SERCOM3_SPI_CTRLB     REG_ACCESS(RwReg  , 0x42001404U) /**< \brief (SERCOM3) Spi SPI Control Register B */
#define REG_SERCOM3_USART_CTRLB   REG_ACCESS(RwReg  , 0x42001404U) /**< \brief (SERCOM3) Usart USART Control Register B */
#define REG_SERCOM3_I2CM_DEBUG    REG_ACCESS(RwReg8 , 0x42001408U) /**< \brief (SERCOM3) I2cm Debug Register */
#define REG_SERCOM3_I2CS_DEBUG    REG_ACCESS(RwReg8 , 0x42001408U) /**< \brief (SERCOM3) I2cs Debug Register */
#define REG_SERCOM3_SPI_DEBUG     REG_ACCESS(RwReg8 , 0x42001408U) /**< \brief (SERCOM3) Spi SPI Debug Register */
#define REG_SERCOM3_USART_DEBUG   REG_ACCESS(RwReg8 , 0x42001408U) /**< \brief (SERCOM3) Usart USART Debug Register */
#define REG_SERCOM3_I2CM_BAUD     REG_ACCESS(RwReg16, 0x4200140AU) /**< \brief (SERCOM3) I2cm Baud Rate Register */
#define REG_SERCOM3_SPI_BAUD      REG_ACCESS(RwReg16, 0x4200140AU) /**< \brief (SERCOM3) Spi SPI Baud Rate Register */
#define REG_SERCOM3_USART_BAUD    REG_ACCESS(RwReg16, 0x4200140AU) /**< \brief (SERCOM3) Usart USART Baud Rate Register */
#define REG_SERCOM3_I2CM_INTENCLR REG_ACCESS(RwReg8 , 0x4200140CU) /**< \brief (SERCOM3) I2cm Interrupt Enable Clear Register */
#define REG_SERCOM3_I2CS_INTENCLR REG_ACCESS(RwReg8 , 0x4200140CU) /**< \brief (SERCOM3) I2cs Interrupt Enable Clear Register */
#define REG_SERCOM3_SPI_INTENCLR  REG_ACCESS(RwReg8 , 0x4200140CU) /**< \brief (SERCOM3) Spi SPI Interrupt Enable Clear Register */
#define REG_SERCOM3_USART_INTENCLR REG_ACCESS(RwReg8 , 0x4200140CU) /**< \brief (SERCOM3) Usart USART Interrupt Enable Clear Register */
#define REG_SERCOM3_I2CM_INTENSET REG_ACCESS(RwReg8 , 0x4200140DU) /**< \brief (SERCOM3) I2cm Interrupt Enable Set Register */
#define REG_SERCOM3_I2CS_INTENSET REG_ACCESS(RwReg8 , 0x4200140DU) /**< \brief (SERCOM3) I2cs Interrupt Enable Set Register */
#define REG_SERCOM3_SPI_INTENSET  REG_ACCESS(RwReg8 , 0x4200140DU) /**< \brief (SERCOM3) Spi SPI Interrupt Enable Set Register */
#define REG_SERCOM3_USART_INTENSET REG_ACCESS(RwReg8 , 0x4200140DU) /**< \brief (SERCOM3) Usart USART Interrupt Enable Set Register */
#define REG_SERCOM3_I2CM_INTFLAG  REG_ACCESS(RwReg8 , 0x4200140EU) /**< \brief (SERCOM3) I2cm Interrupt Flag Status and Clear Register */
#define REG_SERCOM3_I2CS_INTFLAG  REG_ACCESS(RwReg8 , 0x4200140EU) /**< \brief (SERCOM3) I2cs Interrupt Flag Status and Clear Register */
#define REG_SERCOM3_SPI_INTFLAG   REG_ACCESS(RwReg8 , 0x4200140EU) /**< \brief (SERCOM3) Spi SPI Interrupt Flag Status and Clear Register */
#define REG_SERCOM3_USART_INTFLAG REG_ACCESS(RwReg8 , 0x4200140EU) /**< \brief (SERCOM3) Usart USART Interrupt Flag Status and Clear Register */
#define REG_SERCOM3_I2CM_STATUS   REG_ACCESS(RwReg  , 0x42001410U) /**< \brief (SERCOM3) I2cm Status Register */
#define REG_SERCOM3_I2CS_STATUS   REG_ACCESS(RwReg  , 0x42001410U) /**< \brief (SERCOM3) I2cs Status Register */
#define REG_SERCOM3_SPI_STATUS    REG_ACCESS(RwReg  , 0x42001410U) /**< \brief (SERCOM3) Spi SPI Status Register */
#define REG_SERCOM3_USART_STATUS  REG_ACCESS(RwReg  , 0x42001410U) /**< \brief (SERCOM3) Usart USART Status Register */
#define REG_SERCOM3_I2CM_ADDR     REG_ACCESS(RwReg  , 0x42001414U) /**< \brief (SERCOM3) I2cm Address Register */
#define REG_SERCOM3_I2CS_ADDR     REG_ACCESS(RwReg  , 0x42001414U) /**< \brief (SERCOM3) I2cs Address Register */
