zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define REG_SERCOM3_SPI_ADDR      REG_ACCESS(RwReg  , 0x42001414U) /**< \brief (SERCOM3) Spi SPI Address Register */
#define REG_SERCOM3_I2CM_DATA     REG_ACCESS(RwReg  , 0x42001418U) /**< \brief (SERCOM3) I2cm Data Register */
#define REG_SERCOM3_I2CS_DATA     REG_ACCESS(RwReg  , 0x42001418U) /**< \brief (SERCOM3) I2cs Data Register */
#define REG_SERCOM3_SPI_DATA      REG_ACCESS(RwReg  , 0x42001418U) /**< \brief (SERCOM3) Spi SPI Data Register */
#define REG_SERCOM3_USART_DATA    REG_ACCESS(RwReg  , 0x42001418U) /**< \brief (SERCOM3) Usart USART Data Register */
/* ========== Register definition for SERCOM4 peripheral ========== */
#define REG_SERCOM4_I2CM_CTRLA    REG_ACCESS(RwReg  , 0x42001800U) /**< \brief (SERCOM4) I2cm Control Register A */
#define REG_SERCOM4_I2CS_CTRLA    REG_ACCESS(RwReg  , 0x42001800U) /**< \brief (SERCOM4) I2cs Control Register A */
#define REG_SERCOM4_SPI_CTRLA     REG_ACCESS(RwReg  , 0x42001800U) /**< \brief (SERCOM4) Spi SPI Control Register A */
#define REG_SERCOM4_USART_CTRLA   REG_ACCESS(RwReg  , 0x42001800U) /**< \brief (SERCOM4) Usart USART Control Register A */
#define REG_SERCOM4_I2CM_CTRLB    REG_ACCESS(RwReg  , 0x42001804U) /**< \brief (SERCOM4) I2cm Control Register B */
#define REG_SERCOM4_I2CS_CTRLB    REG_ACCESS(RwReg  , 0x42001804U) /**< \brief (SERCOM4) I2cs Control Register B */
#define REG_SERCOM4_SPI_CTRLB     REG_ACCESS(RwReg  , 0x42001804U) /**< \brief (SERCOM4) Spi SPI Control Register B */
#define REG_SERCOM4_USART_CTRLB   REG_ACCESS(RwReg  , 0x42001804U) /**< \brief (SERCOM4) Usart USART Control Register B */
#define REG_SERCOM4_I2CM_DEBUG    REG_ACCESS(RwReg8 , 0x42001808U) /**< \brief (SERCOM4) I2cm Debug Register */
#define REG_SERCOM4_I2CS_DEBUG    REG_ACCESS(RwReg8 , 0x42001808U) /**< \brief (SERCOM4) I2cs Debug Register */
#define REG_SERCOM4_SPI_DEBUG     REG_ACCESS(RwReg8 , 0x42001808U) /**< \brief (SERCOM4) Spi SPI Debug Register */
#define REG_SERCOM4_USART_DEBUG   REG_ACCESS(RwReg8 , 0x42001808U) /**< \brief (SERCOM4) Usart USART Debug Register */
#define REG_SERCOM4_I2CM_BAUD     REG_ACCESS(RwReg16, 0x4200180AU) /**< \brief (SERCOM4) I2cm Baud Rate Register */
#define REG_SERCOM4_SPI_BAUD      REG_ACCESS(RwReg16, 0x4200180AU) /**< \brief (SERCOM4) Spi SPI Baud Rate Register */
#define REG_SERCOM4_USART_BAUD    REG_ACCESS(RwReg16, 0x4200180AU) /**< \brief (SERCOM4) Usart USART Baud Rate Register */
#define REG_SERCOM4_I2CM_INTENCLR REG_ACCESS(RwReg8 , 0x4200180CU) /**< \brief (SERCOM4) I2cm Interrupt Enable Clear Register */
#define REG_SERCOM4_I2CS_INTENCLR REG_ACCESS(RwReg8 , 0x4200180CU) /**< \brief (SERCOM4) I2cs Interrupt Enable Clear Register */
#define REG_SERCOM4_SPI_INTENCLR  REG_ACCESS(RwReg8 , 0x4200180CU) /**< \brief (SERCOM4) Spi SPI Interrupt Enable Clear Register */
#define REG_SERCOM4_USART_INTENCLR REG_ACCESS(RwReg8 , 0x4200180CU) /**< \brief (SERCOM4) Usart USART Interrupt Enable Clear Register */
#define REG_SERCOM4_I2CM_INTENSET REG_ACCESS(RwReg8 , 0x4200180DU) /**< \brief (SERCOM4) I2cm Interrupt Enable Set Register */
#define REG_SERCOM4_I2CS_INTENSET REG_ACCESS(RwReg8 , 0x4200180DU) /**< \brief (SERCOM4) I2cs Interrupt Enable Set Register */
#define REG_SERCOM4_SPI_INTENSET  REG_ACCESS(RwReg8 , 0x4200180DU) /**< \brief (SERCOM4) Spi SPI Interrupt Enable Set Register */
#define REG_SERCOM4_USART_INTENSET REG_ACCESS(RwReg8 , 0x4200180DU) /**< \brief (SERCOM4) Usart USART Interrupt Enable Set Register */
#define REG_SERCOM4_I2CM_INTFLAG  REG_ACCESS(RwReg8 , 0x4200180EU) /**< \brief (SERCOM4) I2cm Interrupt Flag Status and Clear Register */
#define REG_SERCOM4_I2CS_INTFLAG  REG_ACCESS(RwReg8 , 0x4200180EU) /**< \brief (SERCOM4) I2cs Interrupt Flag Status and Clear Register */
#define REG_SERCOM4_SPI_INTFLAG   REG_ACCESS(RwReg8 , 0x4200180EU) /**< \brief (SERCOM4) Spi SPI Interrupt Flag Status and Clear Register */
#define REG_SERCOM4_USART_INTFLAG REG_ACCESS(RwReg8 , 0x4200180EU) /**< \brief (SERCOM4) Usart USART Interrupt Flag Status and Clear Register */
#define REG_SERCOM4_I2CM_STATUS   REG_ACCESS(RwReg  , 0x42001810U) /**< \brief (SERCOM4) I2cm Status Register */
#define REG_SERCOM4_I2CS_STATUS   REG_ACCESS(RwReg  , 0x42001810U) /**< \brief (SERCOM4) I2cs Status Register */
#define REG_SERCOM4_SPI_STATUS    REG_ACCESS(RwReg  , 0x42001810U) /**< \brief (SERCOM4) Spi SPI Status Register */
#define REG_SERCOM4_USART_STATUS  REG_ACCESS(RwReg  , 0x42001810U) /**< \brief (SERCOM4) Usart USART Status Register */
#define REG_SERCOM4_I2CM_ADDR     REG_ACCESS(RwReg  , 0x42001814U) /**< \brief (SERCOM4) I2cm Address Register */
#define REG_SERCOM4_I2CS_ADDR     REG_ACCESS(RwReg  , 0x42001814U) /**< \brief (SERCOM4) I2cs Address Register */
#define REG_SERCOM4_SPI_ADDR      REG_ACCESS(RwReg  , 0x42001814U) /**< \brief (SERCOM4) Spi SPI Address Register */
#define REG_SERCOM4_I2CM_DATA     REG_ACCESS(RwReg  , 0x42001818U) /**< \brief (SERCOM4) I2cm Data Register */
#define REG_SERCOM4_I2CS_DATA     REG_ACCESS(RwReg  , 0x42001818U) /**< \brief (SERCOM4) I2cs Data Register */
#define REG_SERCOM4_SPI_DATA      REG_ACCESS(RwReg  , 0x42001818U) /**< \brief (SERCOM4) Spi SPI Data Register */
#define REG_SERCOM4_USART_DATA    REG_ACCESS(RwReg  , 0x42001818U) /**< \brief (SERCOM4) Usart USART Data Register */
/* ========== Register definition for SERCOM5 peripheral ========== */
#define REG_SERCOM5_I2CM_CTRLA    REG_ACCESS(RwReg  , 0x42001C00U) /**< \brief (SERCOM5) I2cm Control Register A */
#define REG_SERCOM5_I2CS_CTRLA    REG_ACCESS(RwReg  , 0x42001C00U) /**< \brief (SERCOM5) I2cs Control Register A */
#define REG_SERCOM5_SPI_CTRLA     REG_ACCESS(RwReg  , 0x42001C00U) /**< \brief (SERCOM5) Spi SPI Control Register A */
#define REG_SERCOM5_USART_CTRLA   REG_ACCESS(RwReg  , 0x42001C00U) /**< \brief (SERCOM5) Usart USART Control Register A */
#define REG_SERCOM5_I2CM_CTRLB    REG_ACCESS(RwReg  , 0x42001C04U) /**< \brief (SERCOM5) I2cm Control Register B */
#define REG_SERCOM5_I2CS_CTRLB    REG_ACCESS(RwReg  , 0x42001C04U) /**< \brief (SERCOM5) I2cs Control Register B */
#define REG_SERCOM5_SPI_CTRLB     REG_ACCESS(RwReg  , 0x42001C04U) /**< \brief (SERCOM5) Spi SPI Control Register B */
#define REG_SERCOM5_USART_CTRLB   REG_ACCESS(RwReg  , 0x42001C04U) /**< \brief (SERCOM5) Usart USART Control Register B */
#define REG_SERCOM5_I2CM_DEBUG    REG_ACCESS(RwReg8 , 0x42001C08U) /**< \brief (SERCOM5) I2cm Debug Register */
#define REG_SERCOM5_I2CS_DEBUG    REG_ACCESS(RwReg8 , 0x42001C08U) /**< \brief (SERCOM5) I2cs Debug Register */
#define REG_SERCOM5_SPI_DEBUG     REG_ACCESS(RwReg8 , 0x42001C08U) /**< \brief (SERCOM5) Spi SPI Debug Register */
#define REG_SERCOM5_USART_DEBUG   REG_ACCESS(RwReg8 , 0x42001C08U) /**< \brief (SERCOM5) Usart USART Debug Register */
#define REG_SERCOM5_I2CM_BAUD     REG_ACCESS(RwReg16, 0x42001C0AU) /**< \brief (SERCOM5) I2cm Baud Rate Register */
#define REG_SERCOM5_SPI_BAUD      REG_ACCESS(RwReg16, 0x42001C0AU) /**< \brief (SERCOM5) Spi SPI Baud Rate Register */
#define REG_SERCOM5_USART_BAUD    REG_ACCESS(RwReg16, 0x42001C0AU) /**< \brief (SERCOM5) Usart USART Baud Rate Register */
#define REG_SERCOM5_I2CM_INTENCLR REG_ACCESS(RwReg8 , 0x42001C0CU) /**< \brief (SERCOM5) I2cm Interrupt Enable Clear Register */
#define REG_SERCOM5_I2CS_INTENCLR REG_ACCESS(RwReg8 , 0x42001C0CU) /**< \brief (SERCOM5) I2cs Interrupt Enable Clear Register */
#define REG_SERCOM5_SPI_INTENCLR  REG_ACCESS(RwReg8 , 0x42001C0CU) /**< \brief (SERCOM5) Spi SPI Interrupt Enable Clear Register */
#define REG_SERCOM5_USART_INTENCLR REG_ACCESS(RwReg8 , 0x42001C0CU) /**< \brief (SERCOM5) Usart USART Interrupt Enable Clear Register */
#define REG_SERCOM5_I2CM_INTENSET REG_ACCESS(RwReg8 , 0x42001C0DU) /**< \brief (SERCOM5) I2cm Interrupt Enable Set Register */
#define REG_SERCOM5_I2CS_INTENSET REG_ACCESS(RwReg8 , 0x42001C0DU) /**< \brief (SERCOM5) I2cs Interrupt Enable Set Register */
#define REG_SERCOM5_SPI_INTENSET  REG_ACCESS(RwReg8 , 0x42001C0DU) /**< \brief (SERCOM5) Spi SPI Interrupt Enable Set Register */
#define REG_SERCOM5_USART_INTENSET REG_ACCESS(RwReg8 , 0x42001C0DU) /**< \brief (SERCOM5) Usart USART Interrupt Enable Set Register */
#define REG_SERCOM5_I2CM_INTFLAG  REG_ACCESS(RwReg8 , 0x42001C0EU) /**< \brief (SERCOM5) I2cm Interrupt Flag Status and Clear Register */
#define REG_SERCOM5_I2CS_INTFLAG  REG_ACCESS(RwReg8 , 0x42001C0EU) /**< \brief (SERCOM5) I2cs Interrupt Flag Status and Clear Register */
#define REG_SERCOM5_SPI_INTFLAG   REG_ACCESS(RwReg8 , 0x42001C0EU) /**< \brief (SERCOM5) Spi SPI Interrupt Flag Status and Clear Register */
#define REG_SERCOM5_USART_INTFLAG REG_ACCESS(RwReg8 , 0x42001C0EU) /**< \brief (SERCOM5) Usart USART Interrupt Flag Status and Clear Register */
#define REG_SERCOM5_I2CM_STATUS   REG_ACCESS(RwReg  , 0x42001C10U) /**< \brief (SERCOM5) I2cm Status Register */
#define REG_SERCOM5_I2CS_STATUS   REG_ACCESS(RwReg  , 0x42001C10U) /**< \brief (SERCOM5) I2cs Status Register */
#define REG_SERCOM5_SPI_STATUS    REG_ACCESS(RwReg  , 0x42001C10U) /**< \brief (SERCOM5) Spi SPI Status Register */
#define REG_SERCOM5_USART_STATUS  REG_ACCESS(RwReg  , 0x42001C10U) /**< \brief (SERCOM5) Usart USART Status Register */
#define REG_SERCOM5_I2CM_ADDR     REG_ACCESS(RwReg  , 0x42001C14U) /**< \brief (SERCOM5) I2cm Address Register */
#define REG_SERCOM5_I2CS_ADDR     REG_ACCESS(RwReg  , 0x42001C14U) /**< \brief (SERCOM5) I2cs Address Register */
#define REG_SERCOM5_SPI_ADDR      REG_ACCESS(RwReg  , 0x42001C14U) /**< \brief (SERCOM5) Spi SPI Address Register */
#define REG_SERCOM5_I2CM_DATA     REG_ACCESS(RwReg  , 0x42001C18U) /**< \brief (SERCOM5) I2cm Data Register */
#define REG_SERCOM5_I2CS_DATA     REG_ACCESS(RwReg  , 0x42001C18U) /**< \brief (SERCOM5) I2cs Data Register */
#define REG_SERCOM5_SPI_DATA      REG_ACCESS(RwReg  , 0x42001C18U) /**< \brief (SERCOM5) Spi SPI Data Register */
#define REG_SERCOM5_USART_DATA    REG_ACCESS(RwReg  , 0x42001C18U) /**< \brief (SERCOM5) Usart USART Data Register */
/* ========== Register definition for TC0 peripheral ========== */
#define REG_TC0_CTRLA             REG_ACCESS(RwReg16, 0x42002000U) /**< \brief (TC0) Control A Register */
#define REG_TC0_READREQ           REG_ACCESS(RwReg16, 0x42002002U) /**< \brief (TC0) Read Request Register */
#define REG_TC0_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42002004U) /**< \brief (TC0) Control B Clear Register */
#define REG_TC0_CTRLBSET          REG_ACCESS(RwReg8 , 0x42002005U) /**< \brief (TC0) Control B Set Register */
#define REG_TC0_CTRLC             REG_ACCESS(RwReg8 , 0x42002006U) /**< \brief (TC0) Control C Register */
#define REG_TC0_DEBUG             REG_ACCESS(RwReg8 , 0x42002008U) /**< \brief (TC0) Debug Register */
#define REG_TC0_EVCTRL            REG_ACCESS(RwReg16, 0x4200200AU) /**< \brief (TC0) Event Control Register */
#define REG_TC0_INTENCLR          REG_ACCESS(RwReg8 , 0x4200200CU) /**< \brief (TC0) Interrupt Enable Clear Register */
#define REG_TC0_INTENSET          REG_ACCESS(RwReg8 , 0x4200200DU) /**< \brief (TC0) Interrupt Enable Set Register */
#define REG_TC0_INTFLAG           REG_ACCESS(RwReg8 , 0x4200200EU) /**< \brief (TC0) Interrupt Flag Status and Clear Register */
#define REG_TC0_STATUS            REG_ACCESS(RoReg8 , 0x4200200FU) /**< \brief (TC0) Status Register */
#define REG_TC0_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42002010U) /**< \brief (TC0) Count16 Count Register */
#define REG_TC0_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42002010U) /**< \brief (TC0) Count32 Count Register */
#define REG_TC0_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42002010U) /**< \brief (TC0) Count8 Count Register */
#define REG_TC0_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42002014U) /**< \brief (TC0) Count8 Period Register */
#define REG_TC0_COUNT16_CC        REG_ACCESS(RwReg16, 0x42002018U) /**< \brief (TC0) Count16 Compare and Capture Register */
#define REG_TC0_COUNT32_CC        REG_ACCESS(RwReg  , 0x42002018U) /**< \brief (TC0) Count32 Compare and Capture Register */
#define REG_TC0_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42002018U) /**< \brief (TC0) Count8 Compare and Capture Register */
/* ========== Register definition for TC1 peripheral ========== */
#define REG_TC1_CTRLA             REG_ACCESS(RwReg16, 0x42002400U) /**< \brief (TC1) Control A Register */
#define REG_TC1_READREQ           REG_ACCESS(RwReg16, 0x42002402U) /**< \brief (TC1) Read Request Register */
#define REG_TC1_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42002404U) /**< \brief (TC1) Control B Clear Register */
#define REG_TC1_CTRLBSET          REG_ACCESS(RwReg8 , 0x42002405U) /**< \brief (TC1) Control B Set Register */
#define REG_TC1_CTRLC             REG_ACCESS(RwReg8 , 0x42002406U) /**< \brief (TC1) Control C Register */
#define REG_TC1_DEBUG             REG_ACCESS(RwReg8 , 0x42002408U) /**< \brief (TC1) Debug Register */
#define REG_TC1_EVCTRL            REG_ACCESS(RwReg16, 0x4200240AU) /**< \brief (TC1) Event Control Register */
#define REG_TC1_INTENCLR          REG_ACCESS(RwReg8 , 0x4200240CU) /**< \brief (TC1) Interrupt Enable Clear Register */
#define REG_TC1_INTENSET          REG_ACCESS(RwReg8 , 0x4200240DU) /**< \brief (TC1) Interrupt Enable Set Register */
#define REG_TC1_INTFLAG           REG_ACCESS(RwReg8 , 0x4200240EU) /**< \brief (TC1) Interrupt Flag Status and Clear Register */
#define REG_TC1_STATUS            REG_ACCESS(RoReg8 , 0x4200240FU) /**< \brief (TC1) Status Register */
#define REG_TC1_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42002410U) /**< \brief (TC1) Count16 Count Register */
#define REG_TC1_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42002410U) /**< \brief (TC1) Count32 Count Register */
#define REG_TC1_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42002410U) /**< \brief (TC1) Count8 Count Register */
#define REG_TC1_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42002414U) /**< \brief (TC1) Count8 Period Register */
#define REG_TC1_COUNT16_CC        REG_ACCESS(RwReg16, 0x42002418U) /**< \brief (TC1) Count16 Compare and Capture Register */
#define REG_TC1_COUNT32_CC        REG_ACCESS(RwReg  , 0x42002418U) /**< \brief (TC1) Count32 Compare and Capture Register */
#define REG_TC1_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42002418U) /**< \brief (TC1) Count8 Compare and Capture Register */
/* ========== Register definition for TC2 peripheral ========== */
#define REG_TC2_CTRLA             REG_ACCESS(RwReg16, 0x42002800U) /**< \brief (TC2) Control A Register */
#define REG_TC2_READREQ           REG_ACCESS(RwReg16, 0x42002802U) /**< \brief (TC2) Read Request Register */
#define REG_TC2_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42002804U) /**< \brief (TC2) Control B Clear Register */
#define REG_TC2_CTRLBSET          REG_ACCESS(RwReg8 , 0x42002805U) /**< \brief (TC2) Control B Set Register */
#define REG_TC2_CTRLC             REG_ACCESS(RwReg8 , 0x42002806U) /**< \brief (TC2) Control C Register */
#define REG_TC2_DEBUG             REG_ACCESS(RwReg8 , 0x42002808U) /**< \brief (TC2) Debug Register */
#define REG_TC2_EVCTRL            REG_ACCESS(RwReg16, 0x4200280AU) /**< \brief (TC2) Event Control Register */
#define REG_TC2_INTENCLR          REG_ACCESS(RwReg8 , 0x4200280CU) /**< \brief (TC2) Interrupt Enable Clear Register */
#define REG_TC2_INTENSET          REG_ACCESS(RwReg8 , 0x4200280DU) /**< \brief (TC2) Interrupt Enable Set Register */
#define REG_TC2_INTFLAG           REG_ACCESS(RwReg8 , 0x4200280EU) /**< \brief (TC2) Interrupt Flag Status and Clear Register */
#define REG_TC2_STATUS            REG_ACCESS(RoReg8 , 0x4200280FU) /**< \brief (TC2) Status Register */
#define REG_TC2_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42002810U) /**< \brief (TC2) Count16 Count Register */
#define REG_TC2_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42002810U) /**< \brief (TC2) Count32 Count Register */
#define REG_TC2_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42002810U) /**< \brief (TC2) Count8 Count Register */
#define REG_TC2_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42002814U) /**< \brief (TC2) Count8 Period Register */
#define REG_TC2_COUNT16_CC        REG_ACCESS(RwReg16, 0x42002818U) /**< \brief (TC2) Count16 Compare and Capture Register */
#define REG_TC2_COUNT32_CC        REG_ACCESS(RwReg  , 0x42002818U) /**< \brief (TC2) Count32 Compare and Capture Register */
#define REG_TC2_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42002818U) /**< \brief (TC2) Count8 Compare and Capture Register */
/* ========== Register definition for TC3 peripheral ========== */
#define REG_TC3_CTRLA             REG_ACCESS(RwReg16, 0x42002C00U) /**< \brief (TC3) Control A Register */
#define REG_TC3_READREQ           REG_ACCESS(RwReg16, 0x42002C02U) /**< \brief (TC3) Read Request Register */
#define REG_TC3_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42002C04U) /**< \brief (TC3) Control B Clear Register */
#define REG_TC3_CTRLBSET          REG_ACCESS(RwReg8 , 0x42002C05U) /**< \brief (TC3) Control B Set Register */
#define REG_TC3_CTRLC             REG_ACCESS(RwReg8 , 0x42002C06U) /**< \brief (TC3) Control C Register */
#define REG_TC3_DEBUG             REG_ACCESS(RwReg8 , 0x42002C08U) /**< \brief (TC3) Debug Register */
#define REG_TC3_EVCTRL            REG_ACCESS(RwReg16, 0x42002C0AU) /**< \brief (TC3) Event Control Register */
#define REG_TC3_INTENCLR          REG_ACCESS(RwReg8 , 0x42002C0CU) /**< \brief (TC3) Interrupt Enable Clear Register */
#define REG_TC3_INTENSET          REG_ACCESS(RwReg8 , 0x42002C0DU) /**< \brief (TC3) Interrupt Enable Set Register */
#define REG_TC3_INTFLAG           REG_ACCESS(RwReg8 , 0x42002C0EU) /**< \brief (TC3) Interrupt Flag Status and Clear Register */
#define REG_TC3_STATUS            REG_ACCESS(RoReg8 , 0x42002C0FU) /**< \brief (TC3) Status Register */
#define REG_TC3_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42002C10U) /**< \brief (TC3) Count16 Count Register */
#define REG_TC3_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42002C10U) /**< \brief (TC3) Count32 Count Register */
#define REG_TC3_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42002C10U) /**< \brief (TC3) Count8 Count Register */
#define REG_TC3_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42002C14U) /**< \brief (TC3) Count8 Period Register */
#define REG_TC3_COUNT16_CC        REG_ACCESS(RwReg16, 0x42002C18U) /**< \brief (TC3) Count16 Compare and Capture Register */
#define REG_TC3_COUNT32_CC        REG_ACCESS(RwReg  , 0x42002C18U) /**< \brief (TC3) Count32 Compare and Capture Register */
#define REG_TC3_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42002C18U) /**< \brief (TC3) Count8 Compare and Capture Register */
/* ========== Register definition for TC4 peripheral ========== */
#define REG_TC4_CTRLA             REG_ACCESS(RwReg16, 0x42003000U) /**< \brief (TC4) Control A Register */
#define REG_TC4_READREQ           REG_ACCESS(RwReg16, 0x42003002U) /**< \brief (TC4) Read Request Register */
#define REG_TC4_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42003004U) /**< \brief (TC4) Control B Clear Register */
#define REG_TC4_CTRLBSET          REG_ACCESS(RwReg8 , 0x42003005U) /**< \brief (TC4) Control B Set Register */
#define REG_TC4_CTRLC             REG_ACCESS(RwReg8 , 0x42003006U) /**< \brief (TC4) Control C Register */
#define REG_TC4_DEBUG             REG_ACCESS(RwReg8 , 0x42003008U) /**< \brief (TC4) Debug Register */
#define REG_TC4_EVCTRL            REG_ACCESS(RwReg16, 0x4200300AU) /**< \brief (TC4) Event Control Register */
#define REG_TC4_INTENCLR          REG_ACCESS(RwReg8 , 0x4200300CU) /**< \brief (TC4) Interrupt Enable Clear Register */
#define REG_TC4_INTENSET          REG_ACCESS(RwReg8 , 0x4200300DU) /**< \brief (TC4) Interrupt Enable Set Register */
#define REG_TC4_INTFLAG           REG_ACCESS(RwReg8 , 0x4200300EU) /**< \brief (TC4) Interrupt Flag Status and Clear Register */
#define REG_TC4_STATUS            REG_ACCESS(RoReg8 , 0x4200300FU) /**< \brief (TC4) Status Register */
#define REG_TC4_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42003010U) /**< \brief (TC4) Count16 Count Register */
#define REG_TC4_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42003010U) /**< \brief (TC4) Count32 Count Register */
#define REG_TC4_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42003010U) /**< \brief (TC4) Count8 Count Register */
#define REG_TC4_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42003014U) /**< \brief (TC4) Count8 Period Register */
#define REG_TC4_COUNT16_CC        REG_ACCESS(RwReg16, 0x42003018U) /**< \brief (TC4) Count16 Compare and Capture Register */
#define REG_TC4_COUNT32_CC        REG_ACCESS(RwReg  , 0x42003018U) /**< \brief (TC4) Count32 Compare and Capture Register */
#define REG_TC4_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42003018U) /**< \brief (TC4) Count8 Compare and Capture Register */
/* ========== Register definition for TC5 peripheral ========== */
#define REG_TC5_CTRLA             REG_ACCESS(RwReg16, 0x42003400U) /**< \brief (TC5) Control A Register */
#define REG_TC5_READREQ           REG_ACCESS(RwReg16, 0x42003402U) /**< \brief (TC5) Read Request Register */
#define REG_TC5_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42003404U) /**< \brief (TC5) Control B Clear Register */
#define REG_TC5_CTRLBSET          REG_ACCESS(RwReg8 , 0x42003405U) /**< \brief (TC5) Control B Set Register */
#define REG_TC5_CTRLC             REG_ACCESS(RwReg8 , 0x42003406U) /**< \brief (TC5) Control C Register */
#define REG_TC5_DEBUG             REG_ACCESS(RwReg8 , 0x42003408U) /**< \brief (TC5) Debug Register */
#define REG_TC5_EVCTRL            REG_ACCESS(RwReg16, 0x4200340AU) /**< \brief (TC5) Event Control Register */
#define REG_TC5_INTENCLR          REG_ACCESS(RwReg8 , 0x4200340CU) /**< \brief (TC5) Interrupt Enable Clear Register */
#define REG_TC5_INTENSET          REG_ACCESS(RwReg8 , 0x4200340DU) /**< \brief (TC5) Interrupt Enable Set Register */
#define REG_TC5_INTFLAG           REG_ACCESS(RwReg8 , 0x4200340EU) /**< \brief (TC5) Interrupt Flag Status and Clear Register */
#define REG_TC5_STATUS            REG_ACCESS(RoReg8 , 0x4200340FU) /**< \brief (TC5) Status Register */
#define REG_TC5_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42003410U) /**< \brief (TC5) Count16 Count Register */
#define REG_TC5_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42003410U) /**< \brief (TC5) Count32 Count Register */
#define REG_TC5_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42003410U) /**< \brief (TC5) Count8 Count Register */
#define REG_TC5_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42003414U) /**< \brief (TC5) Count8 Period Register */
#define REG_TC5_COUNT16_CC        REG_ACCESS(RwReg16, 0x42003418U) /**< \brief (TC5) Count16 Compare and Capture Register */
#define REG_TC5_COUNT32_CC        REG_ACCESS(RwReg  , 0x42003418U) /**< \brief (TC5) Count32 Compare and Capture Register */
#define REG_TC5_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42003418U) /**< \brief (TC5) Count8 Compare and Capture Register */
/* ========== Register definition for TC6 peripheral ========== */
#define REG_TC6_CTRLA             REG_ACCESS(RwReg16, 0x42003800U) /**< \brief (TC6) Control A Register */
#define REG_TC6_READREQ           REG_ACCESS(RwReg16, 0x42003802U) /**< \brief (TC6) Read Request Register */
#define REG_TC6_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42003804U) /**< \brief (TC6) Control B Clear Register */
#define REG_TC6_CTRLBSET          REG_ACCESS(RwReg8 , 0x42003805U) /**< \brief (TC6) Control B Set Register */
#define REG_TC6_CTRLC             REG_ACCESS(RwReg8 , 0x42003806U) /**< \brief (TC6) Control C Register */
#define REG_TC6_DEBUG             REG_ACCESS(RwReg8 , 0x42003808U) /**< \brief (TC6) Debug Register */
#define REG_TC6_EVCTRL            REG_ACCESS(RwReg16, 0x4200380AU) /**< \brief (TC6) Event Control Register */
#define REG_TC6_INTENCLR          REG_ACCESS(RwReg8 , 0x4200380CU) /**< \brief (TC6) Interrupt Enable Clear Register */
#define REG_TC6_INTENSET          REG_ACCESS(RwReg8 , 0x4200380DU) /**< \brief (TC6) Interrupt Enable Set Register */
#define REG_TC6_INTFLAG           REG_ACCESS(RwReg8 , 0x4200380EU) /**< \brief (TC6) Interrupt Flag Status and Clear Register */
#define REG_TC6_STATUS            REG_ACCESS(RoReg8 , 0x4200380FU) /**< \brief (TC6) Status Register */
