zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define REG_TC6_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42003810U) /**< \brief (TC6) Count16 Count Register */
#define REG_TC6_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42003810U) /**< \brief (TC6) Count32 Count Register */
#define REG_TC6_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42003810U) /**< \brief (TC6) Count8 Count Register */
#define REG_TC6_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42003814U) /**< \brief (TC6) Count8 Period Register */
#define REG_TC6_COUNT16_CC        REG_ACCESS(RwReg16, 0x42003818U) /**< \brief (TC6) Count16 Compare and Capture Register */
#define REG_TC6_COUNT32_CC        REG_ACCESS(RwReg  , 0x42003818U) /**< \brief (TC6) Count32 Compare and Capture Register */
#define REG_TC6_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42003818U) /**< \brief (TC6) Count8 Compare and Capture Register */
/* ========== Register definition for TC7 peripheral ========== */
#define REG_TC7_CTRLA             REG_ACCESS(RwReg16, 0x42003C00U) /**< \brief (TC7) Control A Register */
#define REG_TC7_READREQ           REG_ACCESS(RwReg16, 0x42003C02U) /**< \brief (TC7) Read Request Register */
#define REG_TC7_CTRLBCLR          REG_ACCESS(RwReg8 , 0x42003C04U) /**< \brief (TC7) Control B Clear Register */
#define REG_TC7_CTRLBSET          REG_ACCESS(RwReg8 , 0x42003C05U) /**< \brief (TC7) Control B Set Register */
#define REG_TC7_CTRLC             REG_ACCESS(RwReg8 , 0x42003C06U) /**< \brief (TC7) Control C Register */
#define REG_TC7_DEBUG             REG_ACCESS(RwReg8 , 0x42003C08U) /**< \brief (TC7) Debug Register */
#define REG_TC7_EVCTRL            REG_ACCESS(RwReg16, 0x42003C0AU) /**< \brief (TC7) Event Control Register */
#define REG_TC7_INTENCLR          REG_ACCESS(RwReg8 , 0x42003C0CU) /**< \brief (TC7) Interrupt Enable Clear Register */
#define REG_TC7_INTENSET          REG_ACCESS(RwReg8 , 0x42003C0DU) /**< \brief (TC7) Interrupt Enable Set Register */
#define REG_TC7_INTFLAG           REG_ACCESS(RwReg8 , 0x42003C0EU) /**< \brief (TC7) Interrupt Flag Status and Clear Register */
#define REG_TC7_STATUS            REG_ACCESS(RoReg8 , 0x42003C0FU) /**< \brief (TC7) Status Register */
#define REG_TC7_COUNT16_COUNT     REG_ACCESS(RwReg16, 0x42003C10U) /**< \brief (TC7) Count16 Count Register */
#define REG_TC7_COUNT32_COUNT     REG_ACCESS(RwReg  , 0x42003C10U) /**< \brief (TC7) Count32 Count Register */
#define REG_TC7_COUNT8_COUNT      REG_ACCESS(RwReg8 , 0x42003C10U) /**< \brief (TC7) Count8 Count Register */
#define REG_TC7_COUNT8_PER        REG_ACCESS(RwReg8 , 0x42003C14U) /**< \brief (TC7) Count8 Period Register */
#define REG_TC7_COUNT16_CC        REG_ACCESS(RwReg16, 0x42003C18U) /**< \brief (TC7) Count16 Compare and Capture Register */
#define REG_TC7_COUNT32_CC        REG_ACCESS(RwReg  , 0x42003C18U) /**< \brief (TC7) Count32 Compare and Capture Register */
#define REG_TC7_COUNT8_CC         REG_ACCESS(RwReg8 , 0x42003C18U) /**< \brief (TC7) Count8 Compare and Capture Register */
/* ========== Register definition for ADC peripheral ========== */
#define REG_ADC_CTRLA             REG_ACCESS(RwReg8 , 0x42004000U) /**< \brief (ADC) Control Register A */
#define REG_ADC_REFCTRL           REG_ACCESS(RwReg8 , 0x42004001U) /**< \brief (ADC) Reference Control Register */
#define REG_ADC_AVGCTRL           REG_ACCESS(RwReg8 , 0x42004002U) /**< \brief (ADC) Average Control Register */
#define REG_ADC_SAMPCTRL          REG_ACCESS(RwReg8 , 0x42004003U) /**< \brief (ADC) Sample Time Control Register */
#define REG_ADC_CTRLB             REG_ACCESS(RwReg16, 0x42004004U) /**< \brief (ADC) Control Register B */
#define REG_ADC_WINCTRL           REG_ACCESS(RwReg8 , 0x42004008U) /**< \brief (ADC) Window Monitor Control Register */
#define REG_ADC_SWTRIG            REG_ACCESS(RwReg8 , 0x4200400CU) /**< \brief (ADC) Control Register B */
#define REG_ADC_INPUTCTRL         REG_ACCESS(RwReg  , 0x42004010U) /**< \brief (ADC) Input Control Register */
#define REG_ADC_EVCTRL            REG_ACCESS(RwReg8 , 0x42004014U) /**< \brief (ADC) Event Control Register */
#define REG_ADC_INTENCLR          REG_ACCESS(RwReg8 , 0x42004016U) /**< \brief (ADC) Interrupt Enable Clear Register */
#define REG_ADC_INTENSET          REG_ACCESS(RwReg8 , 0x42004017U) /**< \brief (ADC) Interrupt Enable Set Register */
#define REG_ADC_INTFLAG           REG_ACCESS(RwReg8 , 0x42004018U) /**< \brief (ADC) Interrupt Flag Status and Clear Register */
#define REG_ADC_STATUS            REG_ACCESS(RoReg8 , 0x42004019U) /**< \brief (ADC) Status Register */
#define REG_ADC_RESULT            REG_ACCESS(RoReg16, 0x4200401AU) /**< \brief (ADC) Result Register */
#define REG_ADC_WINLT             REG_ACCESS(RwReg16, 0x4200401CU) /**< \brief (ADC) Window Monitor Lower Threshold Register */
#define REG_ADC_WINUT             REG_ACCESS(RwReg16, 0x42004020U) /**< \brief (ADC) Window Monitor Upper Threshold Register */
#define REG_ADC_GAINCORR          REG_ACCESS(RwReg16, 0x42004024U) /**< \brief (ADC) Gain Correction Register */
#define REG_ADC_OFFSETCORR        REG_ACCESS(RwReg16, 0x42004026U) /**< \brief (ADC) Offset Correction Register */
#define REG_ADC_CALIB             REG_ACCESS(RwReg16, 0x42004028U) /**< \brief (ADC) Calibration Register */
#define REG_ADC_DEBUG             REG_ACCESS(RwReg8 , 0x4200402AU) /**< \brief (ADC) Debug Register */
#define REG_ADC_TEST              REG_ACCESS(RwReg8 , 0x4200402BU) /**< \brief (ADC) Test Modes Register */
#define REG_ADC_TESTRESULT        REG_ACCESS(RwReg  , 0x4200402CU) /**< \brief (ADC) Test Result Register */
#define REG_ADC_DCFG              REG_ACCESS(RwReg8 , 0x42004030U) /**< \brief (ADC) Device Configuration */
/* ========== Register definition for AC peripheral ========== */
#define REG_AC_CTRLA              REG_ACCESS(RwReg8 , 0x42004400U) /**< \brief (AC) Control A Register */
#define REG_AC_CTRLB              REG_ACCESS(WoReg8 , 0x42004401U) /**< \brief (AC) Control B Register */
#define REG_AC_EVCTRL             REG_ACCESS(RwReg16, 0x42004402U) /**< \brief (AC) Event Control Register */
#define REG_AC_INTENCLR           REG_ACCESS(RwReg8 , 0x42004404U) /**< \brief (AC) Interrupt Enable Clear Register */
#define REG_AC_INTENSET           REG_ACCESS(RwReg8 , 0x42004405U) /**< \brief (AC) Interrupt Enable Set Register */
#define REG_AC_INTFLAG            REG_ACCESS(RwReg8 , 0x42004406U) /**< \brief (AC) Interrupt Flag Status and Clear Register */
#define REG_AC_STATUSA            REG_ACCESS(RoReg8 , 0x42004408U) /**< \brief (AC) Status A Register */
#define REG_AC_STATUSB            REG_ACCESS(RoReg8 , 0x42004409U) /**< \brief (AC) Status B Register */
#define REG_AC_STATUSC            REG_ACCESS(RoReg8 , 0x4200440AU) /**< \brief (AC) Status C Register */
#define REG_AC_WINCTRL            REG_ACCESS(RwReg8 , 0x4200440CU) /**< \brief (AC) Window Control Register */
#define REG_AC_COMPCTRL           REG_ACCESS(RwReg  , 0x42004410U) /**< \brief (AC) Comparator Control Register */
#define REG_AC_SCALER             REG_ACCESS(RwReg8 , 0x42004420U) /**< \brief (AC) Scaler Register */
/* ========== Register definition for DAC peripheral ========== */
#define REG_DAC_CTRLA             REG_ACCESS(RwReg8 , 0x42004800U) /**< \brief (DAC) Control Register A */
#define REG_DAC_CTRLB             REG_ACCESS(RwReg8 , 0x42004801U) /**< \brief (DAC) Control Register B */
#define REG_DAC_EVCTRL            REG_ACCESS(RwReg8 , 0x42004802U) /**< \brief (DAC) Event Control Register */
#define REG_DAC_TEST              REG_ACCESS(RwReg8 , 0x42004803U) /**< \brief (DAC) Test Register */
#define REG_DAC_INTENCLR          REG_ACCESS(RwReg8 , 0x42004804U) /**< \brief (DAC) Interrupt Enable Clear Register */
#define REG_DAC_INTENSET          REG_ACCESS(RwReg8 , 0x42004805U) /**< \brief (DAC) Interrupt Enable Set Register */
#define REG_DAC_INTFLAG           REG_ACCESS(RwReg8 , 0x42004806U) /**< \brief (DAC) Interrupt Flag Status and Clear Register */
#define REG_DAC_STATUS            REG_ACCESS(RoReg8 , 0x42004807U) /**< \brief (DAC) Status Register */
#define REG_DAC_DATA              REG_ACCESS(RwReg16, 0x42004808U) /**< \brief (DAC) Data Register */
#define REG_DAC_DATABUF           REG_ACCESS(RwReg16, 0x4200480CU) /**< \brief (DAC) Data Buffer Register */
/* ========== Register definition for PTC peripheral ========== */
#define REG_PTC_CTRLA             REG_ACCESS(RwReg8 , 0x42004C00U) /**< \brief (PTC) Control Register A */
#define REG_PTC_STATUS            REG_ACCESS(RoReg8 , 0x42004C01U) /**< \brief (PTC) Status Register */
#define REG_PTC_CTRLB             REG_ACCESS(RwReg8 , 0x42004C04U) /**< \brief (PTC) Control Register B */
#define REG_PTC_EVCTRL            REG_ACCESS(RwReg8 , 0x42004C05U) /**< \brief (PTC) Event Control Register */
#define REG_PTC_INTENCLR          REG_ACCESS(RwReg8 , 0x42004C08U) /**< \brief (PTC) Interrupt Enable Clear Register */
#define REG_PTC_INTENSET          REG_ACCESS(RwReg8 , 0x42004C09U) /**< \brief (PTC) Interrupt Enable Set Register */
#define REG_PTC_INTFLAG           REG_ACCESS(RwReg8 , 0x42004C0AU) /**< \brief (PTC) Interrupt Flag Status and Clear Register */
#define REG_PTC_CTSCTRLA          REG_ACCESS(RwReg8 , 0x42004C0CU) /**< \brief (PTC) CTS Control Register A */
#define REG_PTC_CTSCTRLC          REG_ACCESS(RwReg8 , 0x42004C0DU) /**< \brief (PTC) CTS Control Register C */
#define REG_PTC_YSEL              REG_ACCESS(RwReg16, 0x42004C10U) /**< \brief (PTC) Y Line Select Register */
#define REG_PTC_XSEL              REG_ACCESS(RwReg16, 0x42004C12U) /**< \brief (PTC) X Line Select Register */
#define REG_PTC_YEN               REG_ACCESS(RwReg16, 0x42004C14U) /**< \brief (PTC) Y Line Enable Register */
#define REG_PTC_XEN               REG_ACCESS(RwReg16, 0x42004C16U) /**< \brief (PTC) X Line Enable Register */
#define REG_PTC_CCCAL             REG_ACCESS(RwReg16, 0x42004C18U) /**< \brief (PTC) CTS Compensation Capacitor Calibration Register */
#define REG_PTC_CICAL             REG_ACCESS(RwReg8 , 0x42004C1AU) /**< \brief (PTC) CTS Integrator Capacitor Calibration Register */
#define REG_PTC_CTSRS             REG_ACCESS(RwReg8 , 0x42004C1BU) /**< \brief (PTC) CTS Resistor Selection Register */
#define REG_PTC_RESULT            REG_ACCESS(RwReg16, 0x42004C1CU) /**< \brief (PTC) Conversion Result Register */
#define REG_PTC_CTSCTRLB          REG_ACCESS(RwReg8 , 0x42004C20U) /**< \brief (PTC) CTS Control Register B */
#define REG_PTC_WINCCTRL          REG_ACCESS(RwReg8 , 0x42004C21U) /**< \brief (PTC) Window Comparator Control Register */
#define REG_PTC_WCHT              REG_ACCESS(RwReg16, 0x42004C24U) /**< \brief (PTC) Window Comparator High Threshold Register */
#define REG_PTC_WCLT              REG_ACCESS(RwReg16, 0x42004C26U) /**< \brief (PTC) Window Comparator Low Threshold Register */

/*@}*/

/* ************************************************************************** */
/**  PERIPHERAL ID DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_id Peripheral Ids Definitions */
/*@{*/

// Peripheral instances on HPB0 bridge
#define ID_PAC0         0 /**< \brief Peripheral Access Controller PAC (PAC0) */
#define ID_PM           1 /**< \brief Power Manager (PM) */
#define ID_SYSCTRL      2 /**< \brief System Control (SYSCTRL) */
#define ID_GCLK         3 /**< \brief Generic Clock Generator (GCLK) */
#define ID_WDT          4 /**< \brief Watchdog Timer (WDT) */
#define ID_RTC          5 /**< \brief Real-Time Counter (RTC) */
#define ID_EIC          6 /**< \brief External Interrupt Controller (EIC) */

// Peripheral instances on HPB1 bridge
#define ID_PAC1        32 /**< \brief Peripheral Access Controller PAC (PAC1) */
#define ID_DSU         33 /**< \brief Device Service Unit (DSU) */
#define ID_NVMCTRL     34 /**< \brief Non-Volatile Memory Controller (NVMCTRL) */
#define ID_PORT        35 /**< \brief Port Module (PORT) */
#define ID_HMATRIX     36 /**< \brief HSB Matrix (HMATRIX) */

