zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
// Peripheral instances on HPB2 bridge
#define ID_PAC2        64 /**< \brief Peripheral Access Controller PAC (PAC2) */
#define ID_EVSYS       65 /**< \brief Event System Interface (EVSYS) */
#define ID_SERCOM0     66 /**< \brief Serial Communication Interface SERCOM (SERCOM0) */
#define ID_SERCOM1     67 /**< \brief Serial Communication Interface SERCOM (SERCOM1) */
#define ID_SERCOM2     68 /**< \brief Serial Communication Interface SERCOM (SERCOM2) */
#define ID_SERCOM3     69 /**< \brief Serial Communication Interface SERCOM (SERCOM3) */
#define ID_SERCOM4     70 /**< \brief Serial Communication Interface SERCOM (SERCOM4) */
#define ID_SERCOM5     71 /**< \brief Serial Communication Interface SERCOM (SERCOM5) */
#define ID_TC0         72 /**< \brief Basic Timer Counter TC (TC0) */
#define ID_TC1         73 /**< \brief Basic Timer Counter TC (TC1) */
#define ID_TC2         74 /**< \brief Basic Timer Counter TC (TC2) */
#define ID_TC3         75 /**< \brief Basic Timer Counter TC (TC3) */
#define ID_TC4         76 /**< \brief Basic Timer Counter TC (TC4) */
#define ID_TC5         77 /**< \brief Basic Timer Counter TC (TC5) */
#define ID_TC6         78 /**< \brief Basic Timer Counter TC (TC6) */
#define ID_TC7         79 /**< \brief Basic Timer Counter TC (TC7) */
#define ID_ADC         80 /**< \brief Analog Digital Converter (ADC) */
#define ID_AC          81 /**< \brief Analog Comparators (AC) */
#define ID_DAC         82 /**< \brief Digital Analog Converter (DAC) */
#define ID_PTC         83 /**< \brief Peripheral Touch Controller (PTC) */

/*@}*/

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_base Peripheral Base Address Definitions */
/*@{*/

#define AC_ADDR           (0x42004400U)                  /**< \brief (AC) APB Base Address */
#define AC                CAST(Ac,        AC_ADDR)      
#define AC_INST_NUM       1                              /**< \brief (AC) Number of instances */
#define AC_INSTS          { AC }                         /**< \brief (AC) Instances List */

#define ADC_ADDR          (0x42004000U)                  /**< \brief (ADC) APB Base Address */
#define ADC               CAST(Adc,       ADC_ADDR)     
#define ADC_INST_NUM      1                              /**< \brief (ADC) Number of instances */
#define ADC_INSTS         { ADC }                        /**< \brief (ADC) Instances List */

#define DAC_ADDR          (0x42004800U)                  /**< \brief (DAC) APB Base Address */
#define DAC               CAST(Dac,       DAC_ADDR)     
#define DAC_INST_NUM      1                              /**< \brief (DAC) Number of instances */
#define DAC_INSTS         { DAC }                        /**< \brief (DAC) Instances List */

#define DSU_ADDR          (0x41002000U)                  /**< \brief (DSU) APB Base Address */
#define DSU               CAST(Dsu,       DSU_ADDR)     
#define DSU_INST_NUM      1                              /**< \brief (DSU) Number of instances */
#define DSU_INSTS         { DSU }                        /**< \brief (DSU) Instances List */

#define EIC_ADDR          (0x40001800U)                  /**< \brief (EIC) APB Base Address */
#define EIC               CAST(Eic,       EIC_ADDR)     
#define EIC_INST_NUM      1                              /**< \brief (EIC) Number of instances */
#define EIC_INSTS         { EIC }                        /**< \brief (EIC) Instances List */

#define EVSYS_ADDR        (0x42000400U)                  /**< \brief (EVSYS) APB Base Address */
#define EVSYS             CAST(Evsys,     EVSYS_ADDR)   
#define EVSYS_INST_NUM    1                              /**< \brief (EVSYS) Number of instances */
#define EVSYS_INSTS       { EVSYS }                      /**< \brief (EVSYS) Instances List */

#define GCLK_ADDR         (0x40000C00U)                  /**< \brief (GCLK) APB Base Address */
#define GCLK              CAST(Gclk,      GCLK_ADDR)    
#define GCLK_INST_NUM     1                              /**< \brief (GCLK) Number of instances */
#define GCLK_INSTS        { GCLK }                       /**< \brief (GCLK) Instances List */

#define HMATRIX_ADDR      (0x41004800U)                  /**< \brief (HMATRIX) APB Base Address */
#define HMATRIX           CAST(Hmatrixb,  HMATRIX_ADDR) 
#define HMATRIXB_INST_NUM 1                              /**< \brief (HMATRIXB) Number of instances */
#define HMATRIXB_INSTS    { HMATRIX }                    /**< \brief (HMATRIXB) Instances List */

#define NVMCTRL_ADDR      (0x41004000U)                  /**< \brief (NVMCTRL) APB Base Address */
#define NVMCTRL           CAST(Nvmctrl,   NVMCTRL_ADDR) 
#define NVMCTRL_INST_NUM  1                              /**< \brief (NVMCTRL) Number of instances */
#define NVMCTRL_INSTS     { NVMCTRL }                    /**< \brief (NVMCTRL) Instances List */

#define PAC0_ADDR         (0x40000000U)                  /**< \brief (PAC0) APB Base Address */
#define PAC0              CAST(Pac,       PAC0_ADDR)    
#define PAC1_ADDR         (0x41000000U)                  /**< \brief (PAC1) APB Base Address */
#define PAC1              CAST(Pac,       PAC1_ADDR)    
#define PAC2_ADDR         (0x42000000U)                  /**< \brief (PAC2) APB Base Address */
#define PAC2              CAST(Pac,       PAC2_ADDR)    
#define PAC_INST_NUM      3                              /**< \brief (PAC) Number of instances */
#define PAC_INSTS         { PAC0, PAC1, PAC2 }           /**< \brief (PAC) Instances List */

#define PM_ADDR           (0x40000400U)                  /**< \brief (PM) APB Base Address */
#define PM                CAST(Pm,        PM_ADDR)      
#define PM_INST_NUM       1                              /**< \brief (PM) Number of instances */
#define PM_INSTS          { PM }                         /**< \brief (PM) Instances List */

#define PORT_ADDR         (0x41004400U)                  /**< \brief (PORT) APB Base Address */
#define PORT              CAST(Port,      PORT_ADDR)    
#define PORT_IOBUS_ADDR   (0x60000000U)                  /**< \brief (PORT) IOBUS Base Address */
#define PORT_INST_NUM     1                              /**< \brief (PORT) Number of instances */
#define PORT_INSTS        { PORT }                       /**< \brief (PORT) Instances List */

#define PTC_ADDR          (0x42004C00U)                  /**< \brief (PTC) APB Base Address */
#define PTC               CAST(Ptc,       PTC_ADDR)     
#define PTC_INST_NUM      1                              /**< \brief (PTC) Number of instances */
#define PTC_INSTS         { PTC }                        /**< \brief (PTC) Instances List */

#define RTC_ADDR          (0x40001400U)                  /**< \brief (RTC) APB Base Address */
#define RTC               CAST(Rtc,       RTC_ADDR)     
#define RTC_INST_NUM      1                              /**< \brief (RTC) Number of instances */
#define RTC_INSTS         { RTC }                        /**< \brief (RTC) Instances List */

#define SERCOM0_ADDR      (0x42000800U)                  /**< \brief (SERCOM0) APB Base Address */
#define SERCOM0           CAST(Sercom,    SERCOM0_ADDR) 
#define SERCOM1_ADDR      (0x42000C00U)                  /**< \brief (SERCOM1) APB Base Address */
#define SERCOM1           CAST(Sercom,    SERCOM1_ADDR) 
#define SERCOM2_ADDR      (0x42001000U)                  /**< \brief (SERCOM2) APB Base Address */
#define SERCOM2           CAST(Sercom,    SERCOM2_ADDR) 
#define SERCOM3_ADDR      (0x42001400U)                  /**< \brief (SERCOM3) APB Base Address */
#define SERCOM3           CAST(Sercom,    SERCOM3_ADDR) 
#define SERCOM4_ADDR      (0x42001800U)                  /**< \brief (SERCOM4) APB Base Address */
#define SERCOM4           CAST(Sercom,    SERCOM4_ADDR) 
#define SERCOM5_ADDR      (0x42001C00U)                  /**< \brief (SERCOM5) APB Base Address */
#define SERCOM5           CAST(Sercom,    SERCOM5_ADDR) 
#define SERCOM_INST_NUM   6                              /**< \brief (SERCOM) Number of instances */
#define SERCOM_INSTS      { SERCOM0, SERCOM1, SERCOM2, SERCOM3, SERCOM4, SERCOM5 } /**< \brief (SERCOM) Instances List */

#define SYSCTRL_ADDR      (0x40000800U)                  /**< \brief (SYSCTRL) APB Base Address */
#define SYSCTRL           CAST(Sysctrl,   SYSCTRL_ADDR) 
#define SYSCTRL_INST_NUM  1                              /**< \brief (SYSCTRL) Number of instances */
#define SYSCTRL_INSTS     { SYSCTRL }                    /**< \brief (SYSCTRL) Instances List */

#define TC0_ADDR          (0x42002000U)                  /**< \brief (TC0) APB Base Address */
#define TC0               CAST(Tc,        TC0_ADDR)     
#define TC1_ADDR          (0x42002400U)                  /**< \brief (TC1) APB Base Address */
#define TC1               CAST(Tc,        TC1_ADDR)     
#define TC2_ADDR          (0x42002800U)                  /**< \brief (TC2) APB Base Address */
#define TC2               CAST(Tc,        TC2_ADDR)     
#define TC3_ADDR          (0x42002C00U)                  /**< \brief (TC3) APB Base Address */
#define TC3               CAST(Tc,        TC3_ADDR)     
#define TC4_ADDR          (0x42003000U)                  /**< \brief (TC4) APB Base Address */
#define TC4               CAST(Tc,        TC4_ADDR)     
#define TC5_ADDR          (0x42003400U)                  /**< \brief (TC5) APB Base Address */
#define TC5               CAST(Tc,        TC5_ADDR)     
#define TC6_ADDR          (0x42003800U)                  /**< \brief (TC6) APB Base Address */
#define TC6               CAST(Tc,        TC6_ADDR)     
#define TC7_ADDR          (0x42003C00U)                  /**< \brief (TC7) APB Base Address */
#define TC7               CAST(Tc,        TC7_ADDR)     
#define TC_INST_NUM       8                              /**< \brief (TC) Number of instances */
#define TC_INSTS          { TC0, TC1, TC2, TC3, TC4, TC5, TC6, TC7 } /**< \brief (TC) Instances List */

#define WDT_ADDR          (0x40001000U)                  /**< \brief (WDT) APB Base Address */
#define WDT               CAST(Wdt,       WDT_ADDR)     
#define WDT_INST_NUM      1                              /**< \brief (WDT) Number of instances */
#define WDT_INSTS         { WDT }                        /**< \brief (WDT) Instances List */

/*@}*/

/* ************************************************************************** */
/**  INSTANCE PARAMETERS DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_parameters Instance Parameters Definitions */
/*@{*/

/* ========== Instance parameters for AC peripheral ========== */
#define AC_GCLK_ID_ANA              25
#define AC_GCLK_ID_DIG              24
#define AC_NUM_CMP                  2
#define AC_PAIRS                    1
/* ========== Instance parameters for ADC peripheral ========== */
#define ADC_ADC_RESULT_MSB          15
#define ADC_GCLK_ID                 23
/* ========== Instance parameters for DAC peripheral ========== */
#define DAC_GCLK_ID                 26
/* ========== Instance parameters for DSU peripheral ========== */
#define DSU_CLK_HSB_ID              3
/* ========== Instance parameters for EIC peripheral ========== */
#define EIC_GCLK_ID                 3
#define EIC_NUMBER_OF_INTERRUPTS    16
/* ========== Instance parameters for EVSYS peripheral ========== */
#define EVSYS_CHANNELS              8
#define EVSYS_CHANNELS_MSB          7
#define EVSYS_EXT_EVT_MSB           0
#define EVSYS_GCLK_ID_0             4
#define EVSYS_GCLK_ID_1             5
#define EVSYS_GCLK_ID_2             6
#define EVSYS_GCLK_ID_3             7
#define EVSYS_GCLK_ID_4             8
#define EVSYS_GCLK_ID_5             9
#define EVSYS_GCLK_ID_6             10
#define EVSYS_GCLK_ID_7             11
#define EVSYS_GCLK_ID_LSB           4
#define EVSYS_GCLK_ID_MSB           11
#define EVSYS_GCLK_ID_SIZE          8
#define EVSYS_GENERATORS            49
#define EVSYS_USERS                 14

// GENERATORS
#define EVSYS_ID_GEN_RTC_CMP_0                 1
#define EVSYS_ID_GEN_RTC_CMP_1                 2
#define EVSYS_ID_GEN_RTC_OVF                   3
#define EVSYS_ID_GEN_RTC_PER_0                 4
#define EVSYS_ID_GEN_RTC_PER_1                 5
#define EVSYS_ID_GEN_RTC_PER_2                 6
#define EVSYS_ID_GEN_RTC_PER_3                 7
#define EVSYS_ID_GEN_RTC_PER_4                 8
#define EVSYS_ID_GEN_RTC_PER_5                 9
#define EVSYS_ID_GEN_RTC_PER_6                 10
#define EVSYS_ID_GEN_RTC_PER_7                 11
#define EVSYS_ID_GEN_EIC_EXTINT_0              12
#define EVSYS_ID_GEN_EIC_EXTINT_1              13
#define EVSYS_ID_GEN_EIC_EXTINT_2              14
#define EVSYS_ID_GEN_EIC_EXTINT_3              15
#define EVSYS_ID_GEN_EIC_EXTINT_4              16
#define EVSYS_ID_GEN_EIC_EXTINT_5              17
#define EVSYS_ID_GEN_EIC_EXTINT_6              18
#define EVSYS_ID_GEN_EIC_EXTINT_7              19
#define EVSYS_ID_GEN_EIC_EXTINT_8              20
#define EVSYS_ID_GEN_EIC_EXTINT_9              21
#define EVSYS_ID_GEN_EIC_EXTINT_10             22
#define EVSYS_ID_GEN_EIC_EXTINT_11             23
#define EVSYS_ID_GEN_EIC_EXTINT_12             24
#define EVSYS_ID_GEN_EIC_EXTINT_13             25
#define EVSYS_ID_GEN_EIC_EXTINT_14             26
#define EVSYS_ID_GEN_EIC_EXTINT_15             27
#define EVSYS_ID_GEN_TC0_OVF                   28
#define EVSYS_ID_GEN_TC0_MCX_0                 29
#define EVSYS_ID_GEN_TC0_MCX_1                 30
#define EVSYS_ID_GEN_TC1_OVF                   31
#define EVSYS_ID_GEN_TC1_MCX_0                 32
#define EVSYS_ID_GEN_TC1_MCX_1                 33
#define EVSYS_ID_GEN_TC2_OVF                   34
#define EVSYS_ID_GEN_TC2_MCX_0                 35
#define EVSYS_ID_GEN_TC2_MCX_1                 36
#define EVSYS_ID_GEN_TC3_OVF                   37
#define EVSYS_ID_GEN_TC3_MCX_0                 38
#define EVSYS_ID_GEN_TC3_MCX_1                 39
#define EVSYS_ID_GEN_TC4_OVF                   40
#define EVSYS_ID_GEN_TC4_MCX_0                 41
#define EVSYS_ID_GEN_TC4_MCX_1                 42
#define EVSYS_ID_GEN_TC5_OVF                   43
#define EVSYS_ID_GEN_TC5_MCX_0                 44
#define EVSYS_ID_GEN_TC5_MCX_1                 45
#define EVSYS_ID_GEN_TC6_OVF                   46
#define EVSYS_ID_GEN_TC6_MCX_0                 47
#define EVSYS_ID_GEN_TC6_MCX_1                 48
#define EVSYS_ID_GEN_TC7_OVF                   49
#define EVSYS_ID_GEN_TC7_MCX_0                 50
#define EVSYS_ID_GEN_TC7_MCX_1                 51
#define EVSYS_ID_GEN_ADC_RESRDY                52
#define EVSYS_ID_GEN_ADC_WINMON                53
#define EVSYS_ID_GEN_AC_COMP_0                 54
#define EVSYS_ID_GEN_AC_COMP_1                 55
#define EVSYS_ID_GEN_AC_WIN                    56
#define EVSYS_ID_GEN_DAC_EMPTY                 57
#define EVSYS_ID_GEN_PTC_EOC                   58
#define EVSYS_ID_GEN_PTC_WCOMP                 59

