zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
// USERS
#define EVSYS_ID_USER_TC0_EVU                  0
#define EVSYS_ID_USER_TC1_EVU                  1
#define EVSYS_ID_USER_TC2_EVU                  2
#define EVSYS_ID_USER_TC3_EVU                  3
#define EVSYS_ID_USER_TC4_EVU                  4
#define EVSYS_ID_USER_TC5_EVU                  5
#define EVSYS_ID_USER_TC6_EVU                  6
#define EVSYS_ID_USER_TC7_EVU                  7
#define EVSYS_ID_USER_ADC_START                8
#define EVSYS_ID_USER_ADC_SYNC                 9
#define EVSYS_ID_USER_AC_SOC_0                 10
#define EVSYS_ID_USER_AC_SOC_1                 11
#define EVSYS_ID_USER_DAC_START                12
#define EVSYS_ID_USER_PTC_STCONV               13
/* ========== Instance parameters for GCLK peripheral ========== */
#define GCLK_GEN_NUM_MSB            7
#define GCLK_GEN_SOURCE_NUM_MSB     7
#define GCLK_NUM                    28
#define GCLK_SOURCE_DFLL48M         7
#define GCLK_SOURCE_GCLKGEN1        2
#define GCLK_SOURCE_GCLKIN          1
#define GCLK_SOURCE_OSCULP32K       3
#define GCLK_SOURCE_OSC8M           6
#define GCLK_SOURCE_OSC32K          4
#define GCLK_SOURCE_XOSC            0
#define GCLK_SOURCE_XOSC32K         5
/* ========== Instance parameters for HMATRIX ========== */
#define HMATRIX_SLAVE_FLASH         0
#define HMATRIX_SLAVE_HPB0          1
#define HMATRIX_SLAVE_HPB1          2
#define HMATRIX_SLAVE_HPB2          3
#define HMATRIX_SLAVE_HRAMC0        4
#define HMATRIX_SLAVE_NUM           5

#define HMATRIX_MASTER_CM0P         0
#define HMATRIX_MASTER_DSU          1
#define HMATRIX_MASTER_NUM          2
/* ========== Instance parameters for NVMCTRL peripheral ========== */
#define NVMCTRL_AUX0_ADDRESS        NVMCTRL_USER_PAGE_ADDRESS + 0x00004000
#define NVMCTRL_AUX1_ADDRESS        NVMCTRL_USER_PAGE_ADDRESS + 0x00006000
#define NVMCTRL_AUX2_ADDRESS        NVMCTRL_USER_PAGE_ADDRESS + 0x00008000
#define NVMCTRL_AUX3_ADDRESS        NVMCTRL_USER_PAGE_ADDRESS + 0x0000A000
#define NVMCTRL_CALIB_OFFSET        0x00000000
#define NVMCTRL_CALIB_SHADOW_ADDRESS NVMCTRL_USER_PAGE_ADDRESS + 0x00020000
#define NVMCTRL_CLK_AHB_ID          4
#define NVMCTRL_FACTORY_WORD_IMPLEMENTED_MASK 0XC0000007FFFFFFFF
#define NVMCTRL_FLASH_SIZE          NVMCTRL_PAGES*NVMCTRL_PAGE_SIZE
#define NVMCTRL_GCLK_ID             12
#define NVMCTRL_LOCKBIT_ADDRESS     NVMCTRL_USER_PAGE_ADDRESS + 0x00002000
#define NVMCTRL_PAGES               4096
#define NVMCTRL_PAGE_HW             NVMCTRL_PAGE_SIZE/2
#define NVMCTRL_PAGE_SIZE           (1<<NVMCTRL_PSZ_BITS)
#define NVMCTRL_PAGE_W              NVMCTRL_PAGE_SIZE/4
#define NVMCTRL_PMSB                3
#define NVMCTRL_PSZ_BITS            6
#define NVMCTRL_ROM_ADDRESS         NVMCTRL_USER_PAGE_ADDRESS + 0x00030000
#define NVMCTRL_ROW_PAGES           NVMCTRL_ROW_SIZE/NVMCTRL_PAGE_SIZE
#define NVMCTRL_ROW_SIZE            NVMCTRL_PAGE_SIZE*4
#define NVMCTRL_TLATCH_ADDRESS      NVMCTRL_USER_PAGE_ADDRESS + 0x00010000
#define NVMCTRL_USER_PAGE_ADDRESS   FLASH_ADDR + NVMCTRL_USER_PAGE_OFFSET
#define NVMCTRL_USER_PAGE_OFFSET    0x00800000
#define NVMCTRL_USER_WORD_IMPLEMENTED_MASK 0XC01FFFFFFFFFFFFF
/* ========== Instance parameters for PAC0 peripheral ========== */
#define PAC0_WPROT_DEFAULT_VAL      0x00000000
/* ========== Instance parameters for PAC1 peripheral ========== */
#define PAC1_WPROT_DEFAULT_VAL      0x00000002
/* ========== Instance parameters for PAC2 peripheral ========== */
#define PAC2_WPROT_DEFAULT_VAL      0x00100000
/* ========== Instance parameters for PM peripheral ========== */
#define PM_CTRL_MCSEL_DFLL48M       2
#define PM_CTRL_MCSEL_GCLK          3
#define PM_CTRL_MCSEL_OSC8M         0
#define PM_CTRL_MCSEL_XOSC          1
#define PM_PM_CLK_AHB_PEVC          0
#define PM_PM_CLK_APB_NUM           2
#define PM_                         
/* ========== Instance parameters for PORT peripheral ========== */
#define PORT_BITS                   60
#define PORT_DIR_DEFAULT_VAL        { 0x00000000, 0x00000000 }
#define PORT_DIR_IMPLEMENTED        { 0xFF0FFFFF, 0x0FFF3FFF }
#define PORT_DRVSTR_DEFAULT_VAL     { 0x00000000, 0x00000000 }
#define PORT_DRVSTR_IMPLEMENTED     { 0x00000000, 0x00000000 }
#define PORT_GROUPS                 2
#define PORT_INEN_DEFAULT_VAL       { 0x00000000, 0x00000000 }
#define PORT_INEN_IMPLEMENTED       { 0xFF0FFFFF, 0x0FFF3FFF }
#define PORT_ODRAIN_DEFAULT_VAL     { 0x00000000, 0x00000000 }
#define PORT_ODRAIN_IMPLEMENTED     { 0x00000000, 0x00000000 }
#define PORT_OUT_DEFAULT_VAL        { 0x00000000, 0x00000000 }
#define PORT_OUT_IMPLEMENTED        { 0xFF0FFFFF, 0x0FFF3FFF }
#define PORT_PIN_IMPLEMENTED        { 0xFF0FFFFF, 0x0FFF3FFF }
#define PORT_PMUXBIT0_DEFAULT_VAL   { 0x10000000, 0x00000000 }
#define PORT_PMUXBIT0_IMPLEMENTED   { 0xDF0FFFFF, 0x0FFF0FFF }
#define PORT_PMUXBIT1_DEFAULT_VAL   { 0x00000000, 0x00000000 }
#define PORT_PMUXBIT1_IMPLEMENTED   { 0xDF0FFFFF, 0x0FFF3FFF }
#define PORT_PMUXBIT2_DEFAULT_VAL   { 0x10000000, 0x00000000 }
#define PORT_PMUXBIT2_IMPLEMENTED   { 0x9F0FFCFF, 0x0FF330FF }
#define PORT_PMUXBIT3_DEFAULT_VAL   { 0x00000000, 0x00000000 }
#define PORT_PMUXBIT3_IMPLEMENTED   { 0x00000000, 0x00000000 }
#define PORT_PMUXEN_DEFAULT_VAL     { 0x10F00000, 0x0000C000 }
#define PORT_PMUXEN_IMPLEMENTED     { 0xFF0FFFFF, 0x0FFF3FFF }
#define PORT_PULLDOWN_DEFAULT_VAL   { 0x00000000, 0x00000000 }
#define PORT_PULLDOWN_IMPLEMENTED   { 0xFFFFFFFF, 0x0FFFFFFF }
#define PORT_PULLEN_DEFAULT_VAL     { 0x00000000, 0x00000000 }
#define PORT_PULLEN_IMPLEMENTED     { 0xFF0FFFFF, 0x0FFF3FFF }
#define PORT_PULLUP_DEFAULT_VAL     { 0x00000000, 0x00000000 }
#define PORT_PULLUP_IMPLEMENTED     { 0x0FFFFFFF, 0x0FFFFFFF }
#define PORT_SLEWLIM_DEFAULT_VAL    { 0x00000000, 0x00000000 }
#define PORT_SLEWLIM_IMPLEMENTED    { 0x00000000, 0x00000000 }
/* ========== Instance parameters for PTC peripheral ========== */
#define PTC_GCLK_ID                 27
/* ========== Instance parameters for RTC peripheral ========== */
#define RTC_GCLK_ID                 2
#define RTC_NUM_OF_ALARMS           1
#define RTC_NUM_OF_COMP16           2
/* ========== Instance parameters for SERCOM0 peripheral ========== */
#define SERCOM0_GCLK_ID_CORE        13
#define SERCOM0_GCLK_ID_SLOW        12
#define SERCOM0_INT_MSB             3
#define SERCOM0_PMSB                3
/* ========== Instance parameters for SERCOM1 peripheral ========== */
#define SERCOM1_GCLK_ID_CORE        14
#define SERCOM1_GCLK_ID_SLOW        12
#define SERCOM1_INT_MSB             3
#define SERCOM1_PMSB                3
/* ========== Instance parameters for SERCOM2 peripheral ========== */
#define SERCOM2_GCLK_ID_CORE        15
#define SERCOM2_GCLK_ID_SLOW        12
#define SERCOM2_INT_MSB             3
#define SERCOM2_PMSB                3
/* ========== Instance parameters for SERCOM3 peripheral ========== */
#define SERCOM3_GCLK_ID_CORE        16
#define SERCOM3_GCLK_ID_SLOW        12
#define SERCOM3_INT_MSB             3
#define SERCOM3_PMSB                3
/* ========== Instance parameters for SERCOM4 peripheral ========== */
#define SERCOM4_GCLK_ID_CORE        17
#define SERCOM4_GCLK_ID_SLOW        12
#define SERCOM4_INT_MSB             3
#define SERCOM4_PMSB                3
/* ========== Instance parameters for SERCOM5 peripheral ========== */
#define SERCOM5_GCLK_ID_CORE        18
#define SERCOM5_GCLK_ID_SLOW        12
#define SERCOM5_INT_MSB             3
#define SERCOM5_PMSB                3
/* ========== Instance parameters for SYSCTRL peripheral ========== */
#define SYSCTRL_BGAP_CALIB_MSB      11
#define SYSCTRL_BOD12_CALIB_MSB     4
#define SYSCTRL_BOD33_CALIB_MSB     5
#define SYSCTRL_DFLL48M_COARSE_MSB  4
#define SYSCTRL_DFLL48M_FINE_MSB    7
#define SYSCTRL_DFLL48M_TESTEN_MSB  1
#define SYSCTRL_GCLK_ID_DFLL48      0
#define SYSCTRL_OSC32K_COARSE_CALIB_MSB 6
#define SYSCTRL_POR33_ENTEST_MSB    1
#define SYSCTRL_ULPVREF_DIVLEV_MSB  3
#define SYSCTRL_ULPVREG_FORCEGAIN_MSB 1
#define SYSCTRL_ULPVREG_RAMREFSEL_MSB 2
#define SYSCTRL_VREF_CONTROL_MSB    48
#define SYSCTRL_VREF_STATUS_MSB     7
#define SYSCTRL_VREG_LEVEL_MSB      2
#define SYSCTRL_BOD12_VERSION       0x100
#define SYSCTRL_BOD33_VERSION       0x100
#define SYSCTRL_DFLL48M_VERSION     0x100
#define SYSCTRL_GCLK_VERSION        0x100
#define SYSCTRL_OSCULP32K_VERSION   0x100
#define SYSCTRL_OSC8M_VERSION       0x100
#define SYSCTRL_OSC32K_VERSION      0x100
#define SYSCTRL_VREF_VERSION        0x100
#define SYSCTRL_VREG_VERSION        0x100
#define SYSCTRL_XOSC_VERSION        0x100
#define SYSCTRL_XOSC32K_VERSION     0x100
/* ========== Instance parameters for TC0 peripheral ========== */
#define TC0_CC8_NUM                 2
#define TC0_CC16_NUM                2
#define TC0_CC32_NUM                2
#define TC0_GCLK_ID                 19
#define TC0_OW_NUM                  2
/* ========== Instance parameters for TC1 peripheral ========== */
#define TC1_CC8_NUM                 2
#define TC1_CC16_NUM                2
#define TC1_CC32_NUM                2
#define TC1_GCLK_ID                 19
#define TC1_OW_NUM                  2
/* ========== Instance parameters for TC2 peripheral ========== */
#define TC2_CC8_NUM                 2
#define TC2_CC16_NUM                2
#define TC2_CC32_NUM                2
#define TC2_GCLK_ID                 20
#define TC2_OW_NUM                  2
/* ========== Instance parameters for TC3 peripheral ========== */
#define TC3_CC8_NUM                 2
#define TC3_CC16_NUM                2
#define TC3_CC32_NUM                2
#define TC3_GCLK_ID                 20
#define TC3_OW_NUM                  2
/* ========== Instance parameters for TC4 peripheral ========== */
#define TC4_CC8_NUM                 2
#define TC4_CC16_NUM                2
#define TC4_CC32_NUM                2
#define TC4_GCLK_ID                 21
#define TC4_OW_NUM                  2
/* ========== Instance parameters for TC5 peripheral ========== */
#define TC5_CC8_NUM                 2
#define TC5_CC16_NUM                2
#define TC5_CC32_NUM                2
#define TC5_GCLK_ID                 21
#define TC5_OW_NUM                  2
/* ========== Instance parameters for TC6 peripheral ========== */
#define TC6_CC8_NUM                 2
#define TC6_CC16_NUM                2
#define TC6_CC32_NUM                2
#define TC6_GCLK_ID                 22
#define TC6_OW_NUM                  2
/* ========== Instance parameters for TC7 peripheral ========== */
#define TC7_CC8_NUM                 2
#define TC7_CC16_NUM                2
#define TC7_CC32_NUM                2
#define TC7_GCLK_ID                 22
#define TC7_OW_NUM                  2
/* ========== Instance parameters for WDT peripheral ========== */
#define WDT_GCLK_ID                 1

/*@}*/

/* ************************************************************************** */
/**  PORT DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */
/** \addtogroup SAM0+D_port PORT Definitions */
/*@{*/

