zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define PIN_PA00                           0  /**< \brief Pin Number for PA00 */
#define PORT_PA00                  (1u <<  0) /**< \brief PORT Mask  for PA00 */
#define PIN_PA01                           1  /**< \brief Pin Number for PA01 */
#define PORT_PA01                  (1u <<  1) /**< \brief PORT Mask  for PA01 */
#define PIN_PA02                           2  /**< \brief Pin Number for PA02 */
#define PORT_PA02                  (1u <<  2) /**< \brief PORT Mask  for PA02 */
#define PIN_PA03                           3  /**< \brief Pin Number for PA03 */
#define PORT_PA03                  (1u <<  3) /**< \brief PORT Mask  for PA03 */
#define PIN_PA04                           4  /**< \brief Pin Number for PA04 */
#define PORT_PA04                  (1u <<  4) /**< \brief PORT Mask  for PA04 */
#define PIN_PA05                           5  /**< \brief Pin Number for PA05 */
#define PORT_PA05                  (1u <<  5) /**< \brief PORT Mask  for PA05 */
#define PIN_PA06                           6  /**< \brief Pin Number for PA06 */
#define PORT_PA06                  (1u <<  6) /**< \brief PORT Mask  for PA06 */
#define PIN_PA07                           7  /**< \brief Pin Number for PA07 */
#define PORT_PA07                  (1u <<  7) /**< \brief PORT Mask  for PA07 */
#define PIN_PA08                           8  /**< \brief Pin Number for PA08 */
#define PORT_PA08                  (1u <<  8) /**< \brief PORT Mask  for PA08 */
#define PIN_PA09                           9  /**< \brief Pin Number for PA09 */
#define PORT_PA09                  (1u <<  9) /**< \brief PORT Mask  for PA09 */
#define PIN_PA10                          10  /**< \brief Pin Number for PA10 */
#define PORT_PA10                  (1u << 10) /**< \brief PORT Mask  for PA10 */
#define PIN_PA11                          11  /**< \brief Pin Number for PA11 */
#define PORT_PA11                  (1u << 11) /**< \brief PORT Mask  for PA11 */
#define PIN_PA12                          12  /**< \brief Pin Number for PA12 */
#define PORT_PA12                  (1u << 12) /**< \brief PORT Mask  for PA12 */
#define PIN_PA13                          13  /**< \brief Pin Number for PA13 */
#define PORT_PA13                  (1u << 13) /**< \brief PORT Mask  for PA13 */
#define PIN_PA14                          14  /**< \brief Pin Number for PA14 */
#define PORT_PA14                  (1u << 14) /**< \brief PORT Mask  for PA14 */
#define PIN_PA15                          15  /**< \brief Pin Number for PA15 */
#define PORT_PA15                  (1u << 15) /**< \brief PORT Mask  for PA15 */
#define PIN_PA16                          16  /**< \brief Pin Number for PA16 */
#define PORT_PA16                  (1u << 16) /**< \brief PORT Mask  for PA16 */
#define PIN_PA17                          17  /**< \brief Pin Number for PA17 */
#define PORT_PA17                  (1u << 17) /**< \brief PORT Mask  for PA17 */
#define PIN_PA18                          18  /**< \brief Pin Number for PA18 */
#define PORT_PA18                  (1u << 18) /**< \brief PORT Mask  for PA18 */
#define PIN_PA19                          19  /**< \brief Pin Number for PA19 */
#define PORT_PA19                  (1u << 19) /**< \brief PORT Mask  for PA19 */
#define PIN_PA24                          24  /**< \brief Pin Number for PA24 */
#define PORT_PA24                  (1u << 24) /**< \brief PORT Mask  for PA24 */
#define PIN_PA25                          25  /**< \brief Pin Number for PA25 */
#define PORT_PA25                  (1u << 25) /**< \brief PORT Mask  for PA25 */
#define PIN_PA26                          26  /**< \brief Pin Number for PA26 */
#define PORT_PA26                  (1u << 26) /**< \brief PORT Mask  for PA26 */
#define PIN_PA27                          27  /**< \brief Pin Number for PA27 */
#define PORT_PA27                  (1u << 27) /**< \brief PORT Mask  for PA27 */
#define PIN_PA28                          28  /**< \brief Pin Number for PA28 */
#define PORT_PA28                  (1u << 28) /**< \brief PORT Mask  for PA28 */
#define PIN_PA29                          29  /**< \brief Pin Number for PA29 */
#define PORT_PA29                  (1u << 29) /**< \brief PORT Mask  for PA29 */
#define PIN_PA30                          30  /**< \brief Pin Number for PA30 */
#define PORT_PA30                  (1u << 30) /**< \brief PORT Mask  for PA30 */
#define PIN_PA31                          31  /**< \brief Pin Number for PA31 */
#define PORT_PA31                  (1u << 31) /**< \brief PORT Mask  for PA31 */
#define PIN_PB00                          32  /**< \brief Pin Number for PB00 */
#define PORT_PB00                  (1u <<  0) /**< \brief PORT Mask  for PB00 */
#define PIN_PB01                          33  /**< \brief Pin Number for PB01 */
#define PORT_PB01                  (1u <<  1) /**< \brief PORT Mask  for PB01 */
#define PIN_PB02                          34  /**< \brief Pin Number for PB02 */
#define PORT_PB02                  (1u <<  2) /**< \brief PORT Mask  for PB02 */
#define PIN_PB03                          35  /**< \brief Pin Number for PB03 */
#define PORT_PB03                  (1u <<  3) /**< \brief PORT Mask  for PB03 */
#define PIN_PB04                          36  /**< \brief Pin Number for PB04 */
#define PORT_PB04                  (1u <<  4) /**< \brief PORT Mask  for PB04 */
#define PIN_PB05                          37  /**< \brief Pin Number for PB05 */
#define PORT_PB05                  (1u <<  5) /**< \brief PORT Mask  for PB05 */
#define PIN_PB06                          38  /**< \brief Pin Number for PB06 */
#define PORT_PB06                  (1u <<  6) /**< \brief PORT Mask  for PB06 */
#define PIN_PB07                          39  /**< \brief Pin Number for PB07 */
#define PORT_PB07                  (1u <<  7) /**< \brief PORT Mask  for PB07 */
#define PIN_PB08                          40  /**< \brief Pin Number for PB08 */
#define PORT_PB08                  (1u <<  8) /**< \brief PORT Mask  for PB08 */
#define PIN_PB09                          41  /**< \brief Pin Number for PB09 */
#define PORT_PB09                  (1u <<  9) /**< \brief PORT Mask  for PB09 */
#define PIN_PB10                          42  /**< \brief Pin Number for PB10 */
#define PORT_PB10                  (1u << 10) /**< \brief PORT Mask  for PB10 */
#define PIN_PB11                          43  /**< \brief Pin Number for PB11 */
#define PORT_PB11                  (1u << 11) /**< \brief PORT Mask  for PB11 */
#define PIN_PB12                          44  /**< \brief Pin Number for PB12 */
#define PORT_PB12                  (1u << 12) /**< \brief PORT Mask  for PB12 */
#define PIN_PB13                          45  /**< \brief Pin Number for PB13 */
#define PORT_PB13                  (1u << 13) /**< \brief PORT Mask  for PB13 */
#define PIN_PB16                          48  /**< \brief Pin Number for PB16 */
#define PORT_PB16                  (1u << 16) /**< \brief PORT Mask  for PB16 */
#define PIN_PB17                          49  /**< \brief Pin Number for PB17 */
#define PORT_PB17                  (1u << 17) /**< \brief PORT Mask  for PB17 */
#define PIN_PB18                          50  /**< \brief Pin Number for PB18 */
#define PORT_PB18                  (1u << 18) /**< \brief PORT Mask  for PB18 */
#define PIN_PB19                          51  /**< \brief Pin Number for PB19 */
#define PORT_PB19                  (1u << 19) /**< \brief PORT Mask  for PB19 */
#define PIN_PB20                          52  /**< \brief Pin Number for PB20 */
#define PORT_PB20                  (1u << 20) /**< \brief PORT Mask  for PB20 */
#define PIN_PB21                          53  /**< \brief Pin Number for PB21 */
#define PORT_PB21                  (1u << 21) /**< \brief PORT Mask  for PB21 */
#define PIN_PB22                          54  /**< \brief Pin Number for PB22 */
#define PORT_PB22                  (1u << 22) /**< \brief PORT Mask  for PB22 */
#define PIN_PB23                          55  /**< \brief Pin Number for PB23 */
#define PORT_PB23                  (1u << 23) /**< \brief PORT Mask  for PB23 */
#define PIN_PB24                          56  /**< \brief Pin Number for PB24 */
#define PORT_PB24                  (1u << 24) /**< \brief PORT Mask  for PB24 */
#define PIN_PB25                          57  /**< \brief Pin Number for PB25 */
#define PORT_PB25                  (1u << 25) /**< \brief PORT Mask  for PB25 */
#define PIN_PB26                          58  /**< \brief Pin Number for PB26 */
#define PORT_PB26                  (1u << 26) /**< \brief PORT Mask  for PB26 */
#define PIN_PB27                          59  /**< \brief Pin Number for PB27 */
#define PORT_PB27                  (1u << 27) /**< \brief PORT Mask  for PB27 */
/* ========== PORT definition for AC peripheral ========== */
#define PIN_AC_AIN0_PA04H                  4  /**< \brief AC signal: AIN0 on PA04 mux H */
#define MUX_AC_AIN0_PA04H                  7
#define PINMUX_AC_AIN0_PA04H       ((PIN_AC_AIN0_PA04H << 16) | MUX_AC_AIN0_PA04H)
#define PORT_AC_AIN0_PA04H         (1u <<  4)
#define PIN_AC_AIN1_PA05H                  5  /**< \brief AC signal: AIN1 on PA05 mux H */
#define MUX_AC_AIN1_PA05H                  7
#define PINMUX_AC_AIN1_PA05H       ((PIN_AC_AIN1_PA05H << 16) | MUX_AC_AIN1_PA05H)
#define PORT_AC_AIN1_PA05H         (1u <<  5)
#define PIN_AC_AIN2_PA06H                  6  /**< \brief AC signal: AIN2 on PA06 mux H */
#define MUX_AC_AIN2_PA06H                  7
#define PINMUX_AC_AIN2_PA06H       ((PIN_AC_AIN2_PA06H << 16) | MUX_AC_AIN2_PA06H)
#define PORT_AC_AIN2_PA06H         (1u <<  6)
#define PIN_AC_AIN3_PA07H                  7  /**< \brief AC signal: AIN3 on PA07 mux H */
#define MUX_AC_AIN3_PA07H                  7
#define PINMUX_AC_AIN3_PA07H       ((PIN_AC_AIN3_PA07H << 16) | MUX_AC_AIN3_PA07H)
#define PORT_AC_AIN3_PA07H         (1u <<  7)
#define PIN_AC_CMP0_PA10G                 10  /**< \brief AC signal: CMP0 on PA10 mux G */
#define MUX_AC_CMP0_PA10G                  6
#define PINMUX_AC_CMP0_PA10G       ((PIN_AC_CMP0_PA10G << 16) | MUX_AC_CMP0_PA10G)
#define PORT_AC_CMP0_PA10G         (1u << 10)
#define PIN_AC_CMP0_PA12G                 12  /**< \brief AC signal: CMP0 on PA12 mux G */
#define MUX_AC_CMP0_PA12G                  6
#define PINMUX_AC_CMP0_PA12G       ((PIN_AC_CMP0_PA12G << 16) | MUX_AC_CMP0_PA12G)
#define PORT_AC_CMP0_PA12G         (1u << 12)
#define PIN_AC_CMP1_PA11G                 11  /**< \brief AC signal: CMP1 on PA11 mux G */
#define MUX_AC_CMP1_PA11G                  6
#define PINMUX_AC_CMP1_PA11G       ((PIN_AC_CMP1_PA11G << 16) | MUX_AC_CMP1_PA11G)
#define PORT_AC_CMP1_PA11G         (1u << 11)
#define PIN_AC_CMP1_PA13G                 13  /**< \brief AC signal: CMP1 on PA13 mux G */
#define MUX_AC_CMP1_PA13G                  6
#define PINMUX_AC_CMP1_PA13G       ((PIN_AC_CMP1_PA13G << 16) | MUX_AC_CMP1_PA13G)
#define PORT_AC_CMP1_PA13G         (1u << 13)
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_ADC_AIN0_PA00H                 0  /**< \brief ADC signal: AIN0 on PA00 mux H */
#define MUX_ADC_AIN0_PA00H                 7
#define PINMUX_ADC_AIN0_PA00H      ((PIN_ADC_AIN0_PA00H << 16) | MUX_ADC_AIN0_PA00H)
#define PORT_ADC_AIN0_PA00H        (1u <<  0)
#define PIN_ADC_AIN1_PA01H                 1  /**< \brief ADC signal: AIN1 on PA01 mux H */
#define MUX_ADC_AIN1_PA01H                 7
#define PINMUX_ADC_AIN1_PA01H      ((PIN_ADC_AIN1_PA01H << 16) | MUX_ADC_AIN1_PA01H)
#define PORT_ADC_AIN1_PA01H        (1u <<  1)
#define PIN_ADC_AIN2_PA02H                 2  /**< \brief ADC signal: AIN2 on PA02 mux H */
#define MUX_ADC_AIN2_PA02H                 7
#define PINMUX_ADC_AIN2_PA02H      ((PIN_ADC_AIN2_PA02H << 16) | MUX_ADC_AIN2_PA02H)
#define PORT_ADC_AIN2_PA02H        (1u <<  2)
#define PIN_ADC_AIN3_PA03H                 3  /**< \brief ADC signal: AIN3 on PA03 mux H */
#define MUX_ADC_AIN3_PA03H                 7
#define PINMUX_ADC_AIN3_PA03H      ((PIN_ADC_AIN3_PA03H << 16) | MUX_ADC_AIN3_PA03H)
#define PORT_ADC_AIN3_PA03H        (1u <<  3)
#define PIN_ADC_AIN4_PA04H                 4  /**< \brief ADC signal: AIN4 on PA04 mux H */
#define MUX_ADC_AIN4_PA04H                 7
#define PINMUX_ADC_AIN4_PA04H      ((PIN_ADC_AIN4_PA04H << 16) | MUX_ADC_AIN4_PA04H)
#define PORT_ADC_AIN4_PA04H        (1u <<  4)
#define PIN_ADC_AIN5_PA05H                 5  /**< \brief ADC signal: AIN5 on PA05 mux H */
#define MUX_ADC_AIN5_PA05H                 7
#define PINMUX_ADC_AIN5_PA05H      ((PIN_ADC_AIN5_PA05H << 16) | MUX_ADC_AIN5_PA05H)
#define PORT_ADC_AIN5_PA05H        (1u <<  5)
#define PIN_ADC_AIN6_PA06H                 6  /**< \brief ADC signal: AIN6 on PA06 mux H */
#define MUX_ADC_AIN6_PA06H                 7
#define PINMUX_ADC_AIN6_PA06H      ((PIN_ADC_AIN6_PA06H << 16) | MUX_ADC_AIN6_PA06H)
#define PORT_ADC_AIN6_PA06H        (1u <<  6)
#define PIN_ADC_AIN7_PA07H                 7  /**< \brief ADC signal: AIN7 on PA07 mux H */
#define MUX_ADC_AIN7_PA07H                 7
#define PINMUX_ADC_AIN7_PA07H      ((PIN_ADC_AIN7_PA07H << 16) | MUX_ADC_AIN7_PA07H)
#define PORT_ADC_AIN7_PA07H        (1u <<  7)
#define PIN_ADC_AIN8_PB00H                32  /**< \brief ADC signal: AIN8 on PB00 mux H */
#define MUX_ADC_AIN8_PB00H                 7
#define PINMUX_ADC_AIN8_PB00H      ((PIN_ADC_AIN8_PB00H << 16) | MUX_ADC_AIN8_PB00H)
#define PORT_ADC_AIN8_PB00H        (1u <<  0)
#define PIN_ADC_AIN9_PB01H                33  /**< \brief ADC signal: AIN9 on PB01 mux H */
#define MUX_ADC_AIN9_PB01H                 7
#define PINMUX_ADC_AIN9_PB01H      ((PIN_ADC_AIN9_PB01H << 16) | MUX_ADC_AIN9_PB01H)
#define PORT_ADC_AIN9_PB01H        (1u <<  1)
#define PIN_ADC_AIN10_PB02H               34  /**< \brief ADC signal: AIN10 on PB02 mux H */
#define MUX_ADC_AIN10_PB02H                7
#define PINMUX_ADC_AIN10_PB02H     ((PIN_ADC_AIN10_PB02H << 16) | MUX_ADC_AIN10_PB02H)
#define PORT_ADC_AIN10_PB02H       (1u <<  2)
#define PIN_ADC_AIN11_PB03H               35  /**< \brief ADC signal: AIN11 on PB03 mux H */
#define MUX_ADC_AIN11_PB03H                7
#define PINMUX_ADC_AIN11_PB03H     ((PIN_ADC_AIN11_PB03H << 16) | MUX_ADC_AIN11_PB03H)
#define PORT_ADC_AIN11_PB03H       (1u <<  3)
#define PIN_ADC_AIN12_PB04H               36  /**< \brief ADC signal: AIN12 on PB04 mux H */
#define MUX_ADC_AIN12_PB04H                7
#define PINMUX_ADC_AIN12_PB04H     ((PIN_ADC_AIN12_PB04H << 16) | MUX_ADC_AIN12_PB04H)
#define PORT_ADC_AIN12_PB04H       (1u <<  4)
#define PIN_ADC_AIN13_PB05H               37  /**< \brief ADC signal: AIN13 on PB05 mux H */
#define MUX_ADC_AIN13_PB05H                7
#define PINMUX_ADC_AIN13_PB05H     ((PIN_ADC_AIN13_PB05H << 16) | MUX_ADC_AIN13_PB05H)
#define PORT_ADC_AIN13_PB05H       (1u <<  5)
#define PIN_ADC_AIN14_PB06H               38  /**< \brief ADC signal: AIN14 on PB06 mux H */
#define MUX_ADC_AIN14_PB06H                7
#define PINMUX_ADC_AIN14_PB06H     ((PIN_ADC_AIN14_PB06H << 16) | MUX_ADC_AIN14_PB06H)
#define PORT_ADC_AIN14_PB06H       (1u <<  6)
#define PIN_ADC_AIN15_PB07H               39  /**< \brief ADC signal: AIN15 on PB07 mux H */
#define MUX_ADC_AIN15_PB07H                7
#define PINMUX_ADC_AIN15_PB07H     ((PIN_ADC_AIN15_PB07H << 16) | MUX_ADC_AIN15_PB07H)
#define PORT_ADC_AIN15_PB07H       (1u <<  7)
#define PIN_ADC_VREFP_PA02H                2  /**< \brief ADC signal: VREFP on PA02 mux H */
#define MUX_ADC_VREFP_PA02H                7
#define PINMUX_ADC_VREFP_PA02H     ((PIN_ADC_VREFP_PA02H << 16) | MUX_ADC_VREFP_PA02H)
#define PORT_ADC_VREFP_PA02H       (1u <<  2)
/* ========== PORT definition for CORE peripheral ========== */
#define PIN_CORE_SWCLK_PA28F              28  /**< \brief CORE signal: SWCLK on PA28 mux F */
#define MUX_CORE_SWCLK_PA28F               5
#define PINMUX_CORE_SWCLK_PA28F    ((PIN_CORE_SWCLK_PA28F << 16) | MUX_CORE_SWCLK_PA28F)
#define PORT_CORE_SWCLK_PA28F      (1u << 28)
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_DAC_VOUT_PA00H                 0  /**< \brief DAC signal: VOUT on PA00 mux H */
#define MUX_DAC_VOUT_PA00H                 7
#define PINMUX_DAC_VOUT_PA00H      ((PIN_DAC_VOUT_PA00H << 16) | MUX_DAC_VOUT_PA00H)
#define PORT_DAC_VOUT_PA00H        (1u <<  0)
#define PIN_DAC_VREFP_PA01H                1  /**< \brief DAC signal: VREFP on PA01 mux H */
#define MUX_DAC_VREFP_PA01H                7
#define PINMUX_DAC_VREFP_PA01H     ((PIN_DAC_VREFP_PA01H << 16) | MUX_DAC_VREFP_PA01H)
#define PORT_DAC_VREFP_PA01H       (1u <<  1)
/* ========== PORT definition for EIC peripheral ========== */
#define PIN_EIC_EXTINT0_PA00A              0  /**< \brief EIC signal: EXTINT0 on PA00 mux A */
#define MUX_EIC_EXTINT0_PA00A              0
#define PINMUX_EIC_EXTINT0_PA00A   ((PIN_EIC_EXTINT0_PA00A << 16) | MUX_EIC_EXTINT0_PA00A)
#define PORT_EIC_EXTINT0_PA00A     (1u <<  0)
#define PIN_EIC_EXTINT0_PB00A             32  /**< \brief EIC signal: EXTINT0 on PB00 mux A */
#define MUX_EIC_EXTINT0_PB00A              0
#define PINMUX_EIC_EXTINT0_PB00A   ((PIN_EIC_EXTINT0_PB00A << 16) | MUX_EIC_EXTINT0_PB00A)
#define PORT_EIC_EXTINT0_PB00A     (1u <<  0)
#define PIN_EIC_EXTINT0_PB20A             52  /**< \brief EIC signal: EXTINT0 on PB20 mux A */
#define MUX_EIC_EXTINT0_PB20A              0
#define PINMUX_EIC_EXTINT0_PB20A   ((PIN_EIC_EXTINT0_PB20A << 16) | MUX_EIC_EXTINT0_PB20A)
#define PORT_EIC_EXTINT0_PB20A     (1u << 20)
#define PIN_EIC_EXTINT1_PA01A              1  /**< \brief EIC signal: EXTINT1 on PA01 mux A */
#define MUX_EIC_EXTINT1_PA01A              0
#define PINMUX_EIC_EXTINT1_PA01A   ((PIN_EIC_EXTINT1_PA01A << 16) | MUX_EIC_EXTINT1_PA01A)
#define PORT_EIC_EXTINT1_PA01A     (1u <<  1)
#define PIN_EIC_EXTINT1_PB01A             33  /**< \brief EIC signal: EXTINT1 on PB01 mux A */
#define MUX_EIC_EXTINT1_PB01A              0
#define PINMUX_EIC_EXTINT1_PB01A   ((PIN_EIC_EXTINT1_PB01A << 16) | MUX_EIC_EXTINT1_PB01A)
#define PORT_EIC_EXTINT1_PB01A     (1u <<  1)
#define PIN_EIC_EXTINT1_PB21A             53  /**< \brief EIC signal: EXTINT1 on PB21 mux A */
#define MUX_EIC_EXTINT1_PB21A              0
#define PINMUX_EIC_EXTINT1_PB21A   ((PIN_EIC_EXTINT1_PB21A << 16) | MUX_EIC_EXTINT1_PB21A)
#define PORT_EIC_EXTINT1_PB21A     (1u << 21)
#define PIN_EIC_EXTINT2_PA04A              4  /**< \brief EIC signal: EXTINT2 on PA04 mux A */
#define MUX_EIC_EXTINT2_PA04A              0
#define PINMUX_EIC_EXTINT2_PA04A   ((PIN_EIC_EXTINT2_PA04A << 16) | MUX_EIC_EXTINT2_PA04A)
#define PORT_EIC_EXTINT2_PA04A     (1u <<  4)
#define PIN_EIC_EXTINT2_PB04A             36  /**< \brief EIC signal: EXTINT2 on PB04 mux A */
#define MUX_EIC_EXTINT2_PB04A              0
#define PINMUX_EIC_EXTINT2_PB04A   ((PIN_EIC_EXTINT2_PB04A << 16) | MUX_EIC_EXTINT2_PB04A)
#define PORT_EIC_EXTINT2_PB04A     (1u <<  4)
#define PIN_EIC_EXTINT2_PB22A             54  /**< \brief EIC signal: EXTINT2 on PB22 mux A */
#define MUX_EIC_EXTINT2_PB22A              0
#define PINMUX_EIC_EXTINT2_PB22A   ((PIN_EIC_EXTINT2_PB22A << 16) | MUX_EIC_EXTINT2_PB22A)
#define PORT_EIC_EXTINT2_PB22A     (1u << 22)
#define PIN_EIC_EXTINT3_PA05A              5  /**< \brief EIC signal: EXTINT3 on PA05 mux A */
#define MUX_EIC_EXTINT3_PA05A              0
#define PINMUX_EIC_EXTINT3_PA05A   ((PIN_EIC_EXTINT3_PA05A << 16) | MUX_EIC_EXTINT3_PA05A)
#define PORT_EIC_EXTINT3_PA05A     (1u <<  5)
#define PIN_EIC_EXTINT3_PB05A             37  /**< \brief EIC signal: EXTINT3 on PB05 mux A */
#define MUX_EIC_EXTINT3_PB05A              0
#define PINMUX_EIC_EXTINT3_PB05A   ((PIN_EIC_EXTINT3_PB05A << 16) | MUX_EIC_EXTINT3_PB05A)
#define PORT_EIC_EXTINT3_PB05A     (1u <<  5)
#define PIN_EIC_EXTINT3_PB23A             55  /**< \brief EIC signal: EXTINT3 on PB23 mux A */
#define MUX_EIC_EXTINT3_PB23A              0
#define PINMUX_EIC_EXTINT3_PB23A   ((PIN_EIC_EXTINT3_PB23A << 16) | MUX_EIC_EXTINT3_PB23A)
#define PORT_EIC_EXTINT3_PB23A     (1u << 23)
#define PIN_EIC_EXTINT4_PA08A              8  /**< \brief EIC signal: EXTINT4 on PA08 mux A */
#define MUX_EIC_EXTINT4_PA08A              0
#define PINMUX_EIC_EXTINT4_PA08A   ((PIN_EIC_EXTINT4_PA08A << 16) | MUX_EIC_EXTINT4_PA08A)
#define PORT_EIC_EXTINT4_PA08A     (1u <<  8)
#define PIN_EIC_EXTINT4_PA28A             28  /**< \brief EIC signal: EXTINT4 on PA28 mux A */
#define MUX_EIC_EXTINT4_PA28A              0
#define PINMUX_EIC_EXTINT4_PA28A   ((PIN_EIC_EXTINT4_PA28A << 16) | MUX_EIC_EXTINT4_PA28A)
#define PORT_EIC_EXTINT4_PA28A     (1u << 28)
#define PIN_EIC_EXTINT4_PB08A             40  /**< \brief EIC signal: EXTINT4 on PB08 mux A */
#define MUX_EIC_EXTINT4_PB08A              0
#define PINMUX_EIC_EXTINT4_PB08A   ((PIN_EIC_EXTINT4_PB08A << 16) | MUX_EIC_EXTINT4_PB08A)
#define PORT_EIC_EXTINT4_PB08A     (1u <<  8)
#define PIN_EIC_EXTINT5_PA09A              9  /**< \brief EIC signal: EXTINT5 on PA09 mux A */
#define MUX_EIC_EXTINT5_PA09A              0
#define PINMUX_EIC_EXTINT5_PA09A   ((PIN_EIC_EXTINT5_PA09A << 16) | MUX_EIC_EXTINT5_PA09A)
#define PORT_EIC_EXTINT5_PA09A     (1u <<  9)
#define PIN_EIC_EXTINT5_PA29A             29  /**< \brief EIC signal: EXTINT5 on PA29 mux A */
#define MUX_EIC_EXTINT5_PA29A              0
#define PINMUX_EIC_EXTINT5_PA29A   ((PIN_EIC_EXTINT5_PA29A << 16) | MUX_EIC_EXTINT5_PA29A)
#define PORT_EIC_EXTINT5_PA29A     (1u << 29)
#define PIN_EIC_EXTINT5_PB09A             41  /**< \brief EIC signal: EXTINT5 on PB09 mux A */
#define MUX_EIC_EXTINT5_PB09A              0
#define PINMUX_EIC_EXTINT5_PB09A   ((PIN_EIC_EXTINT5_PB09A << 16) | MUX_EIC_EXTINT5_PB09A)
#define PORT_EIC_EXTINT5_PB09A     (1u <<  9)
#define PIN_EIC_EXTINT6_PA10A             10  /**< \brief EIC signal: EXTINT6 on PA10 mux A */
#define MUX_EIC_EXTINT6_PA10A              0
#define PINMUX_EIC_EXTINT6_PA10A   ((PIN_EIC_EXTINT6_PA10A << 16) | MUX_EIC_EXTINT6_PA10A)
#define PORT_EIC_EXTINT6_PA10A     (1u << 10)
#define PIN_EIC_EXTINT6_PB10A             42  /**< \brief EIC signal: EXTINT6 on PB10 mux A */
#define MUX_EIC_EXTINT6_PB10A              0
#define PINMUX_EIC_EXTINT6_PB10A   ((PIN_EIC_EXTINT6_PB10A << 16) | MUX_EIC_EXTINT6_PB10A)
#define PORT_EIC_EXTINT6_PB10A     (1u << 10)
#define PIN_EIC_EXTINT7_PA11A             11  /**< \brief EIC signal: EXTINT7 on PA11 mux A */
#define MUX_EIC_EXTINT7_PA11A              0
#define PINMUX_EIC_EXTINT7_PA11A   ((PIN_EIC_EXTINT7_PA11A << 16) | MUX_EIC_EXTINT7_PA11A)
#define PORT_EIC_EXTINT7_PA11A     (1u << 11)
#define PIN_EIC_EXTINT7_PA31A             31  /**< \brief EIC signal: EXTINT7 on PA31 mux A */
#define MUX_EIC_EXTINT7_PA31A              0
#define PINMUX_EIC_EXTINT7_PA31A   ((PIN_EIC_EXTINT7_PA31A << 16) | MUX_EIC_EXTINT7_PA31A)
#define PORT_EIC_EXTINT7_PA31A     (1u << 31)
#define PIN_EIC_EXTINT7_PB11A             43  /**< \brief EIC signal: EXTINT7 on PB11 mux A */
#define MUX_EIC_EXTINT7_PB11A              0
#define PINMUX_EIC_EXTINT7_PB11A   ((PIN_EIC_EXTINT7_PB11A << 16) | MUX_EIC_EXTINT7_PB11A)
#define PORT_EIC_EXTINT7_PB11A     (1u << 11)
#define PIN_EIC_EXTINT8_PA02A              2  /**< \brief EIC signal: EXTINT8 on PA02 mux A */
#define MUX_EIC_EXTINT8_PA02A              0
#define PINMUX_EIC_EXTINT8_PA02A   ((PIN_EIC_EXTINT8_PA02A << 16) | MUX_EIC_EXTINT8_PA02A)
#define PORT_EIC_EXTINT8_PA02A     (1u <<  2)
#define PIN_EIC_EXTINT8_PA16A             16  /**< \brief EIC signal: EXTINT8 on PA16 mux A */
#define MUX_EIC_EXTINT8_PA16A              0
#define PINMUX_EIC_EXTINT8_PA16A   ((PIN_EIC_EXTINT8_PA16A << 16) | MUX_EIC_EXTINT8_PA16A)
#define PORT_EIC_EXTINT8_PA16A     (1u << 16)
#define PIN_EIC_EXTINT8_PB02A             34  /**< \brief EIC signal: EXTINT8 on PB02 mux A */
#define MUX_EIC_EXTINT8_PB02A              0
#define PINMUX_EIC_EXTINT8_PB02A   ((PIN_EIC_EXTINT8_PB02A << 16) | MUX_EIC_EXTINT8_PB02A)
#define PORT_EIC_EXTINT8_PB02A     (1u <<  2)
#define PIN_EIC_EXTINT8_PB16A             48  /**< \brief EIC signal: EXTINT8 on PB16 mux A */
#define MUX_EIC_EXTINT8_PB16A              0
