zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define PINMUX_EIC_EXTINT8_PB16A   ((PIN_EIC_EXTINT8_PB16A << 16) | MUX_EIC_EXTINT8_PB16A)
#define PORT_EIC_EXTINT8_PB16A     (1u << 16)
#define PIN_EIC_EXTINT9_PA03A              3  /**< \brief EIC signal: EXTINT9 on PA03 mux A */
#define MUX_EIC_EXTINT9_PA03A              0
#define PINMUX_EIC_EXTINT9_PA03A   ((PIN_EIC_EXTINT9_PA03A << 16) | MUX_EIC_EXTINT9_PA03A)
#define PORT_EIC_EXTINT9_PA03A     (1u <<  3)
#define PIN_EIC_EXTINT9_PA17A             17  /**< \brief EIC signal: EXTINT9 on PA17 mux A */
#define MUX_EIC_EXTINT9_PA17A              0
#define PINMUX_EIC_EXTINT9_PA17A   ((PIN_EIC_EXTINT9_PA17A << 16) | MUX_EIC_EXTINT9_PA17A)
#define PORT_EIC_EXTINT9_PA17A     (1u << 17)
#define PIN_EIC_EXTINT9_PB03A             35  /**< \brief EIC signal: EXTINT9 on PB03 mux A */
#define MUX_EIC_EXTINT9_PB03A              0
#define PINMUX_EIC_EXTINT9_PB03A   ((PIN_EIC_EXTINT9_PB03A << 16) | MUX_EIC_EXTINT9_PB03A)
#define PORT_EIC_EXTINT9_PB03A     (1u <<  3)
#define PIN_EIC_EXTINT9_PB17A             49  /**< \brief EIC signal: EXTINT9 on PB17 mux A */
#define MUX_EIC_EXTINT9_PB17A              0
#define PINMUX_EIC_EXTINT9_PB17A   ((PIN_EIC_EXTINT9_PB17A << 16) | MUX_EIC_EXTINT9_PB17A)
#define PORT_EIC_EXTINT9_PB17A     (1u << 17)
#define PIN_EIC_EXTINT10_PA06A             6  /**< \brief EIC signal: EXTINT10 on PA06 mux A */
#define MUX_EIC_EXTINT10_PA06A             0
#define PINMUX_EIC_EXTINT10_PA06A  ((PIN_EIC_EXTINT10_PA06A << 16) | MUX_EIC_EXTINT10_PA06A)
#define PORT_EIC_EXTINT10_PA06A    (1u <<  6)
#define PIN_EIC_EXTINT10_PA18A            18  /**< \brief EIC signal: EXTINT10 on PA18 mux A */
#define MUX_EIC_EXTINT10_PA18A             0
#define PINMUX_EIC_EXTINT10_PA18A  ((PIN_EIC_EXTINT10_PA18A << 16) | MUX_EIC_EXTINT10_PA18A)
#define PORT_EIC_EXTINT10_PA18A    (1u << 18)
#define PIN_EIC_EXTINT10_PB06A            38  /**< \brief EIC signal: EXTINT10 on PB06 mux A */
#define MUX_EIC_EXTINT10_PB06A             0
#define PINMUX_EIC_EXTINT10_PB06A  ((PIN_EIC_EXTINT10_PB06A << 16) | MUX_EIC_EXTINT10_PB06A)
#define PORT_EIC_EXTINT10_PB06A    (1u <<  6)
#define PIN_EIC_EXTINT10_PB18A            50  /**< \brief EIC signal: EXTINT10 on PB18 mux A */
#define MUX_EIC_EXTINT10_PB18A             0
#define PINMUX_EIC_EXTINT10_PB18A  ((PIN_EIC_EXTINT10_PB18A << 16) | MUX_EIC_EXTINT10_PB18A)
#define PORT_EIC_EXTINT10_PB18A    (1u << 18)
#define PIN_EIC_EXTINT11_PA07A             7  /**< \brief EIC signal: EXTINT11 on PA07 mux A */
#define MUX_EIC_EXTINT11_PA07A             0
#define PINMUX_EIC_EXTINT11_PA07A  ((PIN_EIC_EXTINT11_PA07A << 16) | MUX_EIC_EXTINT11_PA07A)
#define PORT_EIC_EXTINT11_PA07A    (1u <<  7)
#define PIN_EIC_EXTINT11_PA19A            19  /**< \brief EIC signal: EXTINT11 on PA19 mux A */
#define MUX_EIC_EXTINT11_PA19A             0
#define PINMUX_EIC_EXTINT11_PA19A  ((PIN_EIC_EXTINT11_PA19A << 16) | MUX_EIC_EXTINT11_PA19A)
#define PORT_EIC_EXTINT11_PA19A    (1u << 19)
#define PIN_EIC_EXTINT11_PB07A            39  /**< \brief EIC signal: EXTINT11 on PB07 mux A */
#define MUX_EIC_EXTINT11_PB07A             0
#define PINMUX_EIC_EXTINT11_PB07A  ((PIN_EIC_EXTINT11_PB07A << 16) | MUX_EIC_EXTINT11_PB07A)
#define PORT_EIC_EXTINT11_PB07A    (1u <<  7)
#define PIN_EIC_EXTINT11_PB19A            51  /**< \brief EIC signal: EXTINT11 on PB19 mux A */
#define MUX_EIC_EXTINT11_PB19A             0
#define PINMUX_EIC_EXTINT11_PB19A  ((PIN_EIC_EXTINT11_PB19A << 16) | MUX_EIC_EXTINT11_PB19A)
#define PORT_EIC_EXTINT11_PB19A    (1u << 19)
#define PIN_EIC_EXTINT12_PA12A            12  /**< \brief EIC signal: EXTINT12 on PA12 mux A */
#define MUX_EIC_EXTINT12_PA12A             0
#define PINMUX_EIC_EXTINT12_PA12A  ((PIN_EIC_EXTINT12_PA12A << 16) | MUX_EIC_EXTINT12_PA12A)
#define PORT_EIC_EXTINT12_PA12A    (1u << 12)
#define PIN_EIC_EXTINT12_PA24A            24  /**< \brief EIC signal: EXTINT12 on PA24 mux A */
#define MUX_EIC_EXTINT12_PA24A             0
#define PINMUX_EIC_EXTINT12_PA24A  ((PIN_EIC_EXTINT12_PA24A << 16) | MUX_EIC_EXTINT12_PA24A)
#define PORT_EIC_EXTINT12_PA24A    (1u << 24)
#define PIN_EIC_EXTINT12_PB12A            44  /**< \brief EIC signal: EXTINT12 on PB12 mux A */
#define MUX_EIC_EXTINT12_PB12A             0
#define PINMUX_EIC_EXTINT12_PB12A  ((PIN_EIC_EXTINT12_PB12A << 16) | MUX_EIC_EXTINT12_PB12A)
#define PORT_EIC_EXTINT12_PB12A    (1u << 12)
#define PIN_EIC_EXTINT12_PB24A            56  /**< \brief EIC signal: EXTINT12 on PB24 mux A */
#define MUX_EIC_EXTINT12_PB24A             0
#define PINMUX_EIC_EXTINT12_PB24A  ((PIN_EIC_EXTINT12_PB24A << 16) | MUX_EIC_EXTINT12_PB24A)
#define PORT_EIC_EXTINT12_PB24A    (1u << 24)
#define PIN_EIC_EXTINT13_PA13A            13  /**< \brief EIC signal: EXTINT13 on PA13 mux A */
#define MUX_EIC_EXTINT13_PA13A             0
#define PINMUX_EIC_EXTINT13_PA13A  ((PIN_EIC_EXTINT13_PA13A << 16) | MUX_EIC_EXTINT13_PA13A)
#define PORT_EIC_EXTINT13_PA13A    (1u << 13)
#define PIN_EIC_EXTINT13_PA25A            25  /**< \brief EIC signal: EXTINT13 on PA25 mux A */
#define MUX_EIC_EXTINT13_PA25A             0
#define PINMUX_EIC_EXTINT13_PA25A  ((PIN_EIC_EXTINT13_PA25A << 16) | MUX_EIC_EXTINT13_PA25A)
#define PORT_EIC_EXTINT13_PA25A    (1u << 25)
#define PIN_EIC_EXTINT13_PB13A            45  /**< \brief EIC signal: EXTINT13 on PB13 mux A */
#define MUX_EIC_EXTINT13_PB13A             0
#define PINMUX_EIC_EXTINT13_PB13A  ((PIN_EIC_EXTINT13_PB13A << 16) | MUX_EIC_EXTINT13_PB13A)
#define PORT_EIC_EXTINT13_PB13A    (1u << 13)
#define PIN_EIC_EXTINT13_PB25A            57  /**< \brief EIC signal: EXTINT13 on PB25 mux A */
#define MUX_EIC_EXTINT13_PB25A             0
#define PINMUX_EIC_EXTINT13_PB25A  ((PIN_EIC_EXTINT13_PB25A << 16) | MUX_EIC_EXTINT13_PB25A)
#define PORT_EIC_EXTINT13_PB25A    (1u << 25)
#define PIN_EIC_EXTINT14_PA14A            14  /**< \brief EIC signal: EXTINT14 on PA14 mux A */
#define MUX_EIC_EXTINT14_PA14A             0
#define PINMUX_EIC_EXTINT14_PA14A  ((PIN_EIC_EXTINT14_PA14A << 16) | MUX_EIC_EXTINT14_PA14A)
#define PORT_EIC_EXTINT14_PA14A    (1u << 14)
#define PIN_EIC_EXTINT14_PA26A            26  /**< \brief EIC signal: EXTINT14 on PA26 mux A */
#define MUX_EIC_EXTINT14_PA26A             0
#define PINMUX_EIC_EXTINT14_PA26A  ((PIN_EIC_EXTINT14_PA26A << 16) | MUX_EIC_EXTINT14_PA26A)
#define PORT_EIC_EXTINT14_PA26A    (1u << 26)
#define PIN_EIC_EXTINT14_PB26A            58  /**< \brief EIC signal: EXTINT14 on PB26 mux A */
#define MUX_EIC_EXTINT14_PB26A             0
#define PINMUX_EIC_EXTINT14_PB26A  ((PIN_EIC_EXTINT14_PB26A << 16) | MUX_EIC_EXTINT14_PB26A)
#define PORT_EIC_EXTINT14_PB26A    (1u << 26)
#define PIN_EIC_EXTINT15_PA15A            15  /**< \brief EIC signal: EXTINT15 on PA15 mux A */
#define MUX_EIC_EXTINT15_PA15A             0
#define PINMUX_EIC_EXTINT15_PA15A  ((PIN_EIC_EXTINT15_PA15A << 16) | MUX_EIC_EXTINT15_PA15A)
#define PORT_EIC_EXTINT15_PA15A    (1u << 15)
#define PIN_EIC_EXTINT15_PA27A            27  /**< \brief EIC signal: EXTINT15 on PA27 mux A */
#define MUX_EIC_EXTINT15_PA27A             0
#define PINMUX_EIC_EXTINT15_PA27A  ((PIN_EIC_EXTINT15_PA27A << 16) | MUX_EIC_EXTINT15_PA27A)
#define PORT_EIC_EXTINT15_PA27A    (1u << 27)
#define PIN_EIC_EXTINT15_PB27A            59  /**< \brief EIC signal: EXTINT15 on PB27 mux A */
#define MUX_EIC_EXTINT15_PB27A             0
#define PINMUX_EIC_EXTINT15_PB27A  ((PIN_EIC_EXTINT15_PB27A << 16) | MUX_EIC_EXTINT15_PB27A)
#define PORT_EIC_EXTINT15_PB27A    (1u << 27)
#define PIN_EIC_NMI_PA30A                 30  /**< \brief EIC signal: NMI on PA30 mux A */
#define MUX_EIC_NMI_PA30A                  0
#define PINMUX_EIC_NMI_PA30A       ((PIN_EIC_NMI_PA30A << 16) | MUX_EIC_NMI_PA30A)
#define PORT_EIC_NMI_PA30A         (1u << 30)
/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_GCLK_IO0_PA16G                16  /**< \brief GCLK signal: IO0 on PA16 mux G */
#define MUX_GCLK_IO0_PA16G                 6
#define PINMUX_GCLK_IO0_PA16G      ((PIN_GCLK_IO0_PA16G << 16) | MUX_GCLK_IO0_PA16G)
#define PORT_GCLK_IO0_PA16G        (1u << 16)
#define PIN_GCLK_IO0_PA28G                28  /**< \brief GCLK signal: IO0 on PA28 mux G */
#define MUX_GCLK_IO0_PA28G                 6
#define PINMUX_GCLK_IO0_PA28G      ((PIN_GCLK_IO0_PA28G << 16) | MUX_GCLK_IO0_PA28G)
#define PORT_GCLK_IO0_PA28G        (1u << 28)
#define PIN_GCLK_IO0_PA31G                31  /**< \brief GCLK signal: IO0 on PA31 mux G */
#define MUX_GCLK_IO0_PA31G                 6
#define PINMUX_GCLK_IO0_PA31G      ((PIN_GCLK_IO0_PA31G << 16) | MUX_GCLK_IO0_PA31G)
#define PORT_GCLK_IO0_PA31G        (1u << 31)
#define PIN_GCLK_IO0_PB20G                52  /**< \brief GCLK signal: IO0 on PB20 mux G */
#define MUX_GCLK_IO0_PB20G                 6
#define PINMUX_GCLK_IO0_PB20G      ((PIN_GCLK_IO0_PB20G << 16) | MUX_GCLK_IO0_PB20G)
#define PORT_GCLK_IO0_PB20G        (1u << 20)
#define PIN_GCLK_IO1_PA17G                17  /**< \brief GCLK signal: IO1 on PA17 mux G */
#define MUX_GCLK_IO1_PA17G                 6
#define PINMUX_GCLK_IO1_PA17G      ((PIN_GCLK_IO1_PA17G << 16) | MUX_GCLK_IO1_PA17G)
#define PORT_GCLK_IO1_PA17G        (1u << 17)
#define PIN_GCLK_IO1_PB21G                53  /**< \brief GCLK signal: IO1 on PB21 mux G */
#define MUX_GCLK_IO1_PB21G                 6
#define PINMUX_GCLK_IO1_PB21G      ((PIN_GCLK_IO1_PB21G << 16) | MUX_GCLK_IO1_PB21G)
#define PORT_GCLK_IO1_PB21G        (1u << 21)
#define PIN_GCLK_IO2_PA18G                18  /**< \brief GCLK signal: IO2 on PA18 mux G */
#define MUX_GCLK_IO2_PA18G                 6
#define PINMUX_GCLK_IO2_PA18G      ((PIN_GCLK_IO2_PA18G << 16) | MUX_GCLK_IO2_PA18G)
#define PORT_GCLK_IO2_PA18G        (1u << 18)
#define PIN_GCLK_IO2_PB22G                54  /**< \brief GCLK signal: IO2 on PB22 mux G */
#define MUX_GCLK_IO2_PB22G                 6
#define PINMUX_GCLK_IO2_PB22G      ((PIN_GCLK_IO2_PB22G << 16) | MUX_GCLK_IO2_PB22G)
#define PORT_GCLK_IO2_PB22G        (1u << 22)
#define PIN_GCLK_IO3_PA19G                19  /**< \brief GCLK signal: IO3 on PA19 mux G */
#define MUX_GCLK_IO3_PA19G                 6
#define PINMUX_GCLK_IO3_PA19G      ((PIN_GCLK_IO3_PA19G << 16) | MUX_GCLK_IO3_PA19G)
#define PORT_GCLK_IO3_PA19G        (1u << 19)
#define PIN_GCLK_IO3_PB23G                55  /**< \brief GCLK signal: IO3 on PB23 mux G */
#define MUX_GCLK_IO3_PB23G                 6
#define PINMUX_GCLK_IO3_PB23G      ((PIN_GCLK_IO3_PB23G << 16) | MUX_GCLK_IO3_PB23G)
#define PORT_GCLK_IO3_PB23G        (1u << 23)
#define PIN_GCLK_IO4_PA24G                24  /**< \brief GCLK signal: IO4 on PA24 mux G */
#define MUX_GCLK_IO4_PA24G                 6
#define PINMUX_GCLK_IO4_PA24G      ((PIN_GCLK_IO4_PA24G << 16) | MUX_GCLK_IO4_PA24G)
#define PORT_GCLK_IO4_PA24G        (1u << 24)
#define PIN_GCLK_IO4_PB12G                44  /**< \brief GCLK signal: IO4 on PB12 mux G */
#define MUX_GCLK_IO4_PB12G                 6
#define PINMUX_GCLK_IO4_PB12G      ((PIN_GCLK_IO4_PB12G << 16) | MUX_GCLK_IO4_PB12G)
#define PORT_GCLK_IO4_PB12G        (1u << 12)
#define PIN_GCLK_IO5_PA25G                25  /**< \brief GCLK signal: IO5 on PA25 mux G */
#define MUX_GCLK_IO5_PA25G                 6
#define PINMUX_GCLK_IO5_PA25G      ((PIN_GCLK_IO5_PA25G << 16) | MUX_GCLK_IO5_PA25G)
#define PORT_GCLK_IO5_PA25G        (1u << 25)
#define PIN_GCLK_IO5_PB13G                45  /**< \brief GCLK signal: IO5 on PB13 mux G */
#define MUX_GCLK_IO5_PB13G                 6
#define PINMUX_GCLK_IO5_PB13G      ((PIN_GCLK_IO5_PB13G << 16) | MUX_GCLK_IO5_PB13G)
#define PORT_GCLK_IO5_PB13G        (1u << 13)
#define PIN_GCLK_IO6_PA26G                26  /**< \brief GCLK signal: IO6 on PA26 mux G */
#define MUX_GCLK_IO6_PA26G                 6
#define PINMUX_GCLK_IO6_PA26G      ((PIN_GCLK_IO6_PA26G << 16) | MUX_GCLK_IO6_PA26G)
#define PORT_GCLK_IO6_PA26G        (1u << 26)
#define PIN_GCLK_IO6_PB16G                48  /**< \brief GCLK signal: IO6 on PB16 mux G */
#define MUX_GCLK_IO6_PB16G                 6
#define PINMUX_GCLK_IO6_PB16G      ((PIN_GCLK_IO6_PB16G << 16) | MUX_GCLK_IO6_PB16G)
#define PORT_GCLK_IO6_PB16G        (1u << 16)
#define PIN_GCLK_IO7_PA27G                27  /**< \brief GCLK signal: IO7 on PA27 mux G */
#define MUX_GCLK_IO7_PA27G                 6
#define PINMUX_GCLK_IO7_PA27G      ((PIN_GCLK_IO7_PA27G << 16) | MUX_GCLK_IO7_PA27G)
#define PORT_GCLK_IO7_PA27G        (1u << 27)
#define PIN_GCLK_IO7_PB17G                49  /**< \brief GCLK signal: IO7 on PB17 mux G */
#define MUX_GCLK_IO7_PB17G                 6
#define PINMUX_GCLK_IO7_PB17G      ((PIN_GCLK_IO7_PB17G << 16) | MUX_GCLK_IO7_PB17G)
#define PORT_GCLK_IO7_PB17G        (1u << 17)
/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PTC_X0_PA10H                  10  /**< \brief PTC signal: X0 on PA10 mux H */
#define MUX_PTC_X0_PA10H                   7
#define PINMUX_PTC_X0_PA10H        ((PIN_PTC_X0_PA10H << 16) | MUX_PTC_X0_PA10H)
#define PORT_PTC_X0_PA10H          (1u << 10)
#define PIN_PTC_X1_PA11H                  11  /**< \brief PTC signal: X1 on PA11 mux H */
#define MUX_PTC_X1_PA11H                   7
#define PINMUX_PTC_X1_PA11H        ((PIN_PTC_X1_PA11H << 16) | MUX_PTC_X1_PA11H)
#define PORT_PTC_X1_PA11H          (1u << 11)
#define PIN_PTC_X2_PA14H                  14  /**< \brief PTC signal: X2 on PA14 mux H */
#define MUX_PTC_X2_PA14H                   7
#define PINMUX_PTC_X2_PA14H        ((PIN_PTC_X2_PA14H << 16) | MUX_PTC_X2_PA14H)
#define PORT_PTC_X2_PA14H          (1u << 14)
#define PIN_PTC_X3_PA15H                  15  /**< \brief PTC signal: X3 on PA15 mux H */
#define MUX_PTC_X3_PA15H                   7
#define PINMUX_PTC_X3_PA15H        ((PIN_PTC_X3_PA15H << 16) | MUX_PTC_X3_PA15H)
#define PORT_PTC_X3_PA15H          (1u << 15)
#define PIN_PTC_X4_PA16H                  16  /**< \brief PTC signal: X4 on PA16 mux H */
#define MUX_PTC_X4_PA16H                   7
#define PINMUX_PTC_X4_PA16H        ((PIN_PTC_X4_PA16H << 16) | MUX_PTC_X4_PA16H)
#define PORT_PTC_X4_PA16H          (1u << 16)
#define PIN_PTC_X5_PA17H                  17  /**< \brief PTC signal: X5 on PA17 mux H */
#define MUX_PTC_X5_PA17H                   7
#define PINMUX_PTC_X5_PA17H        ((PIN_PTC_X5_PA17H << 16) | MUX_PTC_X5_PA17H)
#define PORT_PTC_X5_PA17H          (1u << 17)
#define PIN_PTC_X6_PA18H                  18  /**< \brief PTC signal: X6 on PA18 mux H */
#define MUX_PTC_X6_PA18H                   7
#define PINMUX_PTC_X6_PA18H        ((PIN_PTC_X6_PA18H << 16) | MUX_PTC_X6_PA18H)
#define PORT_PTC_X6_PA18H          (1u << 18)
#define PIN_PTC_X7_PA19H                  19  /**< \brief PTC signal: X7 on PA19 mux H */
#define MUX_PTC_X7_PA19H                   7
#define PINMUX_PTC_X7_PA19H        ((PIN_PTC_X7_PA19H << 16) | MUX_PTC_X7_PA19H)
#define PORT_PTC_X7_PA19H          (1u << 19)
#define PIN_PTC_X8_PB20H                  52  /**< \brief PTC signal: X8 on PB20 mux H */
#define MUX_PTC_X8_PB20H                   7
#define PINMUX_PTC_X8_PB20H        ((PIN_PTC_X8_PB20H << 16) | MUX_PTC_X8_PB20H)
#define PORT_PTC_X8_PB20H          (1u << 20)
#define PIN_PTC_X9_PB21H                  53  /**< \brief PTC signal: X9 on PB21 mux H */
#define MUX_PTC_X9_PB21H                   7
#define PINMUX_PTC_X9_PB21H        ((PIN_PTC_X9_PB21H << 16) | MUX_PTC_X9_PB21H)
#define PORT_PTC_X9_PB21H          (1u << 21)
#define PIN_PTC_X10_PB22H                 54  /**< \brief PTC signal: X10 on PB22 mux H */
#define MUX_PTC_X10_PB22H                  7
#define PINMUX_PTC_X10_PB22H       ((PIN_PTC_X10_PB22H << 16) | MUX_PTC_X10_PB22H)
#define PORT_PTC_X10_PB22H         (1u << 22)
#define PIN_PTC_X11_PB23H                 55  /**< \brief PTC signal: X11 on PB23 mux H */
#define MUX_PTC_X11_PB23H                  7
#define PINMUX_PTC_X11_PB23H       ((PIN_PTC_X11_PB23H << 16) | MUX_PTC_X11_PB23H)
#define PORT_PTC_X11_PB23H         (1u << 23)
#define PIN_PTC_X12_PB24H                 56  /**< \brief PTC signal: X12 on PB24 mux H */
#define MUX_PTC_X12_PB24H                  7
#define PINMUX_PTC_X12_PB24H       ((PIN_PTC_X12_PB24H << 16) | MUX_PTC_X12_PB24H)
#define PORT_PTC_X12_PB24H         (1u << 24)
#define PIN_PTC_X13_PB25H                 57  /**< \brief PTC signal: X13 on PB25 mux H */
#define MUX_PTC_X13_PB25H                  7
#define PINMUX_PTC_X13_PB25H       ((PIN_PTC_X13_PB25H << 16) | MUX_PTC_X13_PB25H)
#define PORT_PTC_X13_PB25H         (1u << 25)
#define PIN_PTC_X14_PB26H                 58  /**< \brief PTC signal: X14 on PB26 mux H */
#define MUX_PTC_X14_PB26H                  7
#define PINMUX_PTC_X14_PB26H       ((PIN_PTC_X14_PB26H << 16) | MUX_PTC_X14_PB26H)
#define PORT_PTC_X14_PB26H         (1u << 26)
#define PIN_PTC_X15_PB27H                 59  /**< \brief PTC signal: X15 on PB27 mux H */
#define MUX_PTC_X15_PB27H                  7
#define PINMUX_PTC_X15_PB27H       ((PIN_PTC_X15_PB27H << 16) | MUX_PTC_X15_PB27H)
#define PORT_PTC_X15_PB27H         (1u << 27)
#define PIN_PTC_Y0_PA00H                   0  /**< \brief PTC signal: Y0 on PA00 mux H */
#define MUX_PTC_Y0_PA00H                   7
#define PINMUX_PTC_Y0_PA00H        ((PIN_PTC_Y0_PA00H << 16) | MUX_PTC_Y0_PA00H)
#define PORT_PTC_Y0_PA00H          (1u <<  0)
#define PIN_PTC_Y1_PA01H                   1  /**< \brief PTC signal: Y1 on PA01 mux H */
#define MUX_PTC_Y1_PA01H                   7
#define PINMUX_PTC_Y1_PA01H        ((PIN_PTC_Y1_PA01H << 16) | MUX_PTC_Y1_PA01H)
#define PORT_PTC_Y1_PA01H          (1u <<  1)
#define PIN_PTC_Y2_PA02H                   2  /**< \brief PTC signal: Y2 on PA02 mux H */
#define MUX_PTC_Y2_PA02H                   7
#define PINMUX_PTC_Y2_PA02H        ((PIN_PTC_Y2_PA02H << 16) | MUX_PTC_Y2_PA02H)
#define PORT_PTC_Y2_PA02H          (1u <<  2)
#define PIN_PTC_Y3_PA03H                   3  /**< \brief PTC signal: Y3 on PA03 mux H */
#define MUX_PTC_Y3_PA03H                   7
#define PINMUX_PTC_Y3_PA03H        ((PIN_PTC_Y3_PA03H << 16) | MUX_PTC_Y3_PA03H)
#define PORT_PTC_Y3_PA03H          (1u <<  3)
#define PIN_PTC_Y4_PA04H                   4  /**< \brief PTC signal: Y4 on PA04 mux H */
#define MUX_PTC_Y4_PA04H                   7
#define PINMUX_PTC_Y4_PA04H        ((PIN_PTC_Y4_PA04H << 16) | MUX_PTC_Y4_PA04H)
#define PORT_PTC_Y4_PA04H          (1u <<  4)
#define PIN_PTC_Y5_PA05H                   5  /**< \brief PTC signal: Y5 on PA05 mux H */
#define MUX_PTC_Y5_PA05H                   7
#define PINMUX_PTC_Y5_PA05H        ((PIN_PTC_Y5_PA05H << 16) | MUX_PTC_Y5_PA05H)
#define PORT_PTC_Y5_PA05H          (1u <<  5)
#define PIN_PTC_Y6_PA06H                   6  /**< \brief PTC signal: Y6 on PA06 mux H */
#define MUX_PTC_Y6_PA06H                   7
#define PINMUX_PTC_Y6_PA06H        ((PIN_PTC_Y6_PA06H << 16) | MUX_PTC_Y6_PA06H)
#define PORT_PTC_Y6_PA06H          (1u <<  6)
#define PIN_PTC_Y7_PA07H                   7  /**< \brief PTC signal: Y7 on PA07 mux H */
#define MUX_PTC_Y7_PA07H                   7
#define PINMUX_PTC_Y7_PA07H        ((PIN_PTC_Y7_PA07H << 16) | MUX_PTC_Y7_PA07H)
#define PORT_PTC_Y7_PA07H          (1u <<  7)
#define PIN_PTC_Y8_PB00H                  32  /**< \brief PTC signal: Y8 on PB00 mux H */
#define MUX_PTC_Y8_PB00H                   7
#define PINMUX_PTC_Y8_PB00H        ((PIN_PTC_Y8_PB00H << 16) | MUX_PTC_Y8_PB00H)
#define PORT_PTC_Y8_PB00H          (1u <<  0)
#define PIN_PTC_Y9_PB01H                  33  /**< \brief PTC signal: Y9 on PB01 mux H */
#define MUX_PTC_Y9_PB01H                   7
#define PINMUX_PTC_Y9_PB01H        ((PIN_PTC_Y9_PB01H << 16) | MUX_PTC_Y9_PB01H)
#define PORT_PTC_Y9_PB01H          (1u <<  1)
#define PIN_PTC_Y10_PB02H                 34  /**< \brief PTC signal: Y10 on PB02 mux H */
#define MUX_PTC_Y10_PB02H                  7
#define PINMUX_PTC_Y10_PB02H       ((PIN_PTC_Y10_PB02H << 16) | MUX_PTC_Y10_PB02H)
#define PORT_PTC_Y10_PB02H         (1u <<  2)
#define PIN_PTC_Y11_PB03H                 35  /**< \brief PTC signal: Y11 on PB03 mux H */
#define MUX_PTC_Y11_PB03H                  7
#define PINMUX_PTC_Y11_PB03H       ((PIN_PTC_Y11_PB03H << 16) | MUX_PTC_Y11_PB03H)
#define PORT_PTC_Y11_PB03H         (1u <<  3)
#define PIN_PTC_Y12_PB04H                 36  /**< \brief PTC signal: Y12 on PB04 mux H */
#define MUX_PTC_Y12_PB04H                  7
#define PINMUX_PTC_Y12_PB04H       ((PIN_PTC_Y12_PB04H << 16) | MUX_PTC_Y12_PB04H)
#define PORT_PTC_Y12_PB04H         (1u <<  4)
#define PIN_PTC_Y13_PB05H                 37  /**< \brief PTC signal: Y13 on PB05 mux H */
#define MUX_PTC_Y13_PB05H                  7
#define PINMUX_PTC_Y13_PB05H       ((PIN_PTC_Y13_PB05H << 16) | MUX_PTC_Y13_PB05H)
#define PORT_PTC_Y13_PB05H         (1u <<  5)
#define PIN_PTC_Y14_PB06H                 38  /**< \brief PTC signal: Y14 on PB06 mux H */
#define MUX_PTC_Y14_PB06H                  7
#define PINMUX_PTC_Y14_PB06H       ((PIN_PTC_Y14_PB06H << 16) | MUX_PTC_Y14_PB06H)
#define PORT_PTC_Y14_PB06H         (1u <<  6)
#define PIN_PTC_Y15_PB07H                 39  /**< \brief PTC signal: Y15 on PB07 mux H */
#define MUX_PTC_Y15_PB07H                  7
#define PINMUX_PTC_Y15_PB07H       ((PIN_PTC_Y15_PB07H << 16) | MUX_PTC_Y15_PB07H)
#define PORT_PTC_Y15_PB07H         (1u <<  7)
/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_SERCOM0_PAD0_PA02C             2  /**< \brief SERCOM0 signal: PAD0 on PA02 mux C */
#define MUX_SERCOM0_PAD0_PA02C             2
#define PINMUX_SERCOM0_PAD0_PA02C  ((PIN_SERCOM0_PAD0_PA02C << 16) | MUX_SERCOM0_PAD0_PA02C)
#define PORT_SERCOM0_PAD0_PA02C    (1u <<  2)
#define PIN_SERCOM0_PAD0_PA10B            10  /**< \brief SERCOM0 signal: PAD0 on PA10 mux B */
#define MUX_SERCOM0_PAD0_PA10B             1
#define PINMUX_SERCOM0_PAD0_PA10B  ((PIN_SERCOM0_PAD0_PA10B << 16) | MUX_SERCOM0_PAD0_PA10B)
#define PORT_SERCOM0_PAD0_PA10B    (1u << 10)
#define PIN_SERCOM0_PAD1_PA03C             3  /**< \brief SERCOM0 signal: PAD1 on PA03 mux C */
#define MUX_SERCOM0_PAD1_PA03C             2
#define PINMUX_SERCOM0_PAD1_PA03C  ((PIN_SERCOM0_PAD1_PA03C << 16) | MUX_SERCOM0_PAD1_PA03C)
#define PORT_SERCOM0_PAD1_PA03C    (1u <<  3)
#define PIN_SERCOM0_PAD1_PA11B            11  /**< \brief SERCOM0 signal: PAD1 on PA11 mux B */
#define MUX_SERCOM0_PAD1_PA11B             1
#define PINMUX_SERCOM0_PAD1_PA11B  ((PIN_SERCOM0_PAD1_PA11B << 16) | MUX_SERCOM0_PAD1_PA11B)
#define PORT_SERCOM0_PAD1_PA11B    (1u << 11)
#define PIN_SERCOM0_PAD2_PA00C             0  /**< \brief SERCOM0 signal: PAD2 on PA00 mux C */
#define MUX_SERCOM0_PAD2_PA00C             2
#define PINMUX_SERCOM0_PAD2_PA00C  ((PIN_SERCOM0_PAD2_PA00C << 16) | MUX_SERCOM0_PAD2_PA00C)
#define PORT_SERCOM0_PAD2_PA00C    (1u <<  0)
#define PIN_SERCOM0_PAD2_PA08B             8  /**< \brief SERCOM0 signal: PAD2 on PA08 mux B */
#define MUX_SERCOM0_PAD2_PA08B             1
#define PINMUX_SERCOM0_PAD2_PA08B  ((PIN_SERCOM0_PAD2_PA08B << 16) | MUX_SERCOM0_PAD2_PA08B)
#define PORT_SERCOM0_PAD2_PA08B    (1u <<  8)
#define PIN_SERCOM0_PAD3_PA01C             1  /**< \brief SERCOM0 signal: PAD3 on PA01 mux C */
#define MUX_SERCOM0_PAD3_PA01C             2
#define PINMUX_SERCOM0_PAD3_PA01C  ((PIN_SERCOM0_PAD3_PA01C << 16) | MUX_SERCOM0_PAD3_PA01C)
#define PORT_SERCOM0_PAD3_PA01C    (1u <<  1)
#define PIN_SERCOM0_PAD3_PA09B             9  /**< \brief SERCOM0 signal: PAD3 on PA09 mux B */
#define MUX_SERCOM0_PAD3_PA09B             1
#define PINMUX_SERCOM0_PAD3_PA09B  ((PIN_SERCOM0_PAD3_PA09B << 16) | MUX_SERCOM0_PAD3_PA09B)
#define PORT_SERCOM0_PAD3_PA09B    (1u <<  9)
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_SERCOM1_PAD0_PA30C            30  /**< \brief SERCOM1 signal: PAD0 on PA30 mux C */
#define MUX_SERCOM1_PAD0_PA30C             2
#define PINMUX_SERCOM1_PAD0_PA30C  ((PIN_SERCOM1_PAD0_PA30C << 16) | MUX_SERCOM1_PAD0_PA30C)
#define PORT_SERCOM1_PAD0_PA30C    (1u << 30)
#define PIN_SERCOM1_PAD0_PA18B            18  /**< \brief SERCOM1 signal: PAD0 on PA18 mux B */
#define MUX_SERCOM1_PAD0_PA18B             1
#define PINMUX_SERCOM1_PAD0_PA18B  ((PIN_SERCOM1_PAD0_PA18B << 16) | MUX_SERCOM1_PAD0_PA18B)
#define PORT_SERCOM1_PAD0_PA18B    (1u << 18)
