zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/sam0d4_reva.h
#define PIN_SERCOM1_PAD1_PA31C            31  /**< \brief SERCOM1 signal: PAD1 on PA31 mux C */
#define MUX_SERCOM1_PAD1_PA31C             2
#define PINMUX_SERCOM1_PAD1_PA31C  ((PIN_SERCOM1_PAD1_PA31C << 16) | MUX_SERCOM1_PAD1_PA31C)
#define PORT_SERCOM1_PAD1_PA31C    (1u << 31)
#define PIN_SERCOM1_PAD1_PA19B            19  /**< \brief SERCOM1 signal: PAD1 on PA19 mux B */
#define MUX_SERCOM1_PAD1_PA19B             1
#define PINMUX_SERCOM1_PAD1_PA19B  ((PIN_SERCOM1_PAD1_PA19B << 16) | MUX_SERCOM1_PAD1_PA19B)
#define PORT_SERCOM1_PAD1_PA19B    (1u << 19)
#define PIN_SERCOM1_PAD2_PA04C             4  /**< \brief SERCOM1 signal: PAD2 on PA04 mux C */
#define MUX_SERCOM1_PAD2_PA04C             2
#define PINMUX_SERCOM1_PAD2_PA04C  ((PIN_SERCOM1_PAD2_PA04C << 16) | MUX_SERCOM1_PAD2_PA04C)
#define PORT_SERCOM1_PAD2_PA04C    (1u <<  4)
#define PIN_SERCOM1_PAD2_PA16B            16  /**< \brief SERCOM1 signal: PAD2 on PA16 mux B */
#define MUX_SERCOM1_PAD2_PA16B             1
#define PINMUX_SERCOM1_PAD2_PA16B  ((PIN_SERCOM1_PAD2_PA16B << 16) | MUX_SERCOM1_PAD2_PA16B)
#define PORT_SERCOM1_PAD2_PA16B    (1u << 16)
#define PIN_SERCOM1_PAD3_PA05C             5  /**< \brief SERCOM1 signal: PAD3 on PA05 mux C */
#define MUX_SERCOM1_PAD3_PA05C             2
#define PINMUX_SERCOM1_PAD3_PA05C  ((PIN_SERCOM1_PAD3_PA05C << 16) | MUX_SERCOM1_PAD3_PA05C)
#define PORT_SERCOM1_PAD3_PA05C    (1u <<  5)
#define PIN_SERCOM1_PAD3_PA17B            17  /**< \brief SERCOM1 signal: PAD3 on PA17 mux B */
#define MUX_SERCOM1_PAD3_PA17B             1
#define PINMUX_SERCOM1_PAD3_PA17B  ((PIN_SERCOM1_PAD3_PA17B << 16) | MUX_SERCOM1_PAD3_PA17B)
#define PORT_SERCOM1_PAD3_PA17B    (1u << 17)
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_SERCOM2_PAD0_PA10C            10  /**< \brief SERCOM2 signal: PAD0 on PA10 mux C */
#define MUX_SERCOM2_PAD0_PA10C             2
#define PINMUX_SERCOM2_PAD0_PA10C  ((PIN_SERCOM2_PAD0_PA10C << 16) | MUX_SERCOM2_PAD0_PA10C)
#define PORT_SERCOM2_PAD0_PA10C    (1u << 10)
#define PIN_SERCOM2_PAD0_PA14B            14  /**< \brief SERCOM2 signal: PAD0 on PA14 mux B */
#define MUX_SERCOM2_PAD0_PA14B             1
#define PINMUX_SERCOM2_PAD0_PA14B  ((PIN_SERCOM2_PAD0_PA14B << 16) | MUX_SERCOM2_PAD0_PA14B)
#define PORT_SERCOM2_PAD0_PA14B    (1u << 14)
#define PIN_SERCOM2_PAD1_PA11C            11  /**< \brief SERCOM2 signal: PAD1 on PA11 mux C */
#define MUX_SERCOM2_PAD1_PA11C             2
#define PINMUX_SERCOM2_PAD1_PA11C  ((PIN_SERCOM2_PAD1_PA11C << 16) | MUX_SERCOM2_PAD1_PA11C)
#define PORT_SERCOM2_PAD1_PA11C    (1u << 11)
#define PIN_SERCOM2_PAD1_PA15B            15  /**< \brief SERCOM2 signal: PAD1 on PA15 mux B */
#define MUX_SERCOM2_PAD1_PA15B             1
#define PINMUX_SERCOM2_PAD1_PA15B  ((PIN_SERCOM2_PAD1_PA15B << 16) | MUX_SERCOM2_PAD1_PA15B)
#define PORT_SERCOM2_PAD1_PA15B    (1u << 15)
#define PIN_SERCOM2_PAD2_PA08C             8  /**< \brief SERCOM2 signal: PAD2 on PA08 mux C */
#define MUX_SERCOM2_PAD2_PA08C             2
#define PINMUX_SERCOM2_PAD2_PA08C  ((PIN_SERCOM2_PAD2_PA08C << 16) | MUX_SERCOM2_PAD2_PA08C)
#define PORT_SERCOM2_PAD2_PA08C    (1u <<  8)
#define PIN_SERCOM2_PAD2_PA12B            12  /**< \brief SERCOM2 signal: PAD2 on PA12 mux B */
#define MUX_SERCOM2_PAD2_PA12B             1
#define PINMUX_SERCOM2_PAD2_PA12B  ((PIN_SERCOM2_PAD2_PA12B << 16) | MUX_SERCOM2_PAD2_PA12B)
#define PORT_SERCOM2_PAD2_PA12B    (1u << 12)
#define PIN_SERCOM2_PAD3_PA09C             9  /**< \brief SERCOM2 signal: PAD3 on PA09 mux C */
#define MUX_SERCOM2_PAD3_PA09C             2
#define PINMUX_SERCOM2_PAD3_PA09C  ((PIN_SERCOM2_PAD3_PA09C << 16) | MUX_SERCOM2_PAD3_PA09C)
#define PORT_SERCOM2_PAD3_PA09C    (1u <<  9)
#define PIN_SERCOM2_PAD3_PA13B            13  /**< \brief SERCOM2 signal: PAD3 on PA13 mux B */
#define MUX_SERCOM2_PAD3_PA13B             1
#define PINMUX_SERCOM2_PAD3_PA13B  ((PIN_SERCOM2_PAD3_PA13B << 16) | MUX_SERCOM2_PAD3_PA13B)
#define PORT_SERCOM2_PAD3_PA13B    (1u << 13)
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_SERCOM3_PAD0_PA18C            18  /**< \brief SERCOM3 signal: PAD0 on PA18 mux C */
#define MUX_SERCOM3_PAD0_PA18C             2
#define PINMUX_SERCOM3_PAD0_PA18C  ((PIN_SERCOM3_PAD0_PA18C << 16) | MUX_SERCOM3_PAD0_PA18C)
#define PORT_SERCOM3_PAD0_PA18C    (1u << 18)
#define PIN_SERCOM3_PAD0_PA24B            24  /**< \brief SERCOM3 signal: PAD0 on PA24 mux B */
#define MUX_SERCOM3_PAD0_PA24B             1
#define PINMUX_SERCOM3_PAD0_PA24B  ((PIN_SERCOM3_PAD0_PA24B << 16) | MUX_SERCOM3_PAD0_PA24B)
#define PORT_SERCOM3_PAD0_PA24B    (1u << 24)
#define PIN_SERCOM3_PAD1_PA19C            19  /**< \brief SERCOM3 signal: PAD1 on PA19 mux C */
#define MUX_SERCOM3_PAD1_PA19C             2
#define PINMUX_SERCOM3_PAD1_PA19C  ((PIN_SERCOM3_PAD1_PA19C << 16) | MUX_SERCOM3_PAD1_PA19C)
#define PORT_SERCOM3_PAD1_PA19C    (1u << 19)
#define PIN_SERCOM3_PAD1_PA25B            25  /**< \brief SERCOM3 signal: PAD1 on PA25 mux B */
#define MUX_SERCOM3_PAD1_PA25B             1
#define PINMUX_SERCOM3_PAD1_PA25B  ((PIN_SERCOM3_PAD1_PA25B << 16) | MUX_SERCOM3_PAD1_PA25B)
#define PORT_SERCOM3_PAD1_PA25B    (1u << 25)
#define PIN_SERCOM3_PAD2_PA16C            16  /**< \brief SERCOM3 signal: PAD2 on PA16 mux C */
#define MUX_SERCOM3_PAD2_PA16C             2
#define PINMUX_SERCOM3_PAD2_PA16C  ((PIN_SERCOM3_PAD2_PA16C << 16) | MUX_SERCOM3_PAD2_PA16C)
#define PORT_SERCOM3_PAD2_PA16C    (1u << 16)
#define PIN_SERCOM3_PAD2_PA26B            26  /**< \brief SERCOM3 signal: PAD2 on PA26 mux B */
#define MUX_SERCOM3_PAD2_PA26B             1
#define PINMUX_SERCOM3_PAD2_PA26B  ((PIN_SERCOM3_PAD2_PA26B << 16) | MUX_SERCOM3_PAD2_PA26B)
#define PORT_SERCOM3_PAD2_PA26B    (1u << 26)
#define PIN_SERCOM3_PAD3_PA17C            17  /**< \brief SERCOM3 signal: PAD3 on PA17 mux C */
#define MUX_SERCOM3_PAD3_PA17C             2
#define PINMUX_SERCOM3_PAD3_PA17C  ((PIN_SERCOM3_PAD3_PA17C << 16) | MUX_SERCOM3_PAD3_PA17C)
#define PORT_SERCOM3_PAD3_PA17C    (1u << 17)
#define PIN_SERCOM3_PAD3_PA27B            27  /**< \brief SERCOM3 signal: PAD3 on PA27 mux B */
#define MUX_SERCOM3_PAD3_PA27B             1
#define PINMUX_SERCOM3_PAD3_PA27B  ((PIN_SERCOM3_PAD3_PA27B << 16) | MUX_SERCOM3_PAD3_PA27B)
#define PORT_SERCOM3_PAD3_PA27B    (1u << 27)
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_SERCOM4_PAD0_PA14C            14  /**< \brief SERCOM4 signal: PAD0 on PA14 mux C */
#define MUX_SERCOM4_PAD0_PA14C             2
#define PINMUX_SERCOM4_PAD0_PA14C  ((PIN_SERCOM4_PAD0_PA14C << 16) | MUX_SERCOM4_PAD0_PA14C)
#define PORT_SERCOM4_PAD0_PA14C    (1u << 14)
#define PIN_SERCOM4_PAD0_PB00C            32  /**< \brief SERCOM4 signal: PAD0 on PB00 mux C */
#define MUX_SERCOM4_PAD0_PB00C             2
#define PINMUX_SERCOM4_PAD0_PB00C  ((PIN_SERCOM4_PAD0_PB00C << 16) | MUX_SERCOM4_PAD0_PB00C)
#define PORT_SERCOM4_PAD0_PB00C    (1u <<  0)
#define PIN_SERCOM4_PAD0_PB08B            40  /**< \brief SERCOM4 signal: PAD0 on PB08 mux B */
#define MUX_SERCOM4_PAD0_PB08B             1
#define PINMUX_SERCOM4_PAD0_PB08B  ((PIN_SERCOM4_PAD0_PB08B << 16) | MUX_SERCOM4_PAD0_PB08B)
#define PORT_SERCOM4_PAD0_PB08B    (1u <<  8)
#define PIN_SERCOM4_PAD1_PA15C            15  /**< \brief SERCOM4 signal: PAD1 on PA15 mux C */
#define MUX_SERCOM4_PAD1_PA15C             2
#define PINMUX_SERCOM4_PAD1_PA15C  ((PIN_SERCOM4_PAD1_PA15C << 16) | MUX_SERCOM4_PAD1_PA15C)
#define PORT_SERCOM4_PAD1_PA15C    (1u << 15)
#define PIN_SERCOM4_PAD1_PB01C            33  /**< \brief SERCOM4 signal: PAD1 on PB01 mux C */
#define MUX_SERCOM4_PAD1_PB01C             2
#define PINMUX_SERCOM4_PAD1_PB01C  ((PIN_SERCOM4_PAD1_PB01C << 16) | MUX_SERCOM4_PAD1_PB01C)
#define PORT_SERCOM4_PAD1_PB01C    (1u <<  1)
#define PIN_SERCOM4_PAD1_PB09B            41  /**< \brief SERCOM4 signal: PAD1 on PB09 mux B */
#define MUX_SERCOM4_PAD1_PB09B             1
#define PINMUX_SERCOM4_PAD1_PB09B  ((PIN_SERCOM4_PAD1_PB09B << 16) | MUX_SERCOM4_PAD1_PB09B)
#define PORT_SERCOM4_PAD1_PB09B    (1u <<  9)
#define PIN_SERCOM4_PAD2_PB02C            34  /**< \brief SERCOM4 signal: PAD2 on PB02 mux C */
#define MUX_SERCOM4_PAD2_PB02C             2
#define PINMUX_SERCOM4_PAD2_PB02C  ((PIN_SERCOM4_PAD2_PB02C << 16) | MUX_SERCOM4_PAD2_PB02C)
#define PORT_SERCOM4_PAD2_PB02C    (1u <<  2)
#define PIN_SERCOM4_PAD2_PB10B            42  /**< \brief SERCOM4 signal: PAD2 on PB10 mux B */
#define MUX_SERCOM4_PAD2_PB10B             1
#define PINMUX_SERCOM4_PAD2_PB10B  ((PIN_SERCOM4_PAD2_PB10B << 16) | MUX_SERCOM4_PAD2_PB10B)
#define PORT_SERCOM4_PAD2_PB10B    (1u << 10)
#define PIN_SERCOM4_PAD2_PA12C            12  /**< \brief SERCOM4 signal: PAD2 on PA12 mux C */
#define MUX_SERCOM4_PAD2_PA12C             2
#define PINMUX_SERCOM4_PAD2_PA12C  ((PIN_SERCOM4_PAD2_PA12C << 16) | MUX_SERCOM4_PAD2_PA12C)
#define PORT_SERCOM4_PAD2_PA12C    (1u << 12)
#define PIN_SERCOM4_PAD3_PA13C            13  /**< \brief SERCOM4 signal: PAD3 on PA13 mux C */
#define MUX_SERCOM4_PAD3_PA13C             2
#define PINMUX_SERCOM4_PAD3_PA13C  ((PIN_SERCOM4_PAD3_PA13C << 16) | MUX_SERCOM4_PAD3_PA13C)
#define PORT_SERCOM4_PAD3_PA13C    (1u << 13)
#define PIN_SERCOM4_PAD3_PB03C            35  /**< \brief SERCOM4 signal: PAD3 on PB03 mux C */
#define MUX_SERCOM4_PAD3_PB03C             2
#define PINMUX_SERCOM4_PAD3_PB03C  ((PIN_SERCOM4_PAD3_PB03C << 16) | MUX_SERCOM4_PAD3_PB03C)
#define PORT_SERCOM4_PAD3_PB03C    (1u <<  3)
#define PIN_SERCOM4_PAD3_PB11B            43  /**< \brief SERCOM4 signal: PAD3 on PB11 mux B */
#define MUX_SERCOM4_PAD3_PB11B             1
#define PINMUX_SERCOM4_PAD3_PB11B  ((PIN_SERCOM4_PAD3_PB11B << 16) | MUX_SERCOM4_PAD3_PB11B)
#define PORT_SERCOM4_PAD3_PB11B    (1u << 11)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_SERCOM5_PAD0_PA24C            24  /**< \brief SERCOM5 signal: PAD0 on PA24 mux C */
#define MUX_SERCOM5_PAD0_PA24C             2
#define PINMUX_SERCOM5_PAD0_PA24C  ((PIN_SERCOM5_PAD0_PA24C << 16) | MUX_SERCOM5_PAD0_PA24C)
#define PORT_SERCOM5_PAD0_PA24C    (1u << 24)
#define PIN_SERCOM5_PAD0_PB16C            48  /**< \brief SERCOM5 signal: PAD0 on PB16 mux C */
#define MUX_SERCOM5_PAD0_PB16C             2
#define PINMUX_SERCOM5_PAD0_PB16C  ((PIN_SERCOM5_PAD0_PB16C << 16) | MUX_SERCOM5_PAD0_PB16C)
#define PORT_SERCOM5_PAD0_PB16C    (1u << 16)
#define PIN_SERCOM5_PAD0_PB20B            52  /**< \brief SERCOM5 signal: PAD0 on PB20 mux B */
#define MUX_SERCOM5_PAD0_PB20B             1
#define PINMUX_SERCOM5_PAD0_PB20B  ((PIN_SERCOM5_PAD0_PB20B << 16) | MUX_SERCOM5_PAD0_PB20B)
#define PORT_SERCOM5_PAD0_PB20B    (1u << 20)
#define PIN_SERCOM5_PAD1_PA25C            25  /**< \brief SERCOM5 signal: PAD1 on PA25 mux C */
#define MUX_SERCOM5_PAD1_PA25C             2
#define PINMUX_SERCOM5_PAD1_PA25C  ((PIN_SERCOM5_PAD1_PA25C << 16) | MUX_SERCOM5_PAD1_PA25C)
#define PORT_SERCOM5_PAD1_PA25C    (1u << 25)
#define PIN_SERCOM5_PAD1_PB17C            49  /**< \brief SERCOM5 signal: PAD1 on PB17 mux C */
#define MUX_SERCOM5_PAD1_PB17C             2
#define PINMUX_SERCOM5_PAD1_PB17C  ((PIN_SERCOM5_PAD1_PB17C << 16) | MUX_SERCOM5_PAD1_PB17C)
#define PORT_SERCOM5_PAD1_PB17C    (1u << 17)
#define PIN_SERCOM5_PAD1_PB21B            53  /**< \brief SERCOM5 signal: PAD1 on PB21 mux B */
#define MUX_SERCOM5_PAD1_PB21B             1
#define PINMUX_SERCOM5_PAD1_PB21B  ((PIN_SERCOM5_PAD1_PB21B << 16) | MUX_SERCOM5_PAD1_PB21B)
#define PORT_SERCOM5_PAD1_PB21B    (1u << 21)
#define PIN_SERCOM5_PAD2_PA26C            26  /**< \brief SERCOM5 signal: PAD2 on PA26 mux C */
#define MUX_SERCOM5_PAD2_PA26C             2
#define PINMUX_SERCOM5_PAD2_PA26C  ((PIN_SERCOM5_PAD2_PA26C << 16) | MUX_SERCOM5_PAD2_PA26C)
#define PORT_SERCOM5_PAD2_PA26C    (1u << 26)
#define PIN_SERCOM5_PAD2_PB18C            50  /**< \brief SERCOM5 signal: PAD2 on PB18 mux C */
#define MUX_SERCOM5_PAD2_PB18C             2
#define PINMUX_SERCOM5_PAD2_PB18C  ((PIN_SERCOM5_PAD2_PB18C << 16) | MUX_SERCOM5_PAD2_PB18C)
#define PORT_SERCOM5_PAD2_PB18C    (1u << 18)
#define PIN_SERCOM5_PAD2_PB22B            54  /**< \brief SERCOM5 signal: PAD2 on PB22 mux B */
#define MUX_SERCOM5_PAD2_PB22B             1
#define PINMUX_SERCOM5_PAD2_PB22B  ((PIN_SERCOM5_PAD2_PB22B << 16) | MUX_SERCOM5_PAD2_PB22B)
#define PORT_SERCOM5_PAD2_PB22B    (1u << 22)
#define PIN_SERCOM5_PAD3_PA27C            27  /**< \brief SERCOM5 signal: PAD3 on PA27 mux C */
#define MUX_SERCOM5_PAD3_PA27C             2
#define PINMUX_SERCOM5_PAD3_PA27C  ((PIN_SERCOM5_PAD3_PA27C << 16) | MUX_SERCOM5_PAD3_PA27C)
#define PORT_SERCOM5_PAD3_PA27C    (1u << 27)
#define PIN_SERCOM5_PAD3_PB19C            51  /**< \brief SERCOM5 signal: PAD3 on PB19 mux C */
#define MUX_SERCOM5_PAD3_PB19C             2
#define PINMUX_SERCOM5_PAD3_PB19C  ((PIN_SERCOM5_PAD3_PB19C << 16) | MUX_SERCOM5_PAD3_PB19C)
#define PORT_SERCOM5_PAD3_PB19C    (1u << 19)
#define PIN_SERCOM5_PAD3_PB23B            55  /**< \brief SERCOM5 signal: PAD3 on PB23 mux B */
#define MUX_SERCOM5_PAD3_PB23B             1
#define PINMUX_SERCOM5_PAD3_PB23B  ((PIN_SERCOM5_PAD3_PB23B << 16) | MUX_SERCOM5_PAD3_PB23B)
#define PORT_SERCOM5_PAD3_PB23B    (1u << 23)
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_TC0_WO0_PA00D                  0  /**< \brief TC0 signal: WO0 on PA00 mux D */
#define MUX_TC0_WO0_PA00D                  3
#define PINMUX_TC0_WO0_PA00D       ((PIN_TC0_WO0_PA00D << 16) | MUX_TC0_WO0_PA00D)
#define PORT_TC0_WO0_PA00D         (1u <<  0)
#define PIN_TC0_WO0_PA08D                  8  /**< \brief TC0 signal: WO0 on PA08 mux D */
#define MUX_TC0_WO0_PA08D                  3
#define PINMUX_TC0_WO0_PA08D       ((PIN_TC0_WO0_PA08D << 16) | MUX_TC0_WO0_PA08D)
#define PORT_TC0_WO0_PA08D         (1u <<  8)
#define PIN_TC0_WO1_PA01D                  1  /**< \brief TC0 signal: WO1 on PA01 mux D */
#define MUX_TC0_WO1_PA01D                  3
#define PINMUX_TC0_WO1_PA01D       ((PIN_TC0_WO1_PA01D << 16) | MUX_TC0_WO1_PA01D)
#define PORT_TC0_WO1_PA01D         (1u <<  1)
#define PIN_TC0_WO1_PA09D                  9  /**< \brief TC0 signal: WO1 on PA09 mux D */
#define MUX_TC0_WO1_PA09D                  3
#define PINMUX_TC0_WO1_PA09D       ((PIN_TC0_WO1_PA09D << 16) | MUX_TC0_WO1_PA09D)
#define PORT_TC0_WO1_PA09D         (1u <<  9)
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_TC1_WO0_PA04D                  4  /**< \brief TC1 signal: WO0 on PA04 mux D */
#define MUX_TC1_WO0_PA04D                  3
#define PINMUX_TC1_WO0_PA04D       ((PIN_TC1_WO0_PA04D << 16) | MUX_TC1_WO0_PA04D)
#define PORT_TC1_WO0_PA04D         (1u <<  4)
#define PIN_TC1_WO0_PA10D                 10  /**< \brief TC1 signal: WO0 on PA10 mux D */
#define MUX_TC1_WO0_PA10D                  3
#define PINMUX_TC1_WO0_PA10D       ((PIN_TC1_WO0_PA10D << 16) | MUX_TC1_WO0_PA10D)
#define PORT_TC1_WO0_PA10D         (1u << 10)
#define PIN_TC1_WO0_PA30D                 30  /**< \brief TC1 signal: WO0 on PA30 mux D */
#define MUX_TC1_WO0_PA30D                  3
#define PINMUX_TC1_WO0_PA30D       ((PIN_TC1_WO0_PA30D << 16) | MUX_TC1_WO0_PA30D)
#define PORT_TC1_WO0_PA30D         (1u << 30)
#define PIN_TC1_WO1_PA05D                  5  /**< \brief TC1 signal: WO1 on PA05 mux D */
#define MUX_TC1_WO1_PA05D                  3
#define PINMUX_TC1_WO1_PA05D       ((PIN_TC1_WO1_PA05D << 16) | MUX_TC1_WO1_PA05D)
#define PORT_TC1_WO1_PA05D         (1u <<  5)
#define PIN_TC1_WO1_PA11D                 11  /**< \brief TC1 signal: WO1 on PA11 mux D */
#define MUX_TC1_WO1_PA11D                  3
#define PINMUX_TC1_WO1_PA11D       ((PIN_TC1_WO1_PA11D << 16) | MUX_TC1_WO1_PA11D)
#define PORT_TC1_WO1_PA11D         (1u << 11)
#define PIN_TC1_WO1_PA31D                 31  /**< \brief TC1 signal: WO1 on PA31 mux D */
#define MUX_TC1_WO1_PA31D                  3
#define PINMUX_TC1_WO1_PA31D       ((PIN_TC1_WO1_PA31D << 16) | MUX_TC1_WO1_PA31D)
#define PORT_TC1_WO1_PA31D         (1u << 31)
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_TC2_WO0_PA16D                 16  /**< \brief TC2 signal: WO0 on PA16 mux D */
#define MUX_TC2_WO0_PA16D                  3
#define PINMUX_TC2_WO0_PA16D       ((PIN_TC2_WO0_PA16D << 16) | MUX_TC2_WO0_PA16D)
#define PORT_TC2_WO0_PA16D         (1u << 16)
#define PIN_TC2_WO0_PA12D                 12  /**< \brief TC2 signal: WO0 on PA12 mux D */
#define MUX_TC2_WO0_PA12D                  3
#define PINMUX_TC2_WO0_PA12D       ((PIN_TC2_WO0_PA12D << 16) | MUX_TC2_WO0_PA12D)
#define PORT_TC2_WO0_PA12D         (1u << 12)
#define PIN_TC2_WO1_PA17D                 17  /**< \brief TC2 signal: WO1 on PA17 mux D */
#define MUX_TC2_WO1_PA17D                  3
#define PINMUX_TC2_WO1_PA17D       ((PIN_TC2_WO1_PA17D << 16) | MUX_TC2_WO1_PA17D)
#define PORT_TC2_WO1_PA17D         (1u << 17)
#define PIN_TC2_WO1_PA13D                 13  /**< \brief TC2 signal: WO1 on PA13 mux D */
#define MUX_TC2_WO1_PA13D                  3
#define PINMUX_TC2_WO1_PA13D       ((PIN_TC2_WO1_PA13D << 16) | MUX_TC2_WO1_PA13D)
#define PORT_TC2_WO1_PA13D         (1u << 13)
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_TC3_WO0_PA14D                 14  /**< \brief TC3 signal: WO0 on PA14 mux D */
#define MUX_TC3_WO0_PA14D                  3
#define PINMUX_TC3_WO0_PA14D       ((PIN_TC3_WO0_PA14D << 16) | MUX_TC3_WO0_PA14D)
#define PORT_TC3_WO0_PA14D         (1u << 14)
#define PIN_TC3_WO0_PA18D                 18  /**< \brief TC3 signal: WO0 on PA18 mux D */
#define MUX_TC3_WO0_PA18D                  3
#define PINMUX_TC3_WO0_PA18D       ((PIN_TC3_WO0_PA18D << 16) | MUX_TC3_WO0_PA18D)
#define PORT_TC3_WO0_PA18D         (1u << 18)
#define PIN_TC3_WO1_PA15D                 15  /**< \brief TC3 signal: WO1 on PA15 mux D */
#define MUX_TC3_WO1_PA15D                  3
#define PINMUX_TC3_WO1_PA15D       ((PIN_TC3_WO1_PA15D << 16) | MUX_TC3_WO1_PA15D)
#define PORT_TC3_WO1_PA15D         (1u << 15)
#define PIN_TC3_WO1_PA19D                 19  /**< \brief TC3 signal: WO1 on PA19 mux D */
#define MUX_TC3_WO1_PA19D                  3
#define PINMUX_TC3_WO1_PA19D       ((PIN_TC3_WO1_PA19D << 16) | MUX_TC3_WO1_PA19D)
#define PORT_TC3_WO1_PA19D         (1u << 19)
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_TC4_WO0_PB08D                 40  /**< \brief TC4 signal: WO0 on PB08 mux D */
#define MUX_TC4_WO0_PB08D                  3
#define PINMUX_TC4_WO0_PB08D       ((PIN_TC4_WO0_PB08D << 16) | MUX_TC4_WO0_PB08D)
#define PORT_TC4_WO0_PB08D         (1u <<  8)
#define PIN_TC4_WO0_PA24D                 24  /**< \brief TC4 signal: WO0 on PA24 mux D */
#define MUX_TC4_WO0_PA24D                  3
#define PINMUX_TC4_WO0_PA24D       ((PIN_TC4_WO0_PA24D << 16) | MUX_TC4_WO0_PA24D)
#define PORT_TC4_WO0_PA24D         (1u << 24)
#define PIN_TC4_WO1_PB09D                 41  /**< \brief TC4 signal: WO1 on PB09 mux D */
#define MUX_TC4_WO1_PB09D                  3
#define PINMUX_TC4_WO1_PB09D       ((PIN_TC4_WO1_PB09D << 16) | MUX_TC4_WO1_PB09D)
#define PORT_TC4_WO1_PB09D         (1u <<  9)
#define PIN_TC4_WO1_PA25D                 25  /**< \brief TC4 signal: WO1 on PA25 mux D */
#define MUX_TC4_WO1_PA25D                  3
#define PINMUX_TC4_WO1_PA25D       ((PIN_TC4_WO1_PA25D << 16) | MUX_TC4_WO1_PA25D)
#define PORT_TC4_WO1_PA25D         (1u << 25)
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_TC5_WO0_PA26D                 26  /**< \brief TC5 signal: WO0 on PA26 mux D */
#define MUX_TC5_WO0_PA26D                  3
#define PINMUX_TC5_WO0_PA26D       ((PIN_TC5_WO0_PA26D << 16) | MUX_TC5_WO0_PA26D)
#define PORT_TC5_WO0_PA26D         (1u << 26)
#define PIN_TC5_WO0_PB00D                 32  /**< \brief TC5 signal: WO0 on PB00 mux D */
#define MUX_TC5_WO0_PB00D                  3
#define PINMUX_TC5_WO0_PB00D       ((PIN_TC5_WO0_PB00D << 16) | MUX_TC5_WO0_PB00D)
#define PORT_TC5_WO0_PB00D         (1u <<  0)
#define PIN_TC5_WO0_PB10D                 42  /**< \brief TC5 signal: WO0 on PB10 mux D */
#define MUX_TC5_WO0_PB10D                  3
#define PINMUX_TC5_WO0_PB10D       ((PIN_TC5_WO0_PB10D << 16) | MUX_TC5_WO0_PB10D)
#define PORT_TC5_WO0_PB10D         (1u << 10)
#define PIN_TC5_WO1_PA27D                 27  /**< \brief TC5 signal: WO1 on PA27 mux D */
#define MUX_TC5_WO1_PA27D                  3
#define PINMUX_TC5_WO1_PA27D       ((PIN_TC5_WO1_PA27D << 16) | MUX_TC5_WO1_PA27D)
#define PORT_TC5_WO1_PA27D         (1u << 27)
#define PIN_TC5_WO1_PB01D                 33  /**< \brief TC5 signal: WO1 on PB01 mux D */
#define MUX_TC5_WO1_PB01D                  3
#define PINMUX_TC5_WO1_PB01D       ((PIN_TC5_WO1_PB01D << 16) | MUX_TC5_WO1_PB01D)
#define PORT_TC5_WO1_PB01D         (1u <<  1)
#define PIN_TC5_WO1_PB11D                 43  /**< \brief TC5 signal: WO1 on PB11 mux D */
#define MUX_TC5_WO1_PB11D                  3
#define PINMUX_TC5_WO1_PB11D       ((PIN_TC5_WO1_PB11D << 16) | MUX_TC5_WO1_PB11D)
#define PORT_TC5_WO1_PB11D         (1u << 11)
/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_TC6_WO0_PB16D                 48  /**< \brief TC6 signal: WO0 on PB16 mux D */
#define MUX_TC6_WO0_PB16D                  3
#define PINMUX_TC6_WO0_PB16D       ((PIN_TC6_WO0_PB16D << 16) | MUX_TC6_WO0_PB16D)
#define PORT_TC6_WO0_PB16D         (1u << 16)
#define PIN_TC6_WO0_PB20D                 52  /**< \brief TC6 signal: WO0 on PB20 mux D */
#define MUX_TC6_WO0_PB20D                  3
#define PINMUX_TC6_WO0_PB20D       ((PIN_TC6_WO0_PB20D << 16) | MUX_TC6_WO0_PB20D)
#define PORT_TC6_WO0_PB20D         (1u << 20)
#define PIN_TC6_WO1_PB17D                 49  /**< \brief TC6 signal: WO1 on PB17 mux D */
#define MUX_TC6_WO1_PB17D                  3
#define PINMUX_TC6_WO1_PB17D       ((PIN_TC6_WO1_PB17D << 16) | MUX_TC6_WO1_PB17D)
#define PORT_TC6_WO1_PB17D         (1u << 17)
#define PIN_TC6_WO1_PB21D                 53  /**< \brief TC6 signal: WO1 on PB21 mux D */
#define MUX_TC6_WO1_PB21D                  3
#define PINMUX_TC6_WO1_PB21D       ((PIN_TC6_WO1_PB21D << 16) | MUX_TC6_WO1_PB21D)
#define PORT_TC6_WO1_PB21D         (1u << 21)
/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_TC7_WO0_PB18D                 50  /**< \brief TC7 signal: WO0 on PB18 mux D */
#define MUX_TC7_WO0_PB18D                  3
#define PINMUX_TC7_WO0_PB18D       ((PIN_TC7_WO0_PB18D << 16) | MUX_TC7_WO0_PB18D)
#define PORT_TC7_WO0_PB18D         (1u << 18)
#define PIN_TC7_WO0_PB22D                 54  /**< \brief TC7 signal: WO0 on PB22 mux D */
#define MUX_TC7_WO0_PB22D                  3
#define PINMUX_TC7_WO0_PB22D       ((PIN_TC7_WO0_PB22D << 16) | MUX_TC7_WO0_PB22D)
#define PORT_TC7_WO0_PB22D         (1u << 22)
#define PIN_TC7_WO1_PB19D                 51  /**< \brief TC7 signal: WO1 on PB19 mux D */
#define MUX_TC7_WO1_PB19D                  3
#define PINMUX_TC7_WO1_PB19D       ((PIN_TC7_WO1_PB19D << 16) | MUX_TC7_WO1_PB19D)
#define PORT_TC7_WO1_PB19D         (1u << 19)
#define PIN_TC7_WO1_PB23D                 55  /**< \brief TC7 signal: WO1 on PB23 mux D */
#define MUX_TC7_WO1_PB23D                  3
#define PINMUX_TC7_WO1_PB23D       ((PIN_TC7_WO1_PB23D << 16) | MUX_TC7_WO1_PB23D)
#define PORT_TC7_WO1_PB23D         (1u << 23)

/*@}*/

/* ************************************************************************** */
/**  MEMORY MAPPING DEFINITIONS FOR SAM0+D */
/* ************************************************************************** */

#if defined __SAM0+D64G3__
  #define FLASH_SIZE          0x10000 /* 64 kB */
  #define FLASH_PAGE_SIZE     64
  #define FLASH_NB_OF_PAGES   1024
  #define FLASH_USER_PAGE_SIZE 64
  #define HRAMC0_SIZE         0x8000 /* 32 kB */

#elif defined __SAM0+D64G4__
  #define FLASH_SIZE          0x10000 /* 64 kB */
  #define FLASH_PAGE_SIZE     64
  #define FLASH_NB_OF_PAGES   1024
  #define FLASH_USER_PAGE_SIZE 64
  #define HRAMC0_SIZE         0x8000 /* 32 kB */

#elif defined __SAM0+D128G3__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     64
  #define FLASH_NB_OF_PAGES   2048
  #define FLASH_USER_PAGE_SIZE 64
  #define HRAMC0_SIZE         0x8000 /* 32 kB */

#elif defined __SAM0+D128G4__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     64
  #define FLASH_NB_OF_PAGES   2048
  #define FLASH_USER_PAGE_SIZE 64
  #define HRAMC0_SIZE         0x8000 /* 32 kB */

#elif defined __SAM0+D256G3__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     64
  #define FLASH_NB_OF_PAGES   4096
  #define FLASH_USER_PAGE_SIZE 64
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
#else
  #error Library does not support the specified device.
#endif

#define FLASH_ADDR            (0x00000000u) /**< FLASH base address */
#define FLASH_USER_PAGE_ADDR  (0x00800000u) /**< FLASH_USER_PAGE base address */
#define HRAMC0_ADDR           (0x20000000u) /**< HRAMC0 base address */

#ifdef __cplusplus
}
#endif

/*@}*/

#endif /* SAM0+D_H */
